[
  {
    "CLNAME": "Barbarian",
    "ARCHETYPE": "Base",
    "ABILITYA": "STR",
    "ABILITYB": "CON",
    "ABILITYC": "DEX",
    "ABILITYD": "CHA",
    "ABILITYE": "WIS",
    "ABILITYF": "INT",
    "DESCRIPTION": "People of towns and cities take pride in how their civilized ways set them apart from animals, as if denying one’s own nature was a mark of superiority. To a barbarian, though, civilization is no virtue, but a sign of weakness. The strong embrace their animal nature-keen instincts, primal physicality, and ferocious rage. Barbarians are uncomfortable when hedged in by walls and crowds. They thrive in the wilds of their homelands: the tundra, jungle, or grasslands where their tribes live and hunt.\n     Barbarians come alive in the chaos of combat. They can enter a berserk state where rage takes over, giving them superhuman strength and resilience. A barbarian can draw on this reservoir of fury only a few times without resting, but those few rages are usually sufficient to defeat whatever threats arise.",
    "ADVROLE": "Melee combat, wilderness",
    "HITDIE": "12",
    "AVEHPLVL": "7",
    "PRIMARY_ABILITIES": "Strength",
    "ARMOR_PROF0": "1",
    "ARMOR_PROF1": "2",
    "ARMOR_PROF2": "4",
    "WPN_PROF0": "Martial",
    "WPN_PROF1": "Simple",
    "FUNDS": "2d4",
    "FUNDSMULTIPLIER": "10",
    "NUMOFKITS": "0",
    "SAVES0": "Constitution",
    "SAVES1": "Strength",
    "SKILLS0": "1",
    "SKILLS1": "8",
    "SKILLS2": "10",
    "SKILLS3": "13",
    "SKILLS4": "14",
    "SKILLS5": "16",
    "SKILLNUM": "2",
    "SPELLTYPE": "None",
    "SOURCE": "CORE"
  },
  {
    "CLNAME": "Bard",
    "ARCHETYPE": "Base",
    "ABILITYA": "CHA",
    "ABILITYB": "DEX",
    "ABILITYC": "CON",
    "ABILITYD": "INT",
    "ABILITYE": "WIS",
    "ABILITYF": "STR",
    "DESCRIPTION": "In the worlds of D\u0026D, words and music are not just vibrations of air, but vocalizations with power all their own. The music of bards is an attempt to snatch and harness the echoes of the cosmos, subtly woven into their spells and powers.\n     The greatest strength of bards is their sheer versatility. Many bards prefer to stick to the sidelines in combat, using their magic to inspire their allies and hinder their foes from a distance. But bards are capable of defending themselves in melee if necessary, using their magic to bolster their swords and armor. Their spells lean toward charms and illusions rather than blatantly destructive spells. They have a wide-ranging knowledge of many subjects and a natural aptitude that lets them do almost anything well. Bards become masters of the talents they set their minds to perfecting, from musical performance to esoteric knowledge.",
    "ADVROLE": "Inspiration, support",
    "HITDIE": "8",
    "AVEHPLVL": "5",
    "PRIMARY_ABILITIES": "Charisma",
    "ARMOR_PROF0": "1",
    "WPN_PROF0": "Rogue",
    "WPN_PROF1": "Simple",
    "TOOLS0": "25",
    "TOOLS1": "26",
    "TOOLS2": "27",
    "TOOLS3": "28",
    "TOOLS4": "29",
    "TOOLS5": "30",
    "TOOLS6": "31",
    "TOOLS7": "32",
    "TOOLS8": "33",
    "TOOLS9": "34",
    "FUNDS": "5d4",
    "FUNDSMULTIPLIER": "10",
    "NUMOFKITS": "3",
    "SAVES0": "Charisma",
    "SAVES1": "Dexterity",
    "SKILLS0": "1",
    "SKILLS1": "2",
    "SKILLS2": "3",
    "SKILLS3": "4",
    "SKILLS4": "5",
    "SKILLS5": "6",
    "SKILLS6": "7",
    "SKILLS7": "8",
    "SKILLS8": "9",
    "SKILLS9": "10",
    "SKILLS10": "11",
    "SKILLS11": "12",
    "SKILLS12": "13",
    "SKILLS13": "14",
    "SKILLS14": "15",
    "SKILLS15": "16",
    "SKILLS16": "17",
    "SKILLS17": "18",
    "SKILLNUM": "3",
    "SPELLTYPE": "Divine",
    "SOURCE": "CORE"
  },
  {
    "CLNAME": "Cleric",
    "ARCHETYPE": "Base",
    "ABILITYA": "WIS",
    "ABILITYB": "CHA",
    "ABILITYC": "STR",
    "ABILITYD": "CON",
    "ABILITYE": "INT",
    "ABILITYF": "DEX",
    "DESCRIPTION": "Divine magic, as the name suggests, is the power of the gods, flowing from them into the world. Clerics are conduits for that power, manifesting it as miraculous effects. The gods don’t grant this power to everyone who seeks it, but only to those chosen to fulfill a high calling.\n     Harnessing divine magic doesn’t rely on study or training. A cleric might learn formulaic prayers and ancient rites, but the ability to cast cleric spells relies on devotion and an intuitive sense o f a deity’s wishes.\n     Clerics combine the helpful magic of healing and inspiring their allies with spells that harm and hinder foes. They can provoke awe and dread, lay curses of plague or poison, and even call down flames from heaven to consume their enemies. For those evildoers who will benefit most from a mace to the head, clerics depend on their combat training to let them wade into melee with the power of the gods on their side.",
    "ADVROLE": "Healing, protection",
    "HITDIE": "8",
    "AVEHPLVL": "5",
    "PRIMARY_ABILITIES": "Wisdom",
    "ARMOR_PROF0": "1",
    "ARMOR_PROF1": "2",
    "ARMOR_PROF2": "4",
    "WPN_PROF0": "Simple",
    "FUNDS": "5d4",
    "FUNDSMULTIPLIER": "10",
    "NUMOFKITS": "0",
    "SAVES0": "Charisma",
    "SAVES1": "Wisdom",
    "SKILLS0": "6",
    "SKILLS1": "9",
    "SKILLS2": "11",
    "SKILLS3": "12",
    "SKILLS4": "18",
    "SKILLNUM": "2",
    "SPELLTYPE": "Divine",
    "SOURCE": "CORE"
  },
  {
    "CLNAME": "Druid",
    "ARCHETYPE": "Base",
    "ABILITYA": "WIS",
    "ABILITYB": "INT",
    "ABILITYC": "DEX",
    "ABILITYD": "CON",
    "ABILITYE": "STR",
    "ABILITYF": "CHA",
    "DESCRIPTION": "Druids revere nature above all, gaining their spells and other magical powers either from the force of nature itself or from a nature deity. Many druids pursue a mystic spirituality of transcendent union with nature rather than devotion to a divine entity, while others serve gods of wild nature, animals, or elemental forces.\nThe ancient druidic traditions are sometimes called the Old Faith, in contrast to the worship of gods in temples and shrines. Druid spells are oriented toward nature and animals—the power of tooth and claw, of sun and moon, of fire and storm. Druids also gain the ability to take on animal forms, and some druids make a particular study of this practice, even to the point where they prefer animal form to their natural form.",
    "ADVROLE": "Wilderness, support",
    "HITDIE": "8",
    "AVEHPLVL": "5",
    "PRIMARY_ABILITIES": "Wisdom",
    "ARMOR_PROF0": "5",
    "WPN_PROF0": "Druidic",
    "TOOLS0": "24",
    "FUNDS": "2d4",
    "FUNDSMULTIPLIER": "10",
    "NUMOFKITS": "1",
    "SAVES0": "Intelligence",
    "SAVES1": "Wisdom",
    "SKILLS0": "5",
    "SKILLS1": "8",
    "SKILLS2": "9",
    "SKILLS3": "10",
    "SKILLS4": "11",
    "SKILLS5": "12",
    "SKILLS6": "13",
    "SKILLS7": "14",
    "SKILLNUM": "2",
    "SPELLTYPE": "Divine",
    "SOURCE": "CORE"
  },
  {
    "CLNAME": "Fighter",
    "ARCHETYPE": "Base",
    "ABILITYA": "STR",
    "ABILITYB": "CON",
    "ABILITYC": "DEX",
    "ABILITYD": "CHA",
    "ABILITYE": "INT",
    "ABILITYF": "WIS",
    "DESCRIPTION": "Fighters learn the basics of all combat styles. Every fighter can swing an axe, fence with a rapier, wield a longsword or a greatsword, use a bow, and even trap foes in a net with some degree of skill. Likewise, a fighter is adept with shields and every form of armor. Beyond that basic degree of familiarity, each fighter specializes in a certain style of combat. Some concentrate on archery, some on fighting with two weapons at once, and some on augmenting their martial skills with magic. This combination of broad general ability and extensive specialization makes fighters superior combatants on battlefields and in dungeons alike.",
    "ADVROLE": "Melee combat specialization",
    "HITDIE": "10",
    "AVEHPLVL": "6",
    "PRIMARY_ABILITIES": "Strength or Dexterity",
    "ARMOR_PROF0": "1",
    "ARMOR_PROF1": "2",
    "ARMOR_PROF2": "3",
    "ARMOR_PROF3": "4",
    "WPN_PROF0": "Martial",
    "WPN_PROF1": "Simple",
    "FUNDS": "5d4",
    "FUNDSMULTIPLIER": "10",
    "NUMOFKITS": "0",
    "SAVES0": "Constitution",
    "SAVES1": "Strength",
    "SKILLS0": "1",
    "SKILLS1": "2",
    "SKILLS2": "6",
    "SKILLS3": "10",
    "SKILLS4": "11",
    "SKILLS5": "13",
    "SKILLS6": "14",
    "SKILLS7": "16",
    "SKILLNUM": "2",
    "SPELLTYPE": "None",
    "SOURCE": "CORE"
  },
  {
    "CLNAME": "Monk",
    "ARCHETYPE": "Base",
    "ABILITYA": "WIS",
    "ABILITYB": "DEX",
    "ABILITYC": "STR",
    "ABILITYD": "CON",
    "ABILITYE": "INT",
    "ABILITYF": "CHA",
    "DESCRIPTION": "Monks make careful study of a magical energy that most monastic traditions call ki. This energy is an element of the magic that suffuses the multiverse—specifically, the element that flows through living bodies. Monks harness this power within themselves to create magical effects and exceed their bodies\u0027 physical capabilities, and some of their special attacks can hinder the flow of ki in their opponents. Using this energy, monks channel uncanny speed and strength into their unarmed strikes. As they gain experience, their martial training and their mastery of ki gives them more power over their bodies and the bodies of their foes.",
    "ADVROLE": "Melee combat, ki powers",
    "HITDIE": "8",
    "AVEHPLVL": "5",
    "PRIMARY_ABILITIES": "Dexterity \u0026 Wisdom",
    "ARMOR_PROF0": "6",
    "WPN_PROF0": "Monk",
    "WPN_PROF1": "Simple",
    "TOOLS0": "1",
    "TOOLS1": "2",
    "TOOLS2": "3",
    "TOOLS3": "4",
    "TOOLS4": "5",
    "TOOLS5": "6",
    "TOOLS6": "7",
    "TOOLS7": "8",
    "TOOLS8": "9",
    "TOOLS9": "10",
    "TOOLS10": "13",
    "TOOLS11": "14",
    "TOOLS12": "15",
    "TOOLS13": "16",
    "TOOLS14": "17",
    "TOOLS15": "18",
    "TOOLS16": "19",
    "TOOLS17": "25",
    "TOOLS18": "26",
    "TOOLS19": "27",
    "TOOLS20": "28",
    "TOOLS21": "29",
    "TOOLS22": "30",
    "TOOLS23": "31",
    "TOOLS24": "32",
    "TOOLS25": "33",
    "TOOLS26": "34",
    "FUNDS": "5d4",
    "FUNDSMULTIPLIER": "1",
    "NUMOFKITS": "1",
    "SAVES0": "Dexterity",
    "SAVES1": "Strength",
    "SKILLS0": "1",
    "SKILLS1": "2",
    "SKILLS2": "4",
    "SKILLS3": "6",
    "SKILLS4": "9",
    "SKILLS5": "11",
    "SKILLNUM": "2",
    "SPELLTYPE": "None",
    "SOURCE": "CORE"
  },
  {
    "CLNAME": "Paladin",
    "ARCHETYPE": "Base",
    "ABILITYA": "STR",
    "ABILITYB": "CHA",
    "ABILITYC": "WIS",
    "ABILITYD": "CON",
    "ABILITYE": "INT",
    "ABILITYF": "DEX",
    "DESCRIPTION": "Almost by definition, the life of a paladin is an adventuring life. Unless a lasting injury has taken him or her away from adventuring for a time, every paladin lives on the front lines of the cosmic struggle against evil. Fighters are rare enough among the ranks of the militias and armies of the world, but even fewer people can claim the true calling o f a paladin. When they do receive the call, these warriors turn from their former occupations and take up arms to fight evil. Sometimes their oaths lead them into the service of the crown as leaders of elite groups of knights, but even then their loyalty is first to the cause of righteousness, not to crown and country.\nAdventuring paladins take their work seriously. A delve into an ancient ruin or dusty crypt can be a quest driven by a higher purpose than the acquisition of treasure. Evil lurks in dungeons and primeval forests, and even the smallest victory against it can tilt the cosmic balance away from oblivion.",
    "ADVROLE": "Melee combat, healing",
    "HITDIE": "10",
    "AVEHPLVL": "6",
    "PRIMARY_ABILITIES": "Strength \u0026 Charisma",
    "ARMOR_PROF0": "1",
    "ARMOR_PROF1": "2",
    "ARMOR_PROF2": "3",
    "ARMOR_PROF3": "4",
    "WPN_PROF0": "Martial",
    "WPN_PROF1": "Simple",
    "FUNDS": "5d4",
    "FUNDSMULTIPLIER": "10",
    "NUMOFKITS": "0",
    "SAVES0": "Charisma",
    "SAVES1": "Wisdom",
    "SKILLS0": "1",
    "SKILLS1": "9",
    "SKILLS2": "11",
    "SKILLS3": "12",
    "SKILLS4": "16",
    "SKILLS5": "18",
    "SKILLNUM": "2",
    "SPELLTYPE": "Divine",
    "SOURCE": "CORE"
  },
  {
    "CLNAME": "Ranger",
    "ARCHETYPE": "Base",
    "ABILITYA": "DEX",
    "ABILITYB": "WIS",
    "ABILITYC": "STR",
    "ABILITYD": "CON",
    "ABILITYE": "INT",
    "ABILITYF": "CHA",
    "DESCRIPTION": "Warriors of the wilderness, rangers specialize in hunting the monsters that threaten the edges of civilization—humanoid raiders, rampaging beasts and monstrosities, terrible giants, and deadly dragons. They learn to track their quarry as a predator does, moving stealthily through the wilds and hiding themselves in brush and rubble. Rangers focus their combat training on techniques that are particularly useful against their specific favored foes.\nThanks to their familiarity with the wilds, rangers acquire the ability to cast spells that harness nature’s power, much as a druid does. Their spells, like their combat abilities, emphasize speed, stealth, and the hunt. A ranger’s talents and abilities are honed with deadly focus on the grim task of protecting the borderlands.",
    "ADVROLE": "Wilderness, ranged combat",
    "HITDIE": "10",
    "AVEHPLVL": "6",
    "PRIMARY_ABILITIES": "Dexterity \u0026 Wisdom",
    "ARMOR_PROF0": "1",
    "ARMOR_PROF1": "2",
    "ARMOR_PROF2": "4",
    "WPN_PROF0": "Martial",
    "WPN_PROF1": "Simple",
    "FUNDS": "5d4",
    "FUNDSMULTIPLIER": "10",
    "NUMOFKITS": "0",
    "SAVES0": "Dexterity",
    "SAVES1": "Strength",
    "SKILLS0": "1",
    "SKILLS1": "4",
    "SKILLS2": "7",
    "SKILLS3": "8",
    "SKILLS4": "10",
    "SKILLS5": "11",
    "SKILLS6": "13",
    "SKILLS7": "14",
    "SKILLNUM": "3",
    "SPELLTYPE": "Divine",
    "SOURCE": "CORE"
  },
  {
    "CLNAME": "Rogue",
    "ARCHETYPE": "Base",
    "ABILITYA": "DEX",
    "ABILITYB": "INT",
    "ABILITYC": "CHA",
    "ABILITYD": "CON",
    "ABILITYE": "WIS",
    "ABILITYF": "STR",
    "DESCRIPTION": "Rogues devote as much effort to mastering the use of a variety of skills as they do to perfecting their combat abilities, giving them a broad expertise that few other characters can match. Many rogues focus on stealth and deception, while others refine the skills that help them in a dungeon environment, such as climbing, finding and disarming traps, and opening locks.\n     When it comes to combat, rogues prioritize cunning over brute strength. A rogue would rather make one precise strike, placing it exactly where the attack will hurt the target most, than w ear an opponent down with a barrage of attacks. Rogues have an almost supernatural knack for avoiding danger, and a few learn magical tricks to supplement their other abilities.",
    "ADVROLE": "Sealth, secondary combat",
    "HITDIE": "8",
    "AVEHPLVL": "5",
    "PRIMARY_ABILITIES": "Dexterity",
    "ARMOR_PROF0": "1",
    "WPN_PROF0": "Rogue",
    "WPN_PROF1": "Simple",
    "TOOLS0": "37",
    "FUNDS": "4d4",
    "FUNDSMULTIPLIER": "10",
    "NUMOFKITS": "1",
    "SAVES0": "Dexterity",
    "SAVES1": "Intelligence",
    "SKILLS0": "1",
    "SKILLS1": "2",
    "SKILLS2": "3",
    "SKILLS3": "4",
    "SKILLS4": "7",
    "SKILLS5": "11",
    "SKILLS6": "13",
    "SKILLS7": "15",
    "SKILLS8": "16",
    "SKILLS9": "17",
    "SKILLS10": "18",
    "SKILLNUM": "4",
    "SPELLTYPE": "None",
    "SOURCE": "CORE"
  },
  {
    "CLNAME": "Sorcerer",
    "ARCHETYPE": "Base",
    "ABILITYA": "CHA",
    "ABILITYB": "CON",
    "ABILITYC": "DEX",
    "ABILITYD": "INT",
    "ABILITYE": "WIS",
    "ABILITYF": "STR",
    "DESCRIPTION": "Magic is a part of every sorcerer, suffusing body, mind, and spirit with a latent power that waits to be tapped. Some sorcerers wield magic that springs from an ancient bloodline infused with the magic of dragons. Others carry a raw, uncontrolled magic within them, a chaotic storm that manifests in unexpected ways.\nThe appearance of sorcerous powers is wildly unpredictable: draconic bloodlines, fey or demon blood, a divine blessing, or a sip of from a mystical spring might spark the gift of sorcery…\nSorcerers have no use for the spellbooks and ancient tomes of magic lore that wizards rely on, nor do they rely on a patron to grant their spells as warlocks do. By learning to harness their own inborn magic, they can discover new ways to unleash that power.",
    "ADVROLE": "Arcane combat, support",
    "HITDIE": "6",
    "AVEHPLVL": "4",
    "PRIMARY_ABILITIES": "Charisma",
    "ARMOR_PROF0": "6",
    "WPN_PROF0": "Mundane",
    "FUNDS": "3d4",
    "FUNDSMULTIPLIER": "10",
    "NUMOFKITS": "0",
    "SAVES0": "Charisma",
    "SAVES1": "Constitution",
    "SKILLS0": "5",
    "SKILLS1": "9",
    "SKILLS2": "11",
    "SKILLS3": "15",
    "SKILLS4": "16",
    "SKILLS5": "18",
    "SKILLNUM": "2",
    "SPELLTYPE": "Arcane",
    "SOURCE": "CORE"
  },
  {
    "CLNAME": "Warlock",
    "ARCHETYPE": "Base",
    "ABILITYA": "CHA",
    "ABILITYB": "WIS",
    "ABILITYC": "CON",
    "ABILITYD": "INT",
    "ABILITYE": "STR",
    "ABILITYF": "DEX",
    "DESCRIPTION": "A warlock is defined by a pact with an otherworldly being. Sometimes the relationship between warlock and patron is like that of a cleric and a deity, though the beings that serve as patrons for warlocks are not gods. A warlock might lead a cult dedicated to a demon prince, an archdevil, or an utterly alien entity - beings not typically served by clerics. More often, though, the arrangement is similar to that between a master and an apprentice. The warlock learns and grows in power, at the cost of occasional services performed on the patron’s behalf.\nThe magic bestowed on a warlock ranges from minor but lasting alterations to the warlock\u0027s being (such as the ability to see in darkness or to read any language) to access to powerful spells. Unlike bookish wizards, warlocks supplement their magic with some facility at hand-to-hand combat. They are comfortable in light armor and know how to use simple weapons.",
    "ADVROLE": "Arcane magic, lore",
    "HITDIE": "8",
    "AVEHPLVL": "5",
    "PRIMARY_ABILITIES": "Charisma",
    "ARMOR_PROF0": "1",
    "WPN_PROF0": "Simple",
    "FUNDS": "4d4",
    "FUNDSMULTIPLIER": "10",
    "NUMOFKITS": "0",
    "SAVES0": "Charisma",
    "SAVES1": "Wisdom",
    "SKILLS0": "5",
    "SKILLS1": "6",
    "SKILLS2": "7",
    "SKILLS3": "8",
    "SKILLS4": "9",
    "SKILLS5": "15",
    "SKILLS6": "16",
    "SKILLNUM": "2",
    "SPELLTYPE": "Arcane",
    "SOURCE": "CORE"
  },
  {
    "CLNAME": "Wizard",
    "ARCHETYPE": "Base",
    "ABILITYA": "INT",
    "ABILITYB": "WIS",
    "ABILITYC": "DEX",
    "ABILITYD": "CON",
    "ABILITYE": "CHA",
    "ABILITYF": "STR",
    "DESCRIPTION": "Wild and enigmatic, varied in form and function, the power of magic draws students who seek to master its mysteries. Some aspire to become like the gods, shaping reality itself. Though the casting of a typical spell requires merely the utterance o f a few strange words, fleeting gestures, and sometimes a pinch or clump of exotic materials, these surface components barely hint at the expertise attained after years of apprenticeship and countless hours of study.\nWizards live and die by their spells. Everything else is secondary. They learn new spells as they experiment and grow in experience. They can also learn them from other wizards, from ancient tomes or inscriptions, and from ancient creatures (such as the fey) that are steeped in magic.",
    "ADVROLE": "Arcane magic, support, lore",
    "HITDIE": "6",
    "AVEHPLVL": "4",
    "PRIMARY_ABILITIES": "Intelligence",
    "ARMOR_PROF0": "6",
    "WPN_PROF0": "Mundane",
    "FUNDS": "4d4",
    "FUNDSMULTIPLIER": "10",
    "NUMOFKITS": "0",
    "SAVES0": "Intelligence",
    "SAVES1": "Wisdom",
    "SKILLS0": "5",
    "SKILLS1": "6",
    "SKILLS2": "7",
    "SKILLS3": "9",
    "SKILLS4": "11",
    "SKILLS5": "12",
    "SKILLNUM": "2",
    "SPELLTYPE": "Arcane",
    "SOURCE": "CORE"
  }
]