[
  {
    "FEAT": "Alert",
    "DESCRIPTION": "Always on the lookout for danger, you gain the following benefits:\n• You gain a +5 bonus to initiative.\n• You can’t be surprised while you are conscious.\n• Other creatures don’t gain advantage on attack rolls against you as a result of being hidden from you.",
    "SHORTDESC": "You are especially aware of your surroundings gaining +5 initiative and you cannot be surprised.",
    "TINYDESC": "You cannot be surprised, +5 Initiative",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Bard",
    "SUGGCLASS2": "Druid",
    "SUGGCLASS3": "Fighter",
    "SUGGCLASS4": "Monk",
    "SUGGCLASS5": "Paladin",
    "SUGGCLASS6": "Ranger",
    "SUGGCLASS7": "Rogue"
  },
  {
    "FEAT": "Athlete",
    "DESCRIPTION": "You have undergone extensive physical training to gain the following benefits:\n• Increase your Strength or Dexterity score by 1, to a maximum of 20.\n• When you are prone, standing up uses only 5 feet of your movement.\n• Climbing doesn’t halve your speed.\n• You can make a running long jump or a running high jump after moving only 5 feet on foot, rather than 10 feet.",
    "SHORTDESC": "You are athletic gaining +1 Str or Dex, standing when prone costs only 5 ft, and climb with your normal speed.",
    "TINYDESC": "Climb and stand up quickly, +1 Str or Dex",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Bard",
    "SUGGCLASS2": "Fighter",
    "SUGGCLASS3": "Monk",
    "SUGGCLASS4": "Paladin",
    "SUGGCLASS5": "Ranger",
    "SUGGCLASS6": "Rogue"
  },
  {
    "FEAT": "Actor",
    "DESCRIPTION": "Skilled at mimicry and dramatics, you gain the following benefits:\n• Increase your Charisma score by 1, to a maximum of 20.\n• You have advantage on Charisma (Deception) and Charisma (Performance) checks when trying to pass yourself off as a different person.\n• You can mimic the speech of another person or the sounds made by other creatures. You must have heard the person speaking, or heard the creature\nmake the sound, for at least 1 minute. A successful Wisdom (Insight) check contested by your Charisma (Deception) check allows a listener to determine that\nthe effect is faked.",
    "SHORTDESC": "You are skilled at impersonation and drama gaining +1 Cha, advantage on Cha (Deception and Performance) checks, and you can mimic sounds and voices.",
    "TINYDESC": "Adv On Deception, Perform, and +1 Cha",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Rogue",
    "SUGGCLASS2": "Sorcerer",
    "SUGGCLASS3": "Warlock"
  },
  {
    "FEAT": "Charger",
    "DESCRIPTION": "When you use your action to Dash, you can use a bonus action to make one melee weapon attack or to shove a creature.\n     If you move at least 10 feet in a straight line immediately before taking this bonus action, you either gain a +5 bonus to the attack’s damage roll (if you chose to make a melee attack and hit) or push the target up to 10 feet away from you (if you chose to shove and you succeed).",
    "SHORTDESC": "When you Dash, you can use your bonus action to make one melee attack (+5 damage) or shove a creature 10 ft.",
    "TINYDESC": "Gain +5 damage or shove a creature",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Fighter",
    "SUGGCLASS2": "Paladin",
    "SUGGCLASS3": "Ranger"
  },
  {
    "FEAT": "Crossbow Expert",
    "DESCRIPTION": "Thanks to extensive practice with the crossbow, you gain the following benefits:\n• You ignore the loading quality of crossbows with which you are proficient.\n• Being within 5 feet of a hostile creature doesn’t impose disadvantage on your ranged attack rolls.\n• When you use the Attack action and attack with a onehanded weapon, you can use a bonus action to attack with a loaded hand crossbow you are holding.",
    "SHORTDESC": "Using a proficient crossbow, you ignore loading quality, no disadvantage in melee with it, and use a loaded hand crossbow as a bonus action.",
    "TINYDESC": "No Disadv when loading a crossbow",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Bard",
    "SUGGCLASS2": "Cleric",
    "SUGGCLASS3": "Fighter",
    "SUGGCLASS4": "Monk",
    "SUGGCLASS5": "Paladin",
    "SUGGCLASS6": "Ranger",
    "SUGGCLASS7": "Rogue",
    "SUGGCLASS8": "Sorcerer",
    "SUGGCLASS9": "Warlock",
    "SUGGCLASS10": "Wizard"
  },
  {
    "FEAT": "Defensive Duelist",
    "DESCRIPTION": "When you are wielding a finesse weapon with which you are proficient and another creature hits you with a melee attack, you can use your reaction to add your proficiency bonus to your AC for that attack, potentially causing the attack to miss you.",
    "SHORTDESC": "Use your reaction to add your proficiency bonus to your AC when you are wielding a finesse weapon.",
    "TINYDESC": "Add Prof Bonus to AC with finesse weapon",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Fighter",
    "SUGGCLASS2": "Monk",
    "SUGGCLASS3": "Ranger",
    "SUGGCLASS4": "Rogue"
  },
  {
    "FEAT": "Dual Wielder",
    "DESCRIPTION": "You master fighting with two weapons, gaining the following benefits:\n• You gain a +1 bonus to AC while you are wielding a separate melee weapon in each hand.\n• You can use two-weapon fighting even when the onehanded melee weapons you are wielding aren’t light.\n• You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one.",
    "SHORTDESC": "You can fight with two weapons, gaining a +1 bonus to AC, use heavier weapons for dual wielding, and draw both weapons when needed.",
    "TINYDESC": "Use most any two weapons, gain +1 AC",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Bard",
    "SUGGCLASS2": "Fighter",
    "SUGGCLASS3": "Ranger",
    "SUGGCLASS4": "Rogue"
  },
  {
    "FEAT": "Dungeon Delver",
    "DESCRIPTION": "Alert to the hidden traps and secret doors found in many dungeons, you gain the following benefits:\n• When you roll a Hit Die to regain hit points, the minimum number of hit points you regain from the roll equals twice your Constitution modifier (minimum of 2).\n• You have advantage on Wisdom (Perception) and Intelligence (Investigation) checks made to detect the presence of secret doors.\n• You have advantage on saving throws made to avoid or resist traps.\n• You have resistance to the damage dealt by traps.\n• You can search for traps while traveling at a normal pace, instead of only at a slow pace.",
    "SHORTDESC": "You are adept at exploring dangerous dungeons, enhancing your HP recovery and granting extra insight into hidden traps and secret doors.",
    "TINYDESC": "Adv Perception, Investigation, Resist traps",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Fighter",
    "SUGGCLASS2": "Monk",
    "SUGGCLASS3": "Paladin",
    "SUGGCLASS4": "Ranger",
    "SUGGCLASS5": "Rogue",
    "SUGGCLASS6": "Sorcerer",
    "SUGGCLASS7": "Warlock",
    "SUGGCLASS8": "Wizard"
  },
  {
    "FEAT": "Durable",
    "DESCRIPTION": "Hardy and resilient, you gain the following benefits:\n• Increase your Constitution score by 1, to a maximum of 20.\n• When you roll a Hit Die to regain hit points, the minimum number of hit points you regain from the roll equals twice your Constitution modifier (minimum of 2).",
    "SHORTDESC": "You are hardy and resilient, gaining +1 Con, and your minimum recovery of HP using a Hit Die is twice your Con modifier.",
    "TINYDESC": "Con +1, heal at least Con modifier x 2",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Druid",
    "SUGGCLASS3": "Fighter",
    "SUGGCLASS4": "Monk",
    "SUGGCLASS5": "Paladin",
    "SUGGCLASS6": "Ranger"
  },
  {
    "FEAT": "Elemental Adept: Acid",
    "DESCRIPTION": "When you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder.\n     Spells you cast ignore resistance to damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can treat any 1 on a damage die as a 2.\n     You can select this feat multiple times. Each time you do so, you must choose a different damage type.",
    "SHORTDESC": "Your spells ignore resistance to acid damage and your acid spells damage dice rolls of 1 are converted to 2.",
    "TINYDESC": "Resist acid, your acid spells ignore Resist",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Druid",
    "SUGGCLASS3": "Sorcerer",
    "SUGGCLASS4": "Warlock",
    "SUGGCLASS5": "Wizard"
  },
  {
    "FEAT": "Elemental Adept: Cold",
    "DESCRIPTION": "When you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder.\n     Spells you cast ignore resistance to damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can treat any 1 on a damage die as a 2.\n     You can select this feat multiple times. Each time you do so, you must choose a different damage type.",
    "SHORTDESC": "Your spells ignore resistance to cold damage and your cold spells damage dice rolls of 1 are converted to 2.",
    "TINYDESC": "Resist cold, cold spells ignore Resistance",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Druid",
    "SUGGCLASS3": "Sorcerer",
    "SUGGCLASS4": "Warlock",
    "SUGGCLASS5": "Wizard"
  },
  {
    "FEAT": "Elemental Adept: Fire",
    "DESCRIPTION": "When you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder.\n     Spells you cast ignore resistance to damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can\ntreat any 1 on a damage die as a 2.\n     You can select this feat multiple times. Each time you do so, you must choose a different damage type.",
    "SHORTDESC": "Your spells ignore resistance to fire damage and your fire spells damage dice rolls of 1 are converted to 2.",
    "TINYDESC": "Resist fire, fire spells ignore Resistance",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Druid",
    "SUGGCLASS3": "Sorcerer",
    "SUGGCLASS4": "Warlock",
    "SUGGCLASS5": "Wizard"
  },
  {
    "FEAT": "Elemental Adept: Lightning",
    "DESCRIPTION": "When you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder.\n     Spells you cast ignore resistance to damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can\ntreat any 1 on a damage die as a 2.\n     You can select this feat multiple times. Each time you do so, you must choose a different damage type.",
    "SHORTDESC": "Your spells ignore resistance to lightning damage and your lightning spells damage dice rolls of 1 are converted to 2.",
    "TINYDESC": "Resist lightning, spells ignore Resistance",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Druid",
    "SUGGCLASS3": "Sorcerer",
    "SUGGCLASS4": "Warlock",
    "SUGGCLASS5": "Wizard"
  },
  {
    "FEAT": "Elemental Adept: Thunder",
    "DESCRIPTION": "When you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder.\n     Spells you cast ignore resistance to damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can treat any 1 on a damage die as a 2.\n     You can select this feat multiple times. Each time you do so, you must choose a different damage type.",
    "SHORTDESC": "Your spells ignore resistance to thunder damage and your thunder spells damage dice rolls of 1 are converted to 2.",
    "TINYDESC": "Resist thunder, spells ignore Resistance",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Druid",
    "SUGGCLASS3": "Sorcerer",
    "SUGGCLASS4": "Warlock",
    "SUGGCLASS5": "Wizard"
  },
  {
    "FEAT": "Grappler",
    "DESCRIPTION": "You’ve developed the skills necessary to hold your own in close-quarters grappling. You gain the following benefits:\n• You have advantage on attack rolls against a creature you are grappling.\n• You can use your action to try to pin a creature grappled by you. To do so, make another grapple check. If you succeed, you and the creature are both restrained until the grapple ends.\n• Creatures that are one size larger than you don’t automatically succeed on checks to escape your grapple.",
    "SHORTDESC": "You can wrestle or grapple exceptionally, gaining advantage, you can restrain opponents, and larger creatures cannot automically escape your grapple.",
    "TINYDESC": "Adv grappling, pin, grapple larger creatures",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Fighter",
    "SUGGCLASS2": "Monk"
  },
  {
    "FEAT": "Great Weapon Master",
    "DESCRIPTION": "You’ve learned to put the weight of a weapon to your advantage, letting its momentum empower your strikes. You gain the following benefits:\n• On your turn, when you score a critical hit with a melee weapon or reduce a creature to 0 hit points with one, you can make one melee weapon attack as a bonus action.\n• Before you make a melee attack with a heavy weapon that you are proficient with, you can choose to take a -5 penalty to the attack roll. If the attack hits, you add\n+10 to the attack’s damage.",
    "SHORTDESC": "You excel with great weapons, granting the option to take -5 to attack to add +10 to damage and a bonus melee weapon attack on a critical hit or kill.",
    "TINYDESC": "+10 bonus dmg (-5 Att roll), bonus attack",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Fighter",
    "SUGGCLASS2": "Paladin"
  },
  {
    "FEAT": "Healer",
    "DESCRIPTION": "You are an able physician, allowing you to mend wounds quickly and get your allies back in the fight. You gain the following benefits:\n• When you use a healer’s kit to stabilize a dying creature, that creature also regains 1 hit point.\n• As an action, you can spend one use of a healer’s kit to tend to a creature and restore 1d6 + 4 hit points to it, plus additional hit points equal to the creature’s maximum number of Hit Dice. The creature can’t regain hit points from this feat again until it finishes a short or long rest.",
    "SHORTDESC": "You can use your healer\u0027s kit to stabilize a dying creature to 1 HP and you can restore 1d6+4 HP plus HP equal to the creature\u0027s max Hit Dice.",
    "TINYDESC": "Stabilize to 1 hp, restor 1d6+4 + max #HD",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Druid",
    "SUGGCLASS3": "Paladin",
    "SUGGCLASS4": "Ranger"
  },
  {
    "FEAT": "Heavily Armored",
    "DESCRIPTION": "You have trained to master the use of heavy armor, gaining the following benefits:\n• Increase your Strength score by 1, to a maximum of 20.\n• You gain proficiency with heavy armor.",
    "SHORTDESC": "You have trained to use heavy armor, granting Str +1 and proficiency with heavy armor.",
    "TINYDESC": "Gain proficiency Heavy Armor, Str +1",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Ranger"
  },
  {
    "FEAT": "Heavy Armor Master",
    "DESCRIPTION": "You can use your armor to deflect strikes that would kill others. You gain the following benefits:\n• Increase your Strength score by 1, to a maximum of 20.\n• While you are wearing heavy armor, bludgeoning, piercing, and slashing damage that you take from non-magical weapons is reduced by 3.",
    "SHORTDESC": "You can use your armor to deflect deadly strikes granting +1 Str and -3 to bludgeoning, piercing, and slashing damage.",
    "TINYDESC": "Reduce non-magical weapon dmg by 3, Str +1",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Fighter",
    "SUGGCLASS1": "Paladin"
  },
  {
    "FEAT": "Inspiring Leader",
    "DESCRIPTION": "You can spend 10 minutes inspiring your companions, shoring up their resolve to fight. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you who can see or hear you and who can understand you. Each creature can gain temporary hit points equal to your level + your Charisma modifier.\n     A creature can’t gain temporary hit points from this feat again until it has finished a short or long rest.",
    "SHORTDESC": "You can spend 10 minutes inspiring your allies, granting bonus HP equal to your level + your Charisma modifier.",
    "TINYDESC": "Inspire allies, temporary HP (lvl + Cha mod)",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Fighter",
    "SUGGCLASS3": "Paladin",
    "SUGGCLASS4": "Sorcerer",
    "SUGGCLASS5": "Warlock"
  },
  {
    "FEAT": "Keen Mind",
    "DESCRIPTION": "You have a mind that can track time, direction, and detail with uncanny precision. You gain the following benefits.\n• Increase your Intelligence score by 1, to a maximum of 20.\n• You always know which way is north.\n• You always know the number of hours left before the next sunrise or sunset.\n• You can accurately recall anything you have seen or heard within the past month.",
    "SHORTDESC": "You have an astute mind that is attentive to detail, granting +1 Int, you always know North and the time of day, and you can recall all details within the past month.",
    "TINYDESC": "Know direction, time, recall, Int +1",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Ranger",
    "SUGGCLASS2": "Rogue",
    "SUGGCLASS3": "Wizard"
  },
  {
    "FEAT": "Lightly Armored",
    "DESCRIPTION": "You have trained to master the use of light armor, gaining the following benefits:\n• Increase your Strength or Dexterity score by 1, to a maximum of 20.\n• You gain proficiency with light armor.",
    "SHORTDESC": "You have trained to master the use of light armor, granting you +1 Dex or Str and proficiency with light armor.",
    "TINYDESC": "Proficient with light armor, Str or Dex +1",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Monk",
    "SUGGCLASS1": "Sorcerer",
    "SUGGCLASS2": "Wizard"
  },
  {
    "FEAT": "Linguist",
    "DESCRIPTION": "You have studied languages and codes, gaining the following benefits:\n• Increase your Intelligence score by 1, to a maximum of 20.\n• You learn three languages of your choice.\n• You can ably create written ciphers. Others can’t decipher a code you create unless you teach them, they succeed on an Intelligence check (DC equal to your\nIntelligence score + your proficiency bonus), or they use magic to decipher it.",
    "SHORTDESC": "You have studied languages and codes granting you +1 Int, three additional languages, and you write in code.",
    "TINYDESC": "Learn 3 languages, create cyphers, Int +1",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Druid",
    "SUGGCLASS3": "Monk",
    "SUGGCLASS4": "Ranger",
    "SUGGCLASS5": "Rogue",
    "SUGGCLASS6": "Sorcerer",
    "SUGGCLASS7": "Warlock",
    "SUGGCLASS8": "Wizard"
  },
  {
    "FEAT": "Lucky",
    "DESCRIPTION": "You have inexplicable luck that seems to kick in at just the right moment.\n     You have 3 luck points. Whenever you make an attack roll, an ability check, or a saving throw, you can spend one luck point to roll an additional d20. You can choose to spend one of your luck points after you roll the die, but before the outcome is determined. You choose which\nof the d20s is used for the attack roll, ability check, or saving throw.\n     You can also spend one luck point when an attack roll is made against you. Roll a d20, and then choose whether the attack uses the attacker’s roll or yours.\n     If more than one creature spends a luck point to influence the outcome of a roll, the points cancel each other out; no additional dice are rolled.\n     You regain your expended luck points when you finish a long rest.",
    "SHORTDESC": "You have inexplicable luck granting you 3 luck points, allowing you to roll and extra d20 on an attack, ability check, or save.",
    "TINYDESC": "Gain luck vs attacks, ability check or save",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Monk",
    "SUGGCLASS2": "Ranger",
    "SUGGCLASS3": "Rogue"
  },
  {
    "FEAT": "Mage Slayer",
    "DESCRIPTION": "You have practiced techniques useful in melee combat against spellcasters, gaining the following benefits:\n• When a creature within 5 feet of you casts a spell, you can use your reaction to make a melee weapon attack against that creature.\n• When you damage a creature that is concentrating on a spell, that creature has disadvantage on the saving throw it makes to maintain its concentration.\n• You have advantage on saving throws against spells cast by creatures within 5 feet of you.",
    "SHORTDESC": "You have trained to kill spellcasters, granting you a reaction to a caster (whom is casting) within 5 ft, forcing disadvantage on its concentration, and advantage with saves against spells within 5 ft.",
    "TINYDESC": "Gain an attack and saves vs spellcasters",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Fighter",
    "SUGGCLASS2": "Monk",
    "SUGGCLASS3": "Rogue"
  },
  {
    "FEAT": "Magic Initiate",
    "DESCRIPTION": "Choose a class: bard, cleric, druid, sorcerer, warlock, or wizard. You learn two cantrips of your choice from that class’s spell list.\n     In addition, choose one 1st-level spell from that same list. You learn that spell and can cast it at its lowest level. Once you cast it, you must finish a long rest before you can cast it again.\n     Your spellcasting ability for these spells depends on the class you chose: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid: or Intelligence for wizard.",
    "SHORTDESC": "You select one spellcaster class as your training and gain two catrips from their list.",
    "TINYDESC": "Learn 2 cantrips and one 1st-level spell",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Druid",
    "SUGGCLASS3": "Sorcerer",
    "SUGGCLASS4": "Warlock",
    "SUGGCLASS5": "Wizard"
  },
  {
    "FEAT": "Martial Adept",
    "DESCRIPTION": "You have martial training that allows you to perform special combat maneuvers. You gain the following benefits:\n• You learn two maneuvers of your choice from among those available to the Battle Master archetype in the fighter class. If a maneuver you use requires your target to make a saving throw to resist the maneuver’s effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).\n• If you already have superiority dice, you gain one more; otherwise, you have one superiority die, which is a d6. This die is used to fuel your maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a short or long rest.",
    "SHORTDESC": "You have trained for battle learning two maneuvers from the Battle Master (fighter) archetype and gaining one superiority die.",
    "TINYDESC": "Learn two battle maneuvers",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Bard",
    "SUGGCLASS2": "Cleric",
    "SUGGCLASS3": "Druid",
    "SUGGCLASS4": "Fighter",
    "SUGGCLASS5": "Monk",
    "SUGGCLASS6": "Paladin",
    "SUGGCLASS7": "Ranger",
    "SUGGCLASS8": "Rogue",
    "SUGGCLASS9": "Warlock"
  },
  {
    "FEAT": "Medium Armor Master",
    "DESCRIPTION": "You have practiced moving in medium armor to gain the following benefits:\n• Wearing medium armor doesn’t impose disadvantage on your Dexterity (Stealth) checks.\n• When you wear medium armor, you can add 3, rather than 2, to your AC if you have a Dexterity of 16 or higher.",
    "SHORTDESC": "You are practiced in medium armor, granting a higher Dex modifier (max 3)  and offsetting disadvantage on your Dexterity (Stealth) checks.",
    "TINYDESC": "No Disadv on Stealth checks and max Dex +3",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Fighter",
    "SUGGCLASS3": "Paladin",
    "SUGGCLASS4": "Ranger"
  },
  {
    "FEAT": "Mobile",
    "DESCRIPTION": "You are exceptionally speedy and agile. You gain the following benefits:\n• Your speed increases by 10 feet.\n• When you use the Dash action, difficult terrain doesn’t cost you extra movement on that turn.\n• When you make a melee attack against a creature, you don’t provoke opportunity attacks from that creature for the rest of the turn, whether you hit or not.",
    "SHORTDESC": "You are exceptionally speedy and agile., granting you +10 ft speed, reducing difficult terrain penalties",
    "TINYDESC": "Ignore difficult terrain and speed +10",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Bard",
    "SUGGCLASS2": "Fighter",
    "SUGGCLASS3": "Monk",
    "SUGGCLASS4": "Ranger",
    "SUGGCLASS5": "Rogue",
    "SUGGCLASS6": "Warlock"
  },
  {
    "FEAT": "Moderately Armored",
    "DESCRIPTION": "You have trained to master the use of medium armor and shields, gaining the following benefits:\n• Increase your Strength or Dexterity score by 1, to a maximum of 20.\n• You gain proficiency with medium armor and shields.",
    "SHORTDESC": "You have trained to master the use of medium armor and shields, gaining +1 Str or Dex and proficiency in medium armor and shields.",
    "TINYDESC": "Prof medium armor, shields, Str or Dex +1",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Rogue",
    "SUGGCLASS2": "Warlock"
  },
  {
    "FEAT": "Mounted Combatant",
    "DESCRIPTION": "You are a dangerous foe to face while mounted. While you are mounted and aren’t incapacitated, you gain the following benefits:\n• You have advantage on melee attack rolls against any unmounted creature that is smaller than your mount.\n• You can force an attack targeted at your mount to target you instead.\n• If your mount is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails.",
    "SHORTDESC": "You are a threat while mounted, gaining advantage on melee attack rolls against smaller mounts or unmounted creatures, redirect attacks to you, and your mount avoids more damage with a Dex save.",
    "TINYDESC": "Adv while riding, and less damage to mount",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Fighter",
    "SUGGCLASS2": "Paladin",
    "SUGGCLASS3": "Ranger"
  },
  {
    "FEAT": "Observant",
    "DESCRIPTION": "Quick to notice details of your environment, you gain the following benefits:\n• Increase your Intelligence or Wisdom score by 1, to a maximum of 20.\n• If you can see a creature’s mouth while it is speaking a language you understand, you can interpret what it’s saying by reading its lips.\n• You have a +5 bonus to your passive Wisdom (Perception) and passive Intelligence (Investigation) scores.",
    "SHORTDESC": "You are observant of your environment, gaining +1 Int,",
    "TINYDESC": "Read lips, (Psv) Perception, Investigation +5",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Bard",
    "SUGGCLASS2": "Cleric",
    "SUGGCLASS3": "Druid",
    "SUGGCLASS4": "Fighter",
    "SUGGCLASS5": "Monk",
    "SUGGCLASS6": "Paladin",
    "SUGGCLASS7": "Ranger",
    "SUGGCLASS8": "Rogue",
    "SUGGCLASS9": "Sorcerer",
    "SUGGCLASS10": "Warlock",
    "SUGGCLASS11": "Wizard"
  },
  {
    "FEAT": "Polearm Master",
    "DESCRIPTION": "You can keep your enemies at bay with reach weapons. You gain the following benefits:\n• When you take the Attack action and attack with only a glaive, halberd, or quarterstaff, you can use a bonus action to make a melee attack with the opposite end of the weapon. The weapon’s damage die for this attack is a d4, and the attack deals bludgeoning damage.\n• While you are wielding a glaive, halberd, pike, or quarterstaff, other creatures provoke an opportunity attack from you when they enter your reach.",
    "SHORTDESC": "Utilize your reach weapon to keep enemies at bay, allowing you a bonus action melee attack (dmg d4) and enemies provoke an opp. Attack when they enter your reach.",
    "TINYDESC": "Bonus attack (d4 dmg) with polearm",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Fighter",
    "SUGGCLASS2": "Paladin",
    "SUGGCLASS3": "Ranger"
  },
  {
    "FEAT": "Resilient",
    "DESCRIPTION": "Choose one ability score. You gain the following benefits:\n• Increase the chosen ability score by 1, to a maximum of 20.\n• You gain proficiency in saving throws using the chosen ability.",
    "SHORTDESC": "You are resilient gaining a +1 increase to one ability score and proficiency in saves with the same ability score.",
    "TINYDESC": "Proficiency in chosen Save and Ability +1",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Bard",
    "SUGGCLASS2": "Cleric",
    "SUGGCLASS3": "Druid",
    "SUGGCLASS4": "Fighter",
    "SUGGCLASS5": "Monk",
    "SUGGCLASS6": "Paladin",
    "SUGGCLASS7": "Ranger",
    "SUGGCLASS8": "Rogue",
    "SUGGCLASS9": "Sorcerer",
    "SUGGCLASS10": "Warlock",
    "SUGGCLASS11": "Wizard"
  },
  {
    "FEAT": "Ritual Caster",
    "DESCRIPTION": "You have learned a number of spells that you can cast as rituals. These spells are written in a ritual book, which you must have in hand while casting one of them.\n     When you choose this feat, you acquire a ritual book holding two 1st-level spells of your choice. Choose one of the following classes: bard, cleric, druid, sorcerer, warlock, or wizard. You must choose your spells from that class’s spell list, and the spells you choose must have the ritual tag. The class you choose also determines your spellcasting ability for these spells: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard.\n     If you come across a spell in written form, such as a magical spell scroll or a wizard’s spellbook, you might be able to add it to your ritual book. The spell must be on the spell list for the class you chose, the spell’s level can be no higher than half your level (rounded up), and it must have the ritual tag. The process of copying the spell into your ritual book takes 2 hours per level of the spell, and costs 50 gp per level. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it.",
    "SHORTDESC": "You have learned two ritual 1st-level spells choosing from one of the spellcasting class lists, writing it down in a ritual book.",
    "TINYDESC": "You learn spells to cast as Rituals",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Druid",
    "SUGGCLASS3": "Sorcerer",
    "SUGGCLASS4": "Warlock",
    "SUGGCLASS5": "Wizard"
  },
  {
    "FEAT": "Savage Attacker",
    "DESCRIPTION": "Once per turn when you roll damage for a melee weapon attack, you can reroll the weapon’s damage dice and use either total.",
    "SHORTDESC": "Once per turn when you roll damage for a melee weapon attack, you can reroll the weapon’s damage dice and use either total.",
    "TINYDESC": "Reroll melee weapon damage once per turn",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Fighter",
    "SUGGCLASS2": "Paladin",
    "SUGGCLASS3": "Ranger"
  },
  {
    "FEAT": "Sentinel",
    "DESCRIPTION": "You have mastered techniques to take advantage of every drop in any enemy’s guard, gaining the following benefits:\n• When you hit a creature with an opportunity attack, the creature’s speed becomes 0 for the rest of the turn.\n• Creatures within 5 feet of you provoke opportunity attacks from you even if they take the Disengage action before leaving your reach.\n• When a creature within 5 feet of you makes an attack against a target other than you (and that target doesn’t have this feat), you can use your reaction to make a melee weapon attack against the attacking creature.",
    "SHORTDESC": "You know when to pounce when an enemy slips its guard, granting you opp. Attacks to creatures within 5 ft,",
    "TINYDESC": "Devestate enemies with opportunity attacks",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Fighter",
    "SUGGCLASS3": "Monk",
    "SUGGCLASS4": "Paladin",
    "SUGGCLASS5": "Ranger",
    "SUGGCLASS6": "Rogue"
  },
  {
    "FEAT": "Sharpshooter",
    "DESCRIPTION": "You have mastered ranged weapons and can make shots that others find impossible. You gain the following benefits:\n• Attacking at long range doesn\u0027t impose disadvantage on your ranged weapon attack rolls.\n• Your ranged weapon attacks ignore half cover and three-quarters cover.\n• Before you make an attack with a ranged weapon that you are proficient with, you can choose to take a - 5 penalty to the attack roll. If the attack hits, you add +10 to the attack’s damage.",
    "SHORTDESC": "You have mastered ranged weapons allowing you to attack from long range without disadvantage, ignore half and 3-qtr cover, and opt for -5 attack and +10 damage.",
    "TINYDESC": "No Disadv at long range, dmg +10 (-5 Att roll)",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Bard",
    "SUGGCLASS2": "Fighter",
    "SUGGCLASS3": "Ranger",
    "SUGGCLASS4": "Rogue"
  },
  {
    "FEAT": "Shield Master",
    "DESCRIPTION": "You use shields not just for protection but also for offense. You gain the following benefits while you are wielding a shield:\n• If you take the Attack action on your turn, you can use a bonus action to try to shove a creature within 5 feet of you with your shield.\n• If you aren’t incapacitated, you can add your shield’s AC bonus to any Dexterity saving throw you make against a spell or other harmful effect that targets only you.\n• If you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you can use your reaction to take no damage if you succeed on the saving throw, interposing your shield between yourself and the source of the effect.",
    "SHORTDESC": "You have mastered the use of a shield allowing you to shove with it, shield from a spell, and reduce damage on a Dex save.",
    "TINYDESC": "Shove, block spells, lessen dmg with a shield",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Fighter",
    "SUGGCLASS3": "Paladin",
    "SUGGCLASS4": "Ranger"
  },
  {
    "FEAT": "Skilled",
    "DESCRIPTION": "You gain proficiency in any combination of three skills or tools of your choice.",
    "SHORTDESC": "You gain proficiency in any combination of three skills or tools of your choice.",
    "TINYDESC": "Learn three skills or tools",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Bard",
    "SUGGCLASS2": "Cleric",
    "SUGGCLASS3": "Druid",
    "SUGGCLASS4": "Fighter",
    "SUGGCLASS5": "Monk",
    "SUGGCLASS6": "Paladin",
    "SUGGCLASS7": "Ranger",
    "SUGGCLASS8": "Rogue",
    "SUGGCLASS9": "Sorcerer",
    "SUGGCLASS10": "Warlock",
    "SUGGCLASS11": "Wizard"
  },
  {
    "FEAT": "Skulker",
    "DESCRIPTION": "You are expert at slinking through shadows. You gain the following benefits:\n• You can try to hide when you are lightly obscured from the creature from which you are hiding.\n• When you are hidden from a creature and miss it with a ranged weapon attack, making the attack doesn\u0027t reveal your position.\n• Dim light doesn’t impose disadvantage on your Wisdom (Perception) checks relying on sight.",
    "SHORTDESC": "You deftly hide in shadows allowing you to hide easier, your attacks don\u0027t reveal position when hiding, and dim light doesn\u0027t impose disadvantage when hiding.",
    "TINYDESC": "Hide while attacking and see in dim light",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Rogue",
    "SUGGCLASS2": "Warlock"
  },
  {
    "FEAT": "Spell Sniper",
    "DESCRIPTION": "You have learned techniques to enhance your attacks with certain kinds of spells, gaining the following benefits:\n• When you cast a spell that requires you to make an attack roll, the spell’s range is doubled.\n• Your ranged spell attacks ignore half cover and three-quarters cover.\n• You learn one cantrip that requires an attack roll. Choose the cantrip from the bard, cleric, druid, sorcerer, warlock, or wizard spell list. Your spellcasting ability for this cantrip depends on the spell list you chose from: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard.",
    "SHORTDESC": "You have learned techiniques to enhance your attacks, learning one cantrip that requires an attack roll, doubling the range of attack roll spells, and ignoring cover (except full cover).",
    "TINYDESC": "Double range, and learn one cantrip",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Sorcerer",
    "SUGGCLASS2": "Warlock",
    "SUGGCLASS3": "Wizard"
  },
  {
    "FEAT": "Tavern Brawler",
    "DESCRIPTION": "Accustomed to rough-and-tumble fighting using whatever weapons happen to be at hand, you gain the following benefits:\n• Increase your Strength or Constitution score by 1, to a maximum of 20.\n• You are proficient with improvised weapons and unarmed strikes.\n• Your unarmed strike uses a d4 for damage.\n• When you hit a creature with an unarmed strike or an improvised weapon on your turn, you can use a bonus action to attempt to grapple the target.",
    "SHORTDESC": "You are accustomed to boorish brawling, granting you +1 Str or Con, proficiency with improvised weapons, unarmed attack deals d4 damage and a grappling attempt.",
    "TINYDESC": "Proficient unarmed combat, Str or Con +1",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Fighter",
    "SUGGCLASS2": "Monk",
    "SUGGCLASS3": "Paladin",
    "SUGGCLASS4": "Ranger",
    "SUGGCLASS5": "Rogue"
  },
  {
    "FEAT": "Tough",
    "DESCRIPTION": "Your hit point maximum increases by an amount equal to twice your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum\nincreases by an additional 2 hit points.",
    "SHORTDESC": "You gain 2 hit points per level when you take this feat, and an addition 2 per level afterward.",
    "TINYDESC": "Increase max hit points by +1 per level",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Barbarian",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Fighter",
    "SUGGCLASS3": "Monk",
    "SUGGCLASS4": "Paladin",
    "SUGGCLASS5": "Ranger",
    "SUGGCLASS6": "Warlock"
  },
  {
    "FEAT": "War Caster",
    "DESCRIPTION": "You have practiced casting spells in the midst of combat, learning techniques that grant you the following benefits:\n• You have advantage on Constitution saving throws that you make to maintain your concentration on a spell when you take damage.\n• You can perform the somatic components of spells even when you have weapons or a shield in one or both hands.\n• When a hostile creature’s movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, rather than making an opportunity attack. The spell must have a casting time of 1 action and must target only that creature.",
    "SHORTDESC": "You are practiced in casting spells during combat, granting advantage on your Con saves for concentration, use spell components dual (or shield) wielding, and use your reaction to cast a spell when a creature provokes an opp.",
    "TINYDESC": "Adv Concentration, cast while armed",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Druid",
    "SUGGCLASS3": "Sorcerer",
    "SUGGCLASS4": "Warlock",
    "SUGGCLASS5": "Wizard"
  },
  {
    "FEAT": "Weapon Master",
    "DESCRIPTION": "You have practiced extensively with a variety of weapons, gaining the following benefits:\n• Increase your Strength or Dexterity score by 1, to a maximum of 20.\n• You gain proficiency with four weapons of your choice.",
    "SHORTDESC": "You have learned a wide variety of weapons, gaining +1 Str or Dex and proficiency with four weapons of choice.",
    "TINYDESC": "Proficiency with 4 weapons, Str or Dex +1",
    "SOURCE": "PLHBK",
    "SUGGCLASS0": "Bard",
    "SUGGCLASS1": "Cleric",
    "SUGGCLASS2": "Monk",
    "SUGGCLASS3": "Rogue",
    "SUGGCLASS4": "Warlock"
  }
]