[
  {
    "FEATURE": "Ability Score Improvement F1",
    "ARCHETYPE": "Base",
    "CLASS": "Fighter",
    "LEVEL": "6",
    "SHORTDESC": "Increase your ability scores by a total of 2 points at 4th, 6th, 8th, 12th, 14th, 16th, and 19th levels, or exchange the points for a Feat.",
    "LONGDESC": "When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
  },
  {
    "FEATURE": "Ability Score Improvement F2",
    "ARCHETYPE": "Base",
    "CLASS": "Fighter",
    "LEVEL": "14",
    "SHORTDESC": "Increase your ability scores by a total of 2 points at 4th, 6th, 8th, 12th, 14th, 16th, and 19th levels, or exchange the points for a Feat.",
    "LONGDESC": "When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
  },
  {
    "FEATURE": "Ability Score Improvement I",
    "ARCHETYPE": "Base",
    "CLASS": "All",
    "LEVEL": "4",
    "SHORTDESC": "Increase your ability scores by a total of 2 points at 4th, 8th, 12th, 16th, and 19th levels, or exchange the points for a Feat.",
    "LONGDESC": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Ability Score Improvement II",
    "ARCHETYPE": "Base",
    "CLASS": "All",
    "LEVEL": "8",
    "SHORTDESC": "Increase your ability scores by a total of 2 points at 4th, 8th, 12th, 16th, and 19th levels, or exchange the points for a Feat.",
    "LONGDESC": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
  },
  {
    "FEATURE": "Ability Score Improvement III",
    "ARCHETYPE": "Base",
    "CLASS": "All",
    "LEVEL": "12",
    "SHORTDESC": "Increase your ability scores by a total of 2 points at 4th, 8th, 12th, 16th, and 19th levels, or exchange the points for a Feat.",
    "LONGDESC": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
  },
  {
    "FEATURE": "Ability Score Improvement IV",
    "ARCHETYPE": "Base",
    "CLASS": "All",
    "LEVEL": "16",
    "SHORTDESC": "Increase your ability scores by a total of 2 points at 4th, 8th, 12th, 16th, and 19th levels, or exchange the points for a Feat.",
    "LONGDESC": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
  },
  {
    "FEATURE": "Ability Score Improvement V",
    "ARCHETYPE": "Base",
    "CLASS": "All",
    "LEVEL": "19",
    "SHORTDESC": "Increase your ability scores by a total of 2 points at 4th, 8th, 12th, 16th, and 19th levels, or exchange the points for a Feat.",
    "LONGDESC": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
  },
  {
    "FEATURE": "Abjuration Savant",
    "ARCHETYPE": "School of Abjuration",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "The gold and time you must spend to copy an abjuration spell into your spellbook is halved.",
    "LONGDESC": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy an abjuration spell into your spellbook is halved.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Acolyte of Nature",
    "ARCHETYPE": "Nature Domain",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "You learn one druid cantrip of your choice and gain proficiency in one of the following skills of your choice: Animal Handling, Nature, or Survival.",
    "LONGDESC": "At 1st level, you learn one druid cantrip of your choice. You also gain proficiency in one of the following skills of your choice: Animal Handling, Nature, or Survival.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Action Surge",
    "ARCHETYPE": "Base",
    "CLASS": "Fighter",
    "LEVEL": "2",
    "SHORTDESC": "You can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action. You must finish a short or long rest to use it again.",
    "LONGDESC": "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action and a possible bonus action.\n     Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Additional Fighting Style",
    "ARCHETYPE": "Champion",
    "CLASS": "Fighter",
    "LEVEL": "10",
    "SHORTDESC": "You can choose a second option from the Fighting Style class feature.",
    "LONGDESC": "At 10th level, you can choose a second option from the Fighting Style class feature.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Additional Magical Secrets",
    "ARCHETYPE": "College of Lore",
    "CLASS": "Bard",
    "LEVEL": "6",
    "SHORTDESC": "You learn to spells of your choice from any class as long as they are of a level you can already cast. They do not count agains the number of bard spells you know.",
    "LONGDESC": "At 6th level, you learn two spells of your choice from any class. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you but don’t count against the number of bard spells you know.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Alter Memories",
    "ARCHETYPE": "School of Enchantment",
    "CLASS": "Wizard",
    "LEVEL": "14",
    "SHORTDESC": "When you cast an enchantment spell to charm one or more creatures, you can alter one creature’s understanding so that it remains unaware of being charmed.",
    "LONGDESC": "At 14th level, you gain the ability to make a creature unaware of your magical influence on it. When you cast an enchantment spell to charm one or more creatures, you can alter one creature’s understanding so that it remains unaware of being charmed.\n     Additionally, once before the spell expires, you can use your action to try to make the chosen creature forget some of the time it spent charmed. The creature must succeed on an Intelligence saving throw against your wizard spell save DC or lose a number of hours of its memories equal to 1 + your Charisma modifier\n(minimum 1). You can make the creature forget less time, and the amount of time can’t exceed the duration of your enchantment spell.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Arcane Cantrips",
    "ARCHETYPE": "Arcane Trickster",
    "CLASS": "Rogue",
    "LEVEL": "3",
    "SHORTDESC": "You learn three cantrips: mage hand and two other cantrips of your choice from the wizard spell list.",
    "LONGDESC": "You learn three cantrips: mage hand and two other cantrips of your choice from the wizard spell list. You learn another wizard cantrip of your choice at 10th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Arcane Charge",
    "ARCHETYPE": "Eldritch Knight",
    "CLASS": "Fighter",
    "LEVEL": "15",
    "SHORTDESC": "You gain the ability to teleport up to 30 feet to an unoccupied space you can see when you use your Action Surge. You can teleport before or after the additional action.",
    "LONGDESC": "At 15th level, you gain the ability to teleport up to 30 feet to an unoccupied space you can see when you use your Action Surge. You can teleport before or after the additional action.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Arcane Recovery",
    "ARCHETYPE": "Base",
    "CLASS": "Wizard",
    "LEVEL": "1",
    "SHORTDESC": "Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level.",
    "LONGDESC": "You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher.\n     For example, if you’re a 4th-level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Arcane Spellcaster",
    "ARCHETYPE": "Base",
    "CLASS": "Wizard",
    "LEVEL": "1",
    "SHORTDESC": "As a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power. At 1st level, you know three cantrips of your choice from the wizard spell list.",
    "LONGDESC": "As a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power. At 1st level, you know three cantrips of your choice from the wizard spell list. You learn additional wizard cantrips of your choice at higher levels.\n     Intelligence is your spellcasting ability for your wizard spells, since you learn your spells through dedicated study and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability.\n     In addition, you use your Intelligence modifier when setting the saving throw DC for a wizard spell you cast and when making an attack roll with one. Spell save DC \u003d 8 + your proficiency bonus + your Intelligence modifier.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Arcane Tradition",
    "ARCHETYPE": "Base",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "You choose an arcane tradition as one of eight schools: Abjuration, Conjuration, Divination, Enchantment, Evocation, Illusion, Necromancy, or Transmutation.",
    "LONGDESC": "When you reach 2nd level, you choose an arcane\ntradition, shaping your practice of magic through one of eight schools: Abjuration, Conjuration, Divination, Enchantment, Evocation, Illusion, Necromancy, or Transmutation, all detailed at the end of the class description.\n     Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Arcane Trickster Spells",
    "ARCHETYPE": "Arcane Trickster",
    "CLASS": "Rogue",
    "LEVEL": "3",
    "SHORTDESC": "You gain the ability to cast spells. You know three 1st-level wizard spells of your choice, two of which you must choose from the enchantment and illusion spells on the wizard spell list.",
    "LONGDESC": "When you reach 3rd level, you gain the ability to\ncast spells. You know three 1st-level wizard spells of your choice, two of which you must choose from the enchantment and illusion spells on the wizard spell list.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Arcane Ward",
    "ARCHETYPE": "School of Abjuration",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "You can weave magic around yourself for protection, simultaneously using a strand of a spell\u0027s magic to create a magical ward around you, absorbing damage from enemy attacks.",
    "LONGDESC": "Starting at 2nd level, you can weave magic around\nyourself for protection. When you cast an abjuration spell of 1st level or higher, you can simultaneously use a strand of the spell’s magic to create a magical ward on yourself that lasts until you finish a long rest. The ward has hit points equal to twice your w izard level + your\nIntelligence modifier. Whenever you take damage, the ward takes the damage instead. If this damage reduces the ward to 0 hit points, you take any remaining damage.\n     While the ward has 0 hit points, it can’t absorb\ndamage, but its magic remains. Whenever you cast an abjuration spell of 1st level or higher, the ward regains a number of hit points equal to twice the level o f the spell.\n     Once you create the ward, you can\u0027t create it again until you finish a long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Archdruid",
    "ARCHETYPE": "Base",
    "CLASS": "Druid",
    "LEVEL": "20",
    "SHORTDESC": "At 20th level, you can use your Wild Shape an unlimited number of times.",
    "LONGDESC": "At 20th level, you can use your Wild Shape an unlimited number of times.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Aspect of the Beast",
    "ARCHETYPE": "Path of the Totem Warrior",
    "CLASS": "Barbarian",
    "LEVEL": "6",
    "SHORTDESC": "You gain a magical benefit of a totem animal of choice, which can be the same as your 3rd level animal or a different one.",
    "LONGDESC": "Aspect of the Beast\nAt 6th level, you gain a magical benefit based on the totem animal of your choice. You can choose the same animal you selected at 3rd level or a different one.\n     Bear. You gain the might of a bear. Your carrying capacity (including maximum load and maximum lift) is doubled, and you have advantage on Strength checks made to push, pull, lift, or break objects.\n     Eagle. You gain the eyesight of an eagle. You can see up to 1 mile away with no difficulty, able to discern even fine details as though looking at something no more than 100 feet away from you. Additionally, dim light doesn\u0027t impose disadvantage on your Wisdom (Perception) checks.\n     Wolf. You gain the hunting sensibilities of a wolf. You can track other creatures while traveling at a fast pace, and you can move stealthily while traveling at a normal pace (see chapter 8 for rules on travel pace).",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Assassinate",
    "ARCHETYPE": "Assassin",
    "CLASS": "Rogue",
    "LEVEL": "3",
    "SHORTDESC": "You have advantage on attack rolls against any creature that hasn’t taken a turn in the combat yet. In addition, any hit you score against a creature that is surprised is a critical hit.",
    "LONGDESC": "Starting at 3rd level, you are at your deadliest when you get the drop on your enemies. You have advantage on attack rolls against any creature that hasn’t taken a turn in the combat yet. In addition, any hit you score against a creature that is surprised is a critical hit.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Aura of Courage",
    "ARCHETYPE": "Base",
    "CLASS": "Paladin",
    "LEVEL": "10",
    "SHORTDESC": "You and your allies within 10 feet of you can’t be frightened while you are conscious.",
    "LONGDESC": "Starting at 10th level, you and friendly creatures\nwithin 10 feet of you can’t be frightened while you are conscious.\n     At 18th level, the range of this aura increases to 30 feet.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Aura of Devotion I",
    "ARCHETYPE": "Oath of Devotion",
    "CLASS": "Paladin",
    "LEVEL": "7",
    "SHORTDESC": "You and friendly creatures within 10 feet of you cannot be charmed while you are conscious.",
    "LONGDESC": "Starting at 7th level, you and friendly creatures within 10 feet of you can’t be charmed while you are conscious.\n     At 18th level, the range of this aura increases to 30 feet.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Aura of Devotion II",
    "ARCHETYPE": "Oath of Devotion",
    "CLASS": "Paladin",
    "LEVEL": "18",
    "SHORTDESC": "You and friendly creatures within 30 feet of you cannot be charmed while you are conscious.",
    "LONGDESC": "Starting at 7th level, you and friendly creatures within 10 feet of you can’t be charmed while you are conscious.\n     At 18th level, the range of this aura increases to 30 feet.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Aura of Protection",
    "ARCHETYPE": "Base",
    "CLASS": "Paladin",
    "LEVEL": "6",
    "SHORTDESC": "Whenever you or an ally within 10 feet of you makes a saving throw, they gain a bonus equal to your Charisma modifier (minimum bonus +1). You must be conscious to grant this bonus.",
    "LONGDESC": "Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus o f +1). You must be conscious to grant this bonus.\n     At 18th level, the range of this aura increases to 30 feet.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Avatar of Battle",
    "ARCHETYPE": "War Domain",
    "CLASS": "Cleric",
    "LEVEL": "17",
    "SHORTDESC": "You gain resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons.",
    "LONGDESC": "At 17th level, you gain resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Avenging Angel",
    "ARCHETYPE": "Oath of Vengeance",
    "CLASS": "Paladin",
    "LEVEL": "20",
    "SHORTDESC": "Using your action, you can assume the form of an angelic avenger for 1 hour with wings (speed 60\u0027) and an aura of menace (30\u0027 radius).",
    "LONGDESC": "At 20th level, you can assume the form of an angelic avenger. Using your action, you undergo a transformation. For 1 hour, you gain the following\nbenefits:\n• Wings sprout from your back and grant you a flying speed of 60 feet.\n• You emanate an aura of menace in a 30-foot radius. The first time any enemy creature enters the aura or starts its turn there during a battle, the creature must succeed on a Wisdom saving throw or become frightened of you for 1 minute or until it takes any damage. Attack rolls against the frightened creature have advantage.\n     Once you use this feature, you can’t use it again until you finish a long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Awakened Mind",
    "ARCHETYPE": "The Great Old One",
    "CLASS": "Warlock",
    "LEVEL": "1",
    "SHORTDESC": "Your alien knowledge gives you the ability to communicate telepathically with any creature within 30 feet of you that you can see, without sharing a language.",
    "LONGDESC": "Starting at 1st level, your alien knowledge gives you the ability to touch the minds of other creatures. You can communicate telepathically with any creature you can see within 30 feet of you. You don’t need to share a language with the creature for it to understand your telepathic utterances, but the creature must be able to understand at least one language.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bard College",
    "ARCHETYPE": "Base",
    "CLASS": "Bard",
    "LEVEL": "3",
    "SHORTDESC": "At 3rd level select the bard college of your choice such as the College of Lore or the College of Valor.",
    "LONGDESC": "At 3rd level, you delve into the advanced techniques of a bard college of your choice: the College of Lore or the College of Valor, both detailed at the end o f the class description. Your choice grants you features at 3rd level and again at 6th and 14th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bardic Cantrips",
    "ARCHETYPE": "Base",
    "CLASS": "Bard",
    "LEVEL": "1",
    "SHORTDESC": "You know two cantrips from the bard spell list, learning more at higher levels. They can be cast at will, without using a spell slot and without being prepared in advance.",
    "LONGDESC": "You know two cantrips of your choice from the bard spell list. You learn additional bard cantrips of your choice at higher levels. They can be cast at will, without using a spell slot and without being prepared in advance.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bardic Inspiration",
    "ARCHETYPE": "Base",
    "CLASS": "Bard",
    "LEVEL": "1",
    "SHORTDESC": "Using a bonus action, you can inspire others through rousing speech or music. The selected ally gains a d6 to add to an ability check, attack roll, or save once in the next 10 minutes.",
    "LONGDESC": "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6.\n     Once within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time.\n     You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest.\n     Your Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bardic Spellcasting",
    "ARCHETYPE": "Base",
    "CLASS": "Bard",
    "LEVEL": "1",
    "SHORTDESC": "You can cast spells that reshape the fabric of reality in harmony with your wishes and music. Your spells are part of your vast repertoire, magic that you can tune to different situations.",
    "LONGDESC": "You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music. Your spells are part of your vast repertoire, magic that you can tune to different situations. Pouring your heart and soul into your music or oration, Charisma is your spellcasting ability for your bard spells.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Battle Magic",
    "ARCHETYPE": "College of Valor",
    "CLASS": "Bard",
    "LEVEL": "14",
    "SHORTDESC": "You have mastered the art of spellcasting and weapon use, enabling you to make one weapon attack as a bonus action when you cast a spell as your standard action.",
    "LONGDESC": "At 14th level, you have mastered the art of weaving spellcasting and weapon use into a single harmonious act. When you use your action to cast a bard spell, you can make one weapon attack as a bonus action.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Beast Spells",
    "ARCHETYPE": "Base",
    "CLASS": "Druid",
    "LEVEL": "18",
    "SHORTDESC": "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape.",
    "LONGDESC": "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren’t able to provide material components.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Beguiling Defense",
    "ARCHETYPE": "The Archfey",
    "CLASS": "Warlock",
    "LEVEL": "10",
    "SHORTDESC": "You are immune to being charmed, and when another creature attempts to charm you, you can use your reaction to attempt to turn the charm back on that creature.",
    "LONGDESC": "Beginning at 10th level, your patron teaches you how to turn the mind-affecting magic of your enemies against them. You are immune to being charmed, and when another creature attempts to charm you, you can use your reaction to attempt to turn the charm back on that creature. The creature must succeed on a Wisdom saving throw against your warlock spell save DC or be charmed by you for 1 minute or until the creature takes any damage.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bend Luck",
    "ARCHETYPE": "Wild Magic",
    "CLASS": "Sorcerer",
    "LEVEL": "6",
    "SHORTDESC": "You have the ability to twist fate using your wild magic, allowing you to modify (bonus or penalty) another creature\u0027s attack, ability check, or save by spending 2 sorcery points and a roll of 1d4.",
    "LONGDESC": "Starting at 6th level, you have the ability to twist fate using your wild magic. When another creature you can see makes an attack roll, an ability check, or a saving throw, you can use your reaction and spend 2 sorcery points to roll 1d4 and apply the number rolled as a bonus or penalty (your choice) to the creature’s roll. You can do so after the creature rolls but before any effects of the roll occur.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Benign Transposition",
    "ARCHETYPE": "School of Conjuration",
    "CLASS": "Wizard",
    "LEVEL": "6",
    "SHORTDESC": "You can use your action to teleport up to 30 feet to an unoccupied space that you can see, or interchange (teleporting) places with an ally within 30 feet.",
    "LONGDESC": "Starting at 6th level, you can use your action to teleport up to 30 feet to an unoccupied space that you can see. Alternatively, you can choose a space within range that is occupied by a Small or Medium creature. If that creature is willing, you both teleport, swapping places.\n     Once you use this feature, you can’t use it again until you finish a long rest or you cast a conjuration spell of 1st level or higher.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bestial Fury",
    "ARCHETYPE": "Beast Master",
    "CLASS": "Ranger",
    "LEVEL": "11",
    "SHORTDESC": "Your beast companion can make two attacks when you command it to use the Attack action.",
    "LONGDESC": "Starting at 11th level, your beast companion can\nmake two attacks when you command it to use the Attack action.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Blessed Healer",
    "ARCHETYPE": "Life Domain",
    "CLASS": "Cleric",
    "LEVEL": "6",
    "SHORTDESC": "The healing spells you cast on others heal you as well, allowing you to regain hit points equal to 2 + the spell’s level (min 1st level)",
    "LONGDESC": "Beginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell’s level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Blessing of the Trickster",
    "ARCHETYPE": "Trickery Domain",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "You can use your action to touch a willing creature other than yourself to give it advantage on Dexterity (Stealth) checks for 1 hour.",
    "LONGDESC": "Starting when you choose this domain at 1st level, you can use your action to touch a willing creature other than yourself to give it advantage on Dexterity (Stealth) checks. This blessing lasts for 1 hour or until you use this feature again.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Blessings of Knowledge",
    "ARCHETYPE": "Knowledge Domain",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "You know 2 additional languages and you are doubly proficient in two skills of your choice: Arcana, History, Nature, or Religion.",
    "LONGDESC": "At 1st level, you learn two languages of your choice. You also become proficient in your choice of two of the following skills: Arcana, History, Nature, or Religion.\n     Your proficiency bonus is doubled for any ability check you make that uses either of those skills.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Blindsense",
    "ARCHETYPE": "Base",
    "CLASS": "Rogue",
    "LEVEL": "14",
    "SHORTDESC": "If you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you.",
    "LONGDESC": "Starting at 14th level, if you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bonus Armor Proficiency: Life",
    "ARCHETYPE": "Life Domain",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "You gain proficiency with heavy armor.",
    "LONGDESC": "When you choose this domain at 1st level, you gain proficiency with heavy armor.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bonus Armor Proficiency: Nature",
    "ARCHETYPE": "Nature Domain",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "You gain proficiency with heavy armor.",
    "LONGDESC": "Also at 1st level, you gain proficiency with heavy armor.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bonus Assassin Proficiencies",
    "ARCHETYPE": "Assassin",
    "CLASS": "Rogue",
    "LEVEL": "3",
    "SHORTDESC": "You gain proficiency with the disguise kit and the poisoner’s kit.",
    "LONGDESC": "When you choose this archetype at 3rd level, you gain proficiency with the disguise kit and the poisoner’s kit.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bonus Charm Proficiency",
    "ARCHETYPE": "Nature Domain",
    "CLASS": "Cleric",
    "LEVEL": "2",
    "SHORTDESC": "You can use your Channel Divinity to charm animals and plants within 30 feet.",
    "LONGDESC": "Starting at 2nd level, you can use your Channel Divinity to charm animals and plants.\n     As an action, you present your holy symbol and invoke the name of your deity. Each beast or plant creature that can see you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is charmed by you for 1 minute or until it takes damage. While it is charmed by you, it is friendly to you and other\ncreatures you designate.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bonus Cleric Cantrip",
    "ARCHETYPE": "Light Domain",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "You gain the light cantrip if you don’t already know it.",
    "LONGDESC": "When you choose this domain at 1st level, you gain the light cantrip if you don’t already know it.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bonus Cleric Proficiencies",
    "ARCHETYPE": "Tempest Domain",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "You gain proficiency with martial weapons and heavy armor.",
    "LONGDESC": "At 1st level, you gain proficiency with martial weapons and heavy armor.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bonus Druid Cantrip",
    "ARCHETYPE": "Circle of the Land",
    "CLASS": "Druid",
    "LEVEL": "2",
    "SHORTDESC": "You learn one additional druid cantrip of your choice.",
    "LONGDESC": "When you choose this circle at 2nd level, you learn one additional druid cantrip of your choice.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bonus Lore Proficiencies",
    "ARCHETYPE": "College of Lore",
    "CLASS": "Bard",
    "LEVEL": "3",
    "SHORTDESC": "You gain proficiency in three skills of your choice.",
    "LONGDESC": "When you join the College of Lore at 3rd level, you gain proficiency with three skills of your choice.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bonus Valor Proficiencies",
    "ARCHETYPE": "College of Valor",
    "CLASS": "Bard",
    "LEVEL": "3",
    "SHORTDESC": "You gain proficiency with medium armor, shields, and martial weapons.",
    "LONGDESC": "When you join the College of Valor at 3rd level, you gain proficiency with medium armor, shields, and martial weapons.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Bonus War Proficiencies",
    "ARCHETYPE": "War Domain",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "You gain proficiency with martial weapons and heavy armor.",
    "LONGDESC": "At 1st level, you gain proficiency with martial weapons and heavy armor.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Brutal Critical",
    "ARCHETYPE": "Base",
    "CLASS": "Barbarian",
    "LEVEL": "9",
    "SHORTDESC": "At 9th level you can roll one additional weapon damage die when rolling extra damage for a melee critical hit, increasing to two dice at 13th level and three dice at 17th level.",
    "LONGDESC": "Beginning at 9th level, you can roll one additional\nweapon damage die when determining the extra\ndamage for a critical hit with a melee attack.\nThis increases to two additional dice at 13th level\nand three additional dice at 17th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Channel Devotion: Devotion",
    "ARCHETYPE": "Oath of Devotion",
    "CLASS": "Paladin",
    "LEVEL": "3",
    "SHORTDESC": "You gain two Channel Divinity options: Sacred Weapon and Turn the Unholy.",
    "LONGDESC": "When you take this oath at 3rd level, you gain the\nfollowing two Channel Divinity options.\n     Sacred Weapon. As an action, you can imbue one weapon that you are holding with positive energy, using your Channel Divinity. For 1 minute, you add your Charisma modifier to attack rolls made with that weapon (with a minimum bonus o f +1). The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that. If the weapon is not already magical, it becomes magical for the duration.\n     You can end this effect on your turn as part o f any other action. If you are no longer holding or carrying this weapon, or if you fall unconscious, this effect ends.\n     Turn the Unholy. As an action, you present your\nholy symbol and speak a prayer censuring fiends and undead, using your Channel Divinity. Each fiend or undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes damage.\n     A turned creature must spend its turns trying to move as far away from you as it can, and it can’t willingly move to a space within 30 feet of you. It also can’t take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there’s nowhere to move, the creature can use the Dodge action.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Channel Divinity",
    "ARCHETYPE": "Base",
    "CLASS": "Cleric",
    "LEVEL": "2",
    "SHORTDESC": "You gain the ability to channel divine energy directly from your diety, using that energy to fuel magical effects - beginning with Turn Undead and a domain ability.",
    "LONGDESC": "At 2nd level, you gain the ability to channel divine\nenergy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.\n     When you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.\n     Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.\n     Beginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level. You can use it three times between rests. When you finish a short or long rest, you regain your expended uses.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Channel Divinity: Cloak of Shadows",
    "ARCHETYPE": "Trickery Domain",
    "CLASS": "Cleric",
    "LEVEL": "6",
    "SHORTDESC": "As an action, you can use your Channel Divinity to become invisible until the end of your next turn. You become visible if you attack or cast a spell.",
    "LONGDESC": "Starting at 6th level, you can use your Channel\nDivinity to vanish.\n     As an action, you become invisible until the end of your next turn. You become visible if you attack or cast a spell.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Channel Divinity: Destructive Wrath",
    "ARCHETYPE": "Tempest Domain",
    "CLASS": "Cleric",
    "LEVEL": "2",
    "SHORTDESC": "You can use your Channel Divinity to wield the power of the storm with unchecked ferocity, dealing maximum damage with your lightning or thunder damage instead of rolling.",
    "LONGDESC": "Starting at 2nd level, you can use your Channel Divinity to wield the power of the storm with unchecked ferocity. When you roll lightning or thunder damage, you can use your Channel Divinity to deal maximum damage, instead of rolling.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Channel Divinity: Guided Strike",
    "ARCHETYPE": "War Domain",
    "CLASS": "Cleric",
    "LEVEL": "2",
    "SHORTDESC": "You can use your Channel Divinity to strike with supernatural accuracy, gaining +10 bonus to your attack roll (before or after the roll).",
    "LONGDESC": "Starting at 2nd level, you can use your Channel Divinity to strike with supernatural accuracy. When you make an attack roll, you can use your Channel Divinity to gain a +10 bonus to the roll. You make this choice after you see the roll, but before the DM says whether the attack hits or misses.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Channel Divinity: Invoke Duplicity",
    "ARCHETYPE": "Trickery Domain",
    "CLASS": "Cleric",
    "LEVEL": "2",
    "SHORTDESC": "You can use your Channel Divinity to create an illusory duplicate of yourself that can move up to 120 feet from you and lasts for 1 minute.",
    "LONGDESC": "Starting at 2nd level, you can use your Channel Divinity to create an illusory duplicate of yourself.\n     As an action, you create a perfect illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell). The illusion appears in an unoccupied space that you can see within 30 feet of you. As a bonus action on your turn, you can move the illusion up to 30 feet to a space you can see, but it must remain within 120 feet of you.\n     For the duration, you can cast spells as though you were in the illusion’s space, but you must use your own senses. Additionally, when both you and your illusion are within 5 feet o f a creature that can see the illusion, you have advantage on attack rolls against that creature, given how distracting the illusion is to the target.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Channel Divinity: Knowledge of the Ages",
    "ARCHETYPE": "Knowledge Domain",
    "CLASS": "Cleric",
    "LEVEL": "2",
    "SHORTDESC": "You can use your Channel Divinity to tap into a divine well of knowledge, allowing you to use any one skill or tool for 10 minutes as if you are proficient.",
    "LONGDESC": "Starting at 2nd level, you can use your Channel Divinity to tap into a divine well of knowledge. As an action, you choose one skill or tool. For 10 minutes, you have proficiency with the chosen skill or tool.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Channel Divinity: Preserve Life",
    "ARCHETYPE": "Life Domain",
    "CLASS": "Cleric",
    "LEVEL": "2",
    "SHORTDESC": "You can use your Channel Divinity to heal badly injured allies (within 30\u0027), evoking healing energy to restore hit points equal to you cleric level times 5 (max half the creature\u0027s hit points).",
    "LONGDESC": "Starting at 2nd level, you can use your Channel Divinity to heal the badly injured.\n     As an action, you present your holy symbol and\nevoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can’t use this feature on an undead or a construct.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Channel Divinity: Radiance of the Dawn",
    "ARCHETYPE": "Light Domain",
    "CLASS": "Cleric",
    "LEVEL": "2",
    "SHORTDESC": "You can use your Channel Divinity to harness sunlight, banishing darkness (30 ft radius) and dealing radiant damage (2d10 + cleric level) to your foes.",
    "LONGDESC": "Starting at 2nd level, you can use your Channel Divinity to harness sunlight, banishing darkness and dealing radiant damage to your foes.\n     As an action, you present your holy symbol, and any magical darkness within 30 feet of you is dispelled. Additionally, each hostile creature within 30 feet of you must make a Constitution saving throw. A creature takes radiant damage equal to 2d10 + your cleric level on a failed saving throw, and half as much damage on a successful one. A creature that has total cover from you\nis not affected.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Channel Divinity: Read Thoughts",
    "ARCHETYPE": "Knowledge Domain",
    "CLASS": "Cleric",
    "LEVEL": "6",
    "SHORTDESC": "You can use your Channel Divinity to read a creature’s thoughts within 60 feet, and then use your access to the its mind to command it.",
    "LONGDESC": "At 6th level, you can use your Channel Divinity to read a creature’s thoughts. You can then use your access to the creature’s mind to command it.\n     As an action, choose one creature that you can see within 60 feet of you. That creature must make a Wisdom saving throw. If the creature succeeds on the saving throw, you can’t use this feature on it again until you finish a long rest.\n     If the creature fails its save, you can read its surface thoughts (those foremost in its mind, reflecting its current emotions and what it is actively thinking about) when it is within 60 feet of you. This effect lasts for 1 minute.\n     During that time, you can use your action to end this effect and cast the suggestion spell on the creature without expending a spell slot. The target automatically fails its saving throw against the spell.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Channel Divinity: Vengeance",
    "ARCHETYPE": "Oath of Vengeance",
    "CLASS": "Paladin",
    "LEVEL": "3",
    "SHORTDESC": "You gain two Channel Divinity options: Abjure Enemy and Vow of Enmity.",
    "LONGDESC": "When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n     Abjure Enemy. As an action, you present your holy symbol and speak a prayer o f denunciation, using your Channel Divinity. Choose one creature within 60 feet of you that you can see. That creature must make a Wisdom saving throw, unless it is immune to being frightened. Fiends and undead have disadvantage on this saving throw.\n     On a failed save, the creature is frightened for 1\nminute or until it takes any damage. While frightened, the creature’s speed is 0, and it can’t benefit from any bonus to its speed.\n     On a successful save, the creature’s speed is halved for 1 minute or until the creature takes any damage.\n     Vow of Enmity. As a bonus action, you can utter a vow of enmity against a creature you can see within 10 feet of you, using your Channel Divinity. You gain advantage on attack rolls against the creature for 1 minute or until it drops to 0 hit points or falls unconscious.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Channel Divinity: War God\u0027s Blessing",
    "ARCHETYPE": "War Domain",
    "CLASS": "Cleric",
    "LEVEL": "6",
    "SHORTDESC": "When an ally within 30 feet of you makes an attack roll, grant it a +10 bonus to its attack roll  (before or after the roll).",
    "LONGDESC": "At 6th level, when a creature within 30 feet of you makes an attack roll, you can use your reaction to grant that creature a +10 bonus to the roll, using your Channel Divinity. You make this choice after you see the roll, but before the DM says whether the attack hits or misses.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Circle Forms I",
    "ARCHETYPE": "Circle of the Moon",
    "CLASS": "Druid",
    "LEVEL": "2",
    "SHORTDESC": "The rites of your circle grant you the ability to transform into more dangerous animal forms, allowing you to transform into a beast with a CR as high as 1.",
    "LONGDESC": "The rites of your circle grant you the ability to transform into more dangerous animal forms. Starting at 2nd level, you can use your Wild Shape to transform into a beast with a challenge rating as high as 1 (you ignore the Max. CR column of the Beast Shapes table, but must abide by the other limitations there).\n      Starting at 6th level, you can transform into a beast with a challenge rating as high as your druid level divided by 3, rounded down.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Circle Forms II",
    "ARCHETYPE": "Circle of the Moon",
    "CLASS": "Druid",
    "LEVEL": "6",
    "SHORTDESC": "The rites of your circle grant you the ability to transform into more dangerous animal forms, allowing you to transform into a beast with a CR equal to your druid level divided by 3.",
    "LONGDESC": "The rites of your circle grant you the ability to transform into more dangerous animal forms. Starting at 2nd level, you can use your Wild Shape to transform into a beast with a challenge rating as high as 1 (you ignore the Max. CR column of the Beast Shapes table, but must abide by the other limitations there).\n      Starting at 6th level, you can transform into a beast with a challenge rating as high as your druid level divided by 3, rounded down.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Circle Spells",
    "ARCHETYPE": "Circle of the Land",
    "CLASS": "Druid",
    "LEVEL": "3",
    "SHORTDESC": "Your mystical connection to the land infuses you with the ability to cast circle spells from the biome of your druidic origin.",
    "LONGDESC": "Your mystical connection to the land infuses you with the ability to cast certain spells. At 3rd, 5th, 7th, and 9th level you gain access to circle spells connected to the land where you became a druid. Choose that land—arctic, coast, desert, forest, grassland, mountain, swamp, or Underdark—and consult the associated list of spells.\n     Once you gain access to a circle spell, you always have it prepared, and it doesn’t count against the number of spells you can prepare each day. If you gain access to a spell that doesn’t appear on the druid spell list, the spell is nonetheless a druid spell for you.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Cleansing Touch",
    "ARCHETYPE": "Base",
    "CLASS": "Paladin",
    "LEVEL": "14",
    "SHORTDESC": "You can use your action to end one spell on yourself or on one willing creature that you touch. You can use this feature a number of times equal to your Charisma modifier (a minimum of once).",
    "LONGDESC": "Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch.\n     You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Cloak of Shadows",
    "ARCHETYPE": "Way of Shadow",
    "CLASS": "Monk",
    "LEVEL": "11",
    "SHORTDESC": "You have learned to become one with the shadows. When you are in an area of dim light or darkness, you can use your action to become invisible.",
    "LONGDESC": "By 11th level, you have learned to become one with the shadows. When you are in an area of dim light or darkness, you can use your action to become invisible. You remain invisible until you make an attack, cast a spell, or are in an area of bright light.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Combat Inspiration",
    "ARCHETYPE": "College of Valor",
    "CLASS": "Bard",
    "LEVEL": "3",
    "SHORTDESC": "You inspire others in battle allowing your Bardic Inspiration dice to be added to weapon damage when awarded to an ally.",
    "LONGDESC": "Also at 3rd level, you learn to inspire others in battle. A creature that has a Bardic Inspiration die from you can roll that die and add the number rolled to a weapon damage roll it just made. Alternatively, when an attack roll is made against the creature, it can use its reaction to roll the Bardic Inspiration die and add the number rolled to its AC against that attack, after seeing the roll but before knowing whether it hits or misses.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Combat Superiority I",
    "ARCHETYPE": "Battle Master",
    "CLASS": "Fighter",
    "LEVEL": "3",
    "SHORTDESC": "You know three maneuvers that are fueled by special dice called superiority dice, enhancing your attacks during battle.",
    "LONGDESC": "When you choose this archetype at 3rd level, you\nlearn maneuvers that are fueled by special dice called superiority dice.\n     Maneuvers. You learn three maneuvers of your\nchoice, which are detailed under “Maneuvers” below. Many maneuvers enhance an attack in some way. You can use only one maneuver per attack.\n     You learn two additional maneuvers of your choice at 7th, 10th, and 15th level. Each time you learn new maneuvers, you can also replace one maneuver you know with a different one.\n     Superiority Dice. You have four superiority dice,\nwhich are d8s. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a short or long rest.\n     You gain another superiority die at 7th level and one more at 15th level.\n     Saving Throws. Some of your maneuvers require your target to make a saving throw to resist the maneuver’s effects. The saving throw DC is calculated as follows:\n     Maneuver save DC \u003d 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice)",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Combat Superiority II",
    "ARCHETYPE": "Battle Master",
    "CLASS": "Fighter",
    "LEVEL": "7",
    "SHORTDESC": "You know five maneuvers that are fueled by special dice called superiority dice, enhancing your attacks during battle.",
    "LONGDESC": "When you choose this archetype at 3rd level, you\nlearn maneuvers that are fueled by special dice called superiority dice.\n     Maneuvers. You learn three maneuvers of your\nchoice, which are detailed under “Maneuvers” below. Many maneuvers enhance an attack in some way. You can use only one maneuver per attack.\n     You learn two additional maneuvers of your choice at 7th, 10th, and 15th level. Each time you learn new maneuvers, you can also replace one maneuver you know with a different one.\n     Superiority Dice. You have four superiority dice,\nwhich are d8s. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a short or long rest.\n     You gain another superiority die at 7th level and one more at 15th level.\n     Saving Throws. Some of your maneuvers require your target to make a saving throw to resist the maneuver’s effects. The saving throw DC is calculated as follows:\n     Maneuver save DC \u003d 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice)",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Combat Superiority III",
    "ARCHETYPE": "Battle Master",
    "CLASS": "Fighter",
    "LEVEL": "10",
    "SHORTDESC": "You know seven maneuvers that are fueled by special dice called superiority dice, enhancing your attacks during battle.",
    "LONGDESC": "When you choose this archetype at 3rd level, you\nlearn maneuvers that are fueled by special dice called superiority dice.\n     Maneuvers. You learn three maneuvers of your\nchoice, which are detailed under “Maneuvers” below. Many maneuvers enhance an attack in some way. You can use only one maneuver per attack.\n     You learn two additional maneuvers of your choice at 7th, 10th, and 15th level. Each time you learn new maneuvers, you can also replace one maneuver you know with a different one.\n     Superiority Dice. You have four superiority dice,\nwhich are d8s. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a short or long rest.\n     You gain another superiority die at 7th level and one more at 15th level.\n     Saving Throws. Some of your maneuvers require your target to make a saving throw to resist the maneuver’s effects. The saving throw DC is calculated as follows:\n     Maneuver save DC \u003d 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice)",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Combat Superiority IV",
    "ARCHETYPE": "Battle Master",
    "CLASS": "Fighter",
    "LEVEL": "15",
    "SHORTDESC": "You know nine maneuvers that are fueled by special dice called superiority dice, enhancing your attacks during battle.",
    "LONGDESC": "When you choose this archetype at 3rd level, you\nlearn maneuvers that are fueled by special dice called superiority dice.\n     Maneuvers. You learn three maneuvers of your\nchoice, which are detailed under “Maneuvers” below. Many maneuvers enhance an attack in some way. You can use only one maneuver per attack.\n     You learn two additional maneuvers of your choice at 7th, 10th, and 15th level. Each time you learn new maneuvers, you can also replace one maneuver you know with a different one.\n     Superiority Dice. You have four superiority dice,\nwhich are d8s. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a short or long rest.\n     You gain another superiority die at 7th level and one more at 15th level.\n     Saving Throws. Some of your maneuvers require your target to make a saving throw to resist the maneuver’s effects. The saving throw DC is calculated as follows:\n     Maneuver save DC \u003d 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice)",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Combat Wild Shape",
    "ARCHETYPE": "Circle of the Moon",
    "CLASS": "Druid",
    "LEVEL": "2",
    "SHORTDESC": "You gain the ability to use Wild Shape on your turn as a bonus action, rather than as an action. You also can expend one spell slot to heal 1d8 hit points per spell slot level.",
    "LONGDESC": "When you choose this circle at 2nd level, you gain the ability to use Wild Shape on your turn as a bonus action, rather than as an action.\n     Additionally, while you are transformed by Wild Shape, you can use a bonus action to expend one spell slot to regain 1d8 hit points per level of the spell slot expended.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Command Undead",
    "ARCHETYPE": "School of Necromancy",
    "CLASS": "Wizard",
    "LEVEL": "14",
    "SHORTDESC": "You can use magic to bring undead under your control, even those created by other wizards. As an action, you can choose one undead that you can see within 60 feet of you.",
    "LONGDESC": "Starting at 14th level, you can use magic to bring\nundead under your control, even those created by other wizards. As an action, you can choose one undead that you can see within 60 feet of you. That creature must make a Charisma saving throw against your wizard spell save DC. If it succeeds, you can’t use this feature on it again. If it fails, it becomes friendly to you and obeys your commands until you use this feature again. Intelligent undead are harder to control in this way.\n     If the target has an Intelligence of 8 or higher, it has advantage on the saving throw. If it fails the saving throw and has an Intelligence of 12 or higher, it can repeat the saving throw at the end of every hour until it succeeds and breaks free.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Conjuration Savant",
    "ARCHETYPE": "School of Conjuration",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "The gold and time you must spend to copy a conjuration spell into your spellbook is halved.",
    "LONGDESC": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy a conjuration spell into your spellbook is halved.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Controlled Chaos",
    "ARCHETYPE": "Wild Magic",
    "CLASS": "Sorcerer",
    "LEVEL": "14",
    "SHORTDESC": "You gain a modicum of control over the surges of your wild magic. Whenever you roll on the Wild Magic Surge table, you can roll twice and use either number.",
    "LONGDESC": "At 14th level, you gain a modicum of control over the surges of your wild magic. Whenever you roll on the Wild Magic Surge table, you can roll twice and use either number.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Corona of Light",
    "ARCHETYPE": "Light Domain",
    "CLASS": "Cleric",
    "LEVEL": "17",
    "SHORTDESC": "You can use your action to activate an aura of sunlight (60 ft radius) that lasts for 1 minute, causing Disadvantage on saves vs fire or radiant damage from spells.",
    "LONGDESC": "Starting at 17th level, you can use your action to activate an aura of sunlight that lasts for 1 minute or until you dismiss it using another action. You emit bright light in a 60-foot radius and dim light 30 feet beyond that. Your enemies in the bright light have disadvantage on saving throws against any spell that deals fire or radiant damage.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Countercharm",
    "ARCHETYPE": "Base",
    "CLASS": "Bard",
    "LEVEL": "6",
    "SHORTDESC": "At 6th level use your powerful charm of music or oration to disrupt mind-influencing spells, granting you and your allies Advantage against fear and charms.",
    "LONGDESC": "At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required).",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Create Thrall",
    "ARCHETYPE": "The Great Old One",
    "CLASS": "Warlock",
    "LEVEL": "14",
    "SHORTDESC": "You can use your action to touch an incapacitated humanoid which becomes charmed by you until a remove curse spell, the charmed condition is removed from it, or you use this feature again.",
    "LONGDESC": "At 14th level, you gain the ability to infect a humanoid’s mind with the alien magic of your patron. You can use your action to touch an incapacitated humanoid. That creature is then charmed by you until a remove curse spell is cast on it, the charmed condition is removed from it, or you use this feature again.\n     You can communicate telepathically with the charmed creature as long as the two of you are on the same plane of existence.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Cunning Action",
    "ARCHETYPE": "Base",
    "CLASS": "Rogue",
    "LEVEL": "2",
    "SHORTDESC": "Your quick thinking and agility allow you to move and act quickly, allowing a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action.",
    "LONGDESC": "Starting at 2nd level, your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Cutting Words",
    "ARCHETYPE": "College of Lore",
    "CLASS": "Bard",
    "LEVEL": "3",
    "SHORTDESC": "You learn to use your wit to distract, confuse, and otherwise sap the confidence and competence of your enemies (within 60 feet).",
    "LONGDESC": "Also at 3rd level, you learn how to use your wit to\ndistract, confuse, and otherwise sap the confidence and competence of others. When a creature that you can see within 60 feet of you makes an attack roll, an ability check, or a damage roll, you can use your reaction to expend one of your uses o f Bardic Inspiration, rolling a Bardic Inspiration die and subtracting the number rolled from the creature’s roll. You can choose to use\nthis feature after the creature makes its roll, but before the DM determines whether the attack roll or ability check succeeds or fails, or before the creature deals its damage. The creature is immune if it can’t hear you or if it’s immune to being charmed.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Dampen Elements",
    "ARCHETYPE": "Nature Domain",
    "CLASS": "Cleric",
    "LEVEL": "6",
    "SHORTDESC": "When you or an ally within 30 feet of you takes acid, cold, fire, lightning, or thunder damage, use your reaction to grant resistance to the creature against that instance of damage.",
    "LONGDESC": "Starting at 6th level, when you or a creature within 30 feet of you takes acid, cold, fire, lightning, or thunder damage, you can use your reaction to grant resistance to the creature against that instance of the damage.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Danger Sense",
    "ARCHETYPE": "Base",
    "CLASS": "Barbarian",
    "LEVEL": "2",
    "SHORTDESC": "You have an uncanny sense of danger granting advantage on Dex saves against visible effects like traps and spells.",
    "LONGDESC": "At 2nd level, you gain an uncanny sense of when things nearby aren’t as they should be, giving you an edge when you dodge away from danger.\n     You have advantage on Dexterity saving throws\nagainst effects that you can see, such as traps and spells. To gain this benefit, you can’t be blinded, deafened, or incapacitated.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Dark Delirium",
    "ARCHETYPE": "The Archfey",
    "CLASS": "Warlock",
    "LEVEL": "14",
    "SHORTDESC": "You can plunge a creature (within 60 ft)into an illusory realm, charming or frightening them for 1 minute or until your concentration is broken or the creature takes damage.",
    "LONGDESC": "Starting at 14th level, you can plunge a creature into an illusory realm. As an action, choose a creature that you can see within 60 feet of you. It must make a Wisdom saving throw against your warlock spell save DC. On a failed save, it is charmed or frightened by you (your choice) for 1 minute or until your concentration is broken (as if you are concentrating on a spell). This effect ends early if the creature takes any damage.\n     Until this illusion ends, the creature thinks it is lost in a misty realm, the appearance of which you choose. The creature can see and hear only itself, you, and the illusion.\n     You must finish a short or long rest before you can use this feature again.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Dark One\u0027s Blessing",
    "ARCHETYPE": "The Fiend",
    "CLASS": "Warlock",
    "LEVEL": "1",
    "SHORTDESC": "When you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum o f 1).",
    "LONGDESC": "Starting at 1st level, when you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum o f 1).",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Dark One\u0027s Own Luck",
    "ARCHETYPE": "The Fiend",
    "CLASS": "Warlock",
    "LEVEL": "6",
    "SHORTDESC": "When you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum o f 1).",
    "LONGDESC": "Starting at 1st level, when you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum o f 1).",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Death Strike",
    "ARCHETYPE": "Assassin",
    "CLASS": "Rogue",
    "LEVEL": "17",
    "SHORTDESC": "When you attack and hit a creature that is surprised, it must make a Con save (DC 8 + your Dex modifier + your proficiency bonus). On a failed save, double the damage of your attack.",
    "LONGDESC": "Starting at 17th level, you become a master of instant death. When you attack and hit a creature that is surprised, it must make a Constitution saving throw (DC 8 + your Dexterity modifier + your proficiency bonus). On a failed save, double the damage of your attack against the creature.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Defensive Tactics",
    "ARCHETYPE": "Hunter",
    "CLASS": "Ranger",
    "LEVEL": "7",
    "SHORTDESC": "You gain one of the following features of your choice: Escape the Horde, Multiattack Defense, or Steel Will.",
    "LONGDESC": "At 7th level, you gain one of the following features of your choice.\n     Escape the Horde. Opportunity attacks against you are made with disadvantage.\n     Multiattack Defense. When a creature hits you\nwith an attack, you gain a +4 bonus to AC against\nall subsequent attacks made by that creature for the rest of the turn.\n     Steel Will. You have advantage on saving throws against being frightened.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Deflect Missiles",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "3",
    "SHORTDESC": "You can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level.",
    "LONGDESC": "Starting at 3rd level, you can use your reaction to\ndeflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level.\n     If you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with the weapon or piece of ammunition you just caught, as part o f the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Destroy Undead",
    "ARCHETYPE": "Base",
    "CLASS": "Cleric",
    "LEVEL": "5",
    "SHORTDESC": "Starting at 5th level, when a lowly undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed.",
    "LONGDESC": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Destroy Undead table.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Diamond Soul",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "14",
    "SHORTDESC": "Your mastery of ki grants you proficiency in all saving throws. You can also spend 1 ki point to reroll any save and take the second result.",
    "LONGDESC": "Beginning at 14th level, your mastery of ki grants you proficiency in all saving throws.\n     Additionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Disciple of the Elements",
    "ARCHETYPE": "Way of the Four Elements",
    "CLASS": "Monk",
    "LEVEL": "3",
    "SHORTDESC": "You learn magical disciplines that harness the power of the four elements. A discipline requires you to spend ki points each time you use it.",
    "LONGDESC": "When you choose this tradition at 3rd level, you learn magical disciplines that harness the power of the four elements. A discipline requires you to spend ki points each time you use it.\n     You know the Elemental Attunement discipline and one other elemental discipline of your choice, which are detailed in the “Elemental Disciplines” section below. You learn one additional elemental discipline of your choice at 6th, 11th, and 17th level.\n     Whenever you learn a new elemental discipline, you can also replace one elemental discipline that you already know with a different discipline.\n     Casting Elemental Spells. Some elemental disciplines allow you to cast spells. See chapter 10 for the general rules o f spellcasting. To cast one of these spells, you use its casting time and other rules, but you don’t need to provide material components for it.\n     Once you reach 5th level in this class, you can spend additional ki points to increase the level of an elemental discipline spell that you cast, provided that the spell has an enhanced effect at a higher level, as burning hands does. The spell\u0027s level increases by 1 for each additional ki point you spend. For example, if you are a 5th-level monk and use Sweeping Cinder Strike to cast burning hands, you can spend 3 ki points to cast it as a 2nd-level spell (the discipline’s base cost o f 2 ki points plus 1).",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Discipline of Life",
    "ARCHETYPE": "Life Domain",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "Your healing spells are more effective granting a bonus of 2 + the spell’s level (1st level or higher) in healing hit points.",
    "LONGDESC": "Also starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell’s level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divination Savant",
    "ARCHETYPE": "School of Divination",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "The gold and time you must spend to copy a divination spell into your spellbook is halved.",
    "LONGDESC": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy a divination spell into your spellbook is halved.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Cantrips",
    "ARCHETYPE": "Base",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "You know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels. They can be cast at will, without using a spell slot and without being prepared in advance.",
    "LONGDESC": "At 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels. They can be cast at will, without using a spell slot and without being prepared in advance.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Domain",
    "ARCHETYPE": "Base",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "Select one domain related to your deity from which you are granted extra spells and special features, increasing at level 2, 6, 8, and 17.",
    "LONGDESC": "Choose one domain related to your deity: Knowledge, Life, Light, Nature, Tempest, Trickery, or War. Each domain is detailed at the end o f the class description, and each one provides examples of gods associated with it. Your choice grants you domain spells and other\nfeatures when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Health",
    "ARCHETYPE": "Base",
    "CLASS": "Paladin",
    "LEVEL": "3",
    "SHORTDESC": "Divine magic flows through you making you immune to disease.",
    "LONGDESC": "By 3rd level, the divine magic flowing through you makes you immune to disease.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Intervention",
    "ARCHETYPE": "Base",
    "CLASS": "Cleric",
    "LEVEL": "10",
    "SHORTDESC": "You can call on your deity to intervene on your behalf, imploring your deity’s aid as your action. You can do this once every seven days.",
    "LONGDESC": "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great.\n     Imploring your deity’s aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature o f the intervention; the effect of any cleric spell or cleric domain spell w ould be appropriate.\n     If your deity intervenes, you can’t use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.\n     At 20th level, your call for intervention succeeds automatically, no roll required.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Sense",
    "ARCHETYPE": "Base",
    "CLASS": "Paladin",
    "LEVEL": "1",
    "SHORTDESC": "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can detect such forces.",
    "LONGDESC": "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell.\n     You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Smite",
    "ARCHETYPE": "Base",
    "CLASS": "Paladin",
    "LEVEL": "2",
    "SHORTDESC": "You can expend one paladin spell slot to deal radiant damage to the target, in addition to the weapon’s damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8.",
    "LONGDESC": "Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one paladin spell slot to deal radiant damage to the target, in addition to the weapon’s damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Spellcaster",
    "ARCHETYPE": "Base",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "Divine magic is the power of the gods, flowing from them into the world. Clerics are conduits for that power, manifesting it as miraculous effects, relying on devotion and an intuitive sense of a deity’s wishes. Clerics combine the helpful magic of healing and inspiring their allies with spells that harm and hinder foes.",
    "LONGDESC": "Divine magic, as the name suggests, is the power of the gods, flowing from them into the world. Clerics are conduits for that power, manifesting it as miraculous effects. The gods don’t grant this power to everyone who seeks it, but only to those chosen to fulfill a high calling.\n     Harnessing divine magic doesn’t rely on study or training. A cleric might learn formulaic prayers and ancient rites, but the ability to cast cleric spells relies on devotion and an intuitive sense of a deity’s wishes.\n     Clerics combine the helpful magic o f healing and inspiring their allies with spells that harm and hinder foes. They can provoke awe and dread, lay curses of plague or poison, and even call down flames from heaven to consume their enemies. For those evildoers who will benefit most from a mace to the head, clerics depend on\ntheir combat training to let them wade into melee with the power of the gods on their side.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Strike I: Life",
    "ARCHETYPE": "Life Domain",
    "CLASS": "Cleric",
    "LEVEL": "8",
    "SHORTDESC": "You gain the ability to infuse your weapon strikes with divine energy, dealing an extra 1d8 radiant damage to the target.",
    "LONGDESC": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Strike I: Nature",
    "ARCHETYPE": "Nature Domain",
    "CLASS": "Cleric",
    "LEVEL": "8",
    "SHORTDESC": "You gain the ability to infuse your weapon strikes with divine energy, dealing an extra 1d8 cold, fire, or lightning damage (your choice) to the target.",
    "LONGDESC": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 cold, fire, or lightning damage (your choice) to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Strike I: Tempest",
    "ARCHETYPE": "Tempest Domain",
    "CLASS": "Cleric",
    "LEVEL": "8",
    "SHORTDESC": "Once per turn, you gain the ability to infuse a weapon strike with divine energy, dealing an extra 1d8 thunder damage to the target.",
    "LONGDESC": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Strike I: Trickery",
    "ARCHETYPE": "Trickery Domain",
    "CLASS": "Cleric",
    "LEVEL": "8",
    "SHORTDESC": "You gain the ability to infuse your weapon strikes with poison, dealing an extra 1d8 poison damage.",
    "LONGDESC": "At 8th level, you gain the ability to infuse your weapon strikes with poison—a gift from your deity. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Strike I: War",
    "ARCHETYPE": "War Domain",
    "CLASS": "Cleric",
    "LEVEL": "8",
    "SHORTDESC": "You gain the ability to infuse your weapon strikes with divine energy, dealing an extra 1d8 weapon damage.",
    "LONGDESC": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Strike II: Life",
    "ARCHETYPE": "Life Domain",
    "CLASS": "Cleric",
    "LEVEL": "14",
    "SHORTDESC": "You gain the ability to infuse your weapon strikes with divine energy, dealing an extra 2d8 radiant damage to the target.",
    "LONGDESC": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Strike II: Nature",
    "ARCHETYPE": "Nature Domain",
    "CLASS": "Cleric",
    "LEVEL": "14",
    "SHORTDESC": "You gain the ability to infuse your weapon strikes with divine energy, dealing an extra 2d8 cold, fire, or lightning damage (your choice) to the target.",
    "LONGDESC": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 cold, fire, or lightning damage (your choice) to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Strike II: Tempest",
    "ARCHETYPE": "Tempest Domain",
    "CLASS": "Cleric",
    "LEVEL": "14",
    "SHORTDESC": "Once per turn, you gain the ability to infuse a weapon strike with divine energy, dealing an extra 2d8 thunder damage to the target.",
    "LONGDESC": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Strike II: Trickery",
    "ARCHETYPE": "Trickery Domain",
    "CLASS": "Cleric",
    "LEVEL": "14",
    "SHORTDESC": "You gain the ability to infuse your weapon strikes with poison, dealing an extra 2d8 poison damage.",
    "LONGDESC": "At 8th level, you gain the ability to infuse your weapon strikes with poison—a gift from your deity. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Divine Strike II: War",
    "ARCHETYPE": "War Domain",
    "CLASS": "Cleric",
    "LEVEL": "14",
    "SHORTDESC": "You gain the ability to infuse your weapon strikes with divine energy, dealing an extra 2d8 weapon damage.",
    "LONGDESC": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Draconic Presence",
    "ARCHETYPE": "Draconic Bloodline",
    "CLASS": "Sorcerer",
    "LEVEL": "18",
    "SHORTDESC": "You can channel the dread presence of your dragon ancestor, causing those around you to become awestruck or frightened.",
    "LONGDESC": "Beginning at 18th level, you can channel the dread\npresence of your dragon ancestor, causing those around you to become awestruck or frightened. As an action, you can spend 5 sorcery points to draw on this power and exude an aura of awe or fear (your choice) to a distance of 60 feet. For 1 minute or until you lose your concentration (as if you were casting a concentration spell), each hostile creature that starts its turn in this aura must succeed on a Wisdom saving throw or be\ncharmed (if you chose awe) or frightened (if you chose fear) until the aura ends. A creature that succeeds on this saving throw is immune to your aura for 24 hours.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Draconic Reslilience",
    "ARCHETYPE": "Draconic Bloodline",
    "CLASS": "Sorcerer",
    "LEVEL": "1",
    "SHORTDESC": "As magic flows through your body,the physical traits of your dragon ancestors emerge, granting you +1 hit point for each sorcerer level and AC 13 + Dex mod when not wearing armor.",
    "LONGDESC": "As magic flows through your body, it causes physical traits of your dragon ancestors to emerge. At 1st level, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class.\n     Additionally, parts o f your skin are covered by a thin sheen of dragon-like scales. When you aren’t wearing armor, your AC equals 13 + your Dexterity modifier.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Dragon Ancestor",
    "ARCHETYPE": "Draconic Bloodline",
    "CLASS": "Sorcerer",
    "LEVEL": "1",
    "SHORTDESC": "Draconic magic is mingled with your blood, granting you draconic features and allowing you to speak, read, and write Draconic, and interact with draons with double proficiency.",
    "LONGDESC": "At 1st level, you choose one type of dragon as your ancestor. The damage type associated with each dragon is used by features you gain later.\n     You can speak, read, and write Draconic. Additionally, whenever you make a Charisma check when interacting with dragons, your proficiency bonus is doubled if it applies to the check.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Dragon Wings",
    "ARCHETYPE": "Draconic Bloodline",
    "CLASS": "Sorcerer",
    "LEVEL": "14",
    "SHORTDESC": "You gain the ability to sprout a pair of dragon wings from your back (as a bonus action), gaining a flying speed equal to your current speed. Your armor must accommodate the wings.",
    "LONGDESC": "At 14th level, you gain the ability to sprout a pair of dragon wings from your back, gaining a flying speed equal to your current speed. You can create these wings as a bonus action on your turn. They last until you dismiss them as a bonus action on your turn.\n     You can’t manifest your wings while wearing armor unless the armor is made to accommodate them, and clothing not made to accommodate your wings might be destroyed when you manifest them.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Druid Circle",
    "ARCHETYPE": "Base",
    "CLASS": "Druid",
    "LEVEL": "2",
    "SHORTDESC": "At 2nd level, you choose to identify with a circle of druids, such as: the Circle of the Land or the Circle of the Moon.",
    "LONGDESC": "At 2nd level, you choose to identify with a circle of druids, such as: the Circle of the Land or the Circle of the Moon, both detailed at the end of the class description. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Druidic Spellcasting",
    "ARCHETYPE": "Base",
    "CLASS": "Druid",
    "LEVEL": "1",
    "SHORTDESC": "Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will.",
    "LONGDESC": "Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will.\n     The Druid table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when\nyou finish a long rest.\n     You prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots.\n     For example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom o f 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn’t remove it from your list o f prepared spells.\n     You can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Druidic Tongue",
    "ARCHETYPE": "Base",
    "CLASS": "Druid",
    "LEVEL": "1",
    "SHORTDESC": "You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages.",
    "LONGDESC": "You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message’s presence with a successful DC 15 Wisdom (Perception) check but can’t decipher it without magic.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Durable Summons",
    "ARCHETYPE": "School of Conjuration",
    "CLASS": "Wizard",
    "LEVEL": "14",
    "SHORTDESC": "Any creature that you summon or create with a conjuration spell has 30 temporary hit points.",
    "LONGDESC": "Starting at 14th level, any creature that you summon or create with a conjuration spell has 30 temporary hit points.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Eldritch Cantrips",
    "ARCHETYPE": "Eldritch Knight",
    "CLASS": "Fighter",
    "LEVEL": "3",
    "SHORTDESC": "You two cantrips of your choice from the wizard spell list and an additional wizard cantrip at 10th level.",
    "LONGDESC": "You learn two cantrips of your choice from the wizard spell list. You learn an additional wizard cantrip of your choice at 10th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Eldritch Invocations",
    "ARCHETYPE": "Base",
    "CLASS": "Warlock",
    "LEVEL": "2",
    "SHORTDESC": "In your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability, gaining two eldtritch invocations.",
    "LONGDESC": "In your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability.\n     At 2nd level, you gain two eldritch invocations of your choice. Your invocation options are detailed at the end of the class description. When you gain certain w arlock levels, you gain additional invocations of your choice, as shown in the Invocations Known column of the Warlock table.\n     Additionally, when you gain a level in this class,\nyou can choose one of the invocations you know and replace it with another invocation that you could learn at that level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Eldritch Master",
    "ARCHETYPE": "Base",
    "CLASS": "Warlock",
    "LEVEL": "20",
    "SHORTDESC": "You can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature.",
    "LONGDESC": "You can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you\ncan do so again.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Eldritch Spellcaster",
    "ARCHETYPE": "Eldritch Knight",
    "CLASS": "Fighter",
    "LEVEL": "3",
    "SHORTDESC": "You can cast magical spells focusing on abjuration and evocation.",
    "LONGDESC": "Eldritch Knights use magical techniques similar\nto those practiced by wizards. They focus their study on two of the eight schools of magic: abjuration and evocation. Abjuration spells grant an Eldritch Knight additional protection in battle, and evocation spells deal damage to many foes at once, extending the fighter’s reach in combat. These knights learn a comparatively small number of spells, committing them to memory instead of keeping them in a spellbook.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Eldritch Strike",
    "ARCHETYPE": "Eldritch Knight",
    "CLASS": "Fighter",
    "LEVEL": "10",
    "SHORTDESC": "You learn how to make your weapon strikes undercut a creature’s resistance to your spells, inflicting Disadvantage on the creature\u0027s next save against an immediate spell you cast.",
    "LONGDESC": "At 10th level, you learn how to make your weapon strikes undercut a creature’s resistance to your spells. When you hit a creature with a weapon attack, that creature has disadvantage on the next saving throw it makes against a spell you cast before the end of your next turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Elemental Affinity",
    "ARCHETYPE": "Draconic Bloodline",
    "CLASS": "Sorcerer",
    "LEVEL": "6",
    "SHORTDESC": "When you cast a spell that deals your draconic damage type, add your Cha modifier to that damage. And, you can spend 1 sorcery point to gain resistance to that damage type for 1 hour.",
    "LONGDESC": "Starting at 6th level, when you cast a spell that deals damage of the type associated with your draconic ancestry, add your Charisma modifier to that damage. At the same time, you can spend 1 sorcery point to gain resistance to that damage type for 1 hour.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Elemental Wild Shape",
    "ARCHETYPE": "Circle of the Moon",
    "CLASS": "Druid",
    "LEVEL": "10",
    "SHORTDESC": "You can expend two uses of Wild Shape at the same time to transform into an air elemental, an earth elemental, a fire elemental, or a water elemental.",
    "LONGDESC": "At 10th level, you can expend two uses of Wild Shape at the same time to transform into an air elemental, an earth elemental, a fire elemental, or a water elemental.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Elusive",
    "ARCHETYPE": "Base",
    "CLASS": "Rogue",
    "LEVEL": "18",
    "SHORTDESC": "You are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren’t incapacitated.",
    "LONGDESC": "Beginning at 18th level, you are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren’t incapacitated.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Empowered Evocation",
    "ARCHETYPE": "School of Enchantment",
    "CLASS": "Wizard",
    "LEVEL": "10",
    "SHORTDESC": "You can add your Intelligence modifier to the damage roll of any wizard evocation spell you cast.",
    "LONGDESC": "Beginning at 10th level, you can add your Intelligence modifier to the damage roll of any wizard evocation spell you cast.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Empty Body",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "18",
    "SHORTDESC": "You can use your action to spend 4 ki points to become invisible for 1 minute and have resistance to force damage. You can also spend 8 ki to cast Astral Projection.",
    "LONGDESC": "Beginning at 18th level, you can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage.\n     Additionally, you can spend 8 ki points to cast the astral projection spell, without needing material components. When you do so, you can’t take any other creatures with you.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Enchantment Savant",
    "ARCHETYPE": "School of Enchantment",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "The gold and time you must spend to copy an enchantment spell into your spellbook is halved.",
    "LONGDESC": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy an enchantment spell into your spellbook is halved.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Entropic Ward",
    "ARCHETYPE": "The Great Old One",
    "CLASS": "Warlock",
    "LEVEL": "6",
    "SHORTDESC": "You learn to magically ward yourself against attack and to turn an enemy’s failed strike into good luck for yourself, imposing disadvantage on the attack and gaining advantage on your own.",
    "LONGDESC": "At 6th level, you learn to magically ward yourself against attack and to turn an enemy’s failed strike into good luck for yourself. When a creature makes an attack roll against you, you can use your reaction to impose disadvantage on that roll. If the attack misses you, your next attack roll against the creature has advantage if you make it before the end of your next turn.\n     Once you use this feature, you can’t use it again until you finish a short or long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Evasion: Monk",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "7",
    "SHORTDESC": "Your instinctive agility lets you dodge\nout of the way of certain area effects (reducing damage), such as a blue dragon’s lightning breath or a fireball spell.",
    "LONGDESC": "At 7th level, your instinctive agility lets you dodge\nout of the way of certain area effects, such as a blue dragon’s lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Evasion: Rogue",
    "ARCHETYPE": "Base",
    "CLASS": "Rogue",
    "LEVEL": "7",
    "SHORTDESC": "You can nimbly dodge out of the way of certain area effects, such as a red dragon’s fiery breath or an ice storm spell, reducing damage to half or none.",
    "LONGDESC": "Beginning at 7th level, you can nimbly dodge out of the way of certain area effects, such as a red dragon’s fiery breath or an ice storm spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Evocation Savant",
    "ARCHETYPE": "School of Enchantment",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "The gold and time you must spend to copy an evocation spell into your spellbook is halved.",
    "LONGDESC": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy an evocation spell into your spellbook is halved.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Exceptional Training",
    "ARCHETYPE": "Beast Master",
    "CLASS": "Ranger",
    "LEVEL": "7",
    "SHORTDESC": "On any of your turns when your beast companion doesn’t attack, you can use a bonus action to command the beast to take the Dash, Disengage, Dodge, or Help action on its turn.",
    "LONGDESC": "Beginning at 7th level, on any of your turns when\nyour beast companion doesn’t attack, you can use a bonus action to command the beast to take the Dash, Disengage, Dodge, or Help action on its turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Expanded Spell List: Archfey",
    "ARCHETYPE": "The Archfey",
    "CLASS": "Warlock",
    "LEVEL": "1",
    "SHORTDESC": "You can choose from an expanded list of spells when you learn a warlock spell.",
    "LONGDESC": "The Archfey lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you. 1st - burning hands, command; 2nd - blindness/deafness, scorching ray; 3rd - fireball, stinking cloud; 4th - fire shield, wall of fire; 5th - flame strike, hallow",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Expanded Spell List: Great Old One",
    "ARCHETYPE": "The Great Old One",
    "CLASS": "Warlock",
    "LEVEL": "1",
    "SHORTDESC": "The Great Old One lets you choose from an expanded list of spells when you learn a warlock spell.",
    "LONGDESC": "The Great Old One lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you: 1st - dissonant whispers and Tasha\u0027s hideous laughter; 2nd - detect thoughts and phantasmal force; 3rd - clairvoyance and sending; 4th - dominate beast, Evard’s black tentacles; 5th - dominate person and telekinesis",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Expert Diviniation",
    "ARCHETYPE": "School of Divination",
    "CLASS": "Wizard",
    "LEVEL": "6",
    "SHORTDESC": "Casting divination spells comes so easily to you that it expends only a fraction of your spellcasting efforts, regaining one expended spell slot when you cast a spell of 2nd level or higher.",
    "LONGDESC": "Beginning at 6th level, casting divination spells comes so easily to you that it expends only a fraction of your spellcasting efforts. When you cast a divination spell of 2nd level or higher using a spell slot, you regain one expended spell slot. The slot you regain must be of a level lower than the spell you cast and can’t be higher than 5th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Expertise: Bard",
    "ARCHETYPE": "Base",
    "CLASS": "Bard",
    "LEVEL": "3",
    "SHORTDESC": "At 3rd level, two of your skill proficiencies are doubled; at 10th level add two more skills to your expertise.",
    "LONGDESC": "At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either o f the chosen proficiencies.\n     At 10th level, you can choose another two skill\nproficiencies to gain this benefit.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Expertise: Rogue",
    "ARCHETYPE": "Base",
    "CLASS": "Rogue",
    "LEVEL": "1",
    "SHORTDESC": "Your thieves\u0027 tools skill and one other proficient skill is doubled for ability checks.",
    "LONGDESC": "At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves’ tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen\nproficiencies.\n     At 6th level, you can choose two more of your\nproficiencies (in skills or with thieves’ tools) to gain this benefit.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Extra Attack: Barbarian",
    "ARCHETYPE": "Base",
    "CLASS": "Barbarian",
    "LEVEL": "5",
    "SHORTDESC": "You can attack twice in a turn when using the Attack action.",
    "LONGDESC": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Extra Attack: Bard, Valor",
    "ARCHETYPE": "College of Valor",
    "CLASS": "Bard",
    "LEVEL": "6",
    "SHORTDESC": "You can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "LONGDESC": "Starting at 6th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Extra Attack: Fighter",
    "ARCHETYPE": "Base",
    "CLASS": "Fighter",
    "LEVEL": "5",
    "SHORTDESC": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "LONGDESC": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.\n     The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Extra Attack: Monk",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "5",
    "SHORTDESC": "You can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "LONGDESC": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Extra Attack: Paladin",
    "ARCHETYPE": "Base",
    "CLASS": "Paladin",
    "LEVEL": "5",
    "SHORTDESC": "You can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "LONGDESC": "You can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Extra Attack: Ranger",
    "ARCHETYPE": "Base",
    "CLASS": "Ranger",
    "LEVEL": "5",
    "SHORTDESC": "You can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "LONGDESC": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Fast Hands",
    "ARCHETYPE": "Thief",
    "CLASS": "Rogue",
    "LEVEL": "3",
    "SHORTDESC": "You can use the bonus action granted by your Cunning Action to make a Dexterity (Sleight of Hand) check, to disarm a trap or open a lock, or take the Use an Object action.",
    "LONGDESC": "Starting at 3rd level, you can use the bonus action\ngranted by your Cunning Action to make a Dexterity (Sleight o f Hand) check, use your thieves’ tools to disarm a trap or open a lock, or take the Use an Object action.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Fast Movement",
    "ARCHETYPE": "Base",
    "CLASS": "Barbarian",
    "LEVEL": "5",
    "SHORTDESC": "Your speed increases by 10 feet when you are not wearing heavy armor.",
    "LONGDESC": "Starting at 5th level, your speed increases by 10 feet while you aren’t wearing heavy armor.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Favored Enemy",
    "ARCHETYPE": "Base",
    "CLASS": "Ranger",
    "LEVEL": "1",
    "SHORTDESC": "You have significant experience studying, tracking, hunting, and even talking to a specific type of enemy.",
    "LONGDESC": "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy.\n     Choose a type of favored enemy: aberrations,\nbeasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies.\n     You have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them.\n     When you gain this feature, you also learn one\nlanguage of your choice that is spoken by your favored enemies, if they speak one at all.\n     You choose one additional favored enemy, as well as an associated language, at 6th and 14th level. As you gain levels, your choices should reflect the types of monsters you have encountered on your adventures.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Feral Instinct",
    "ARCHETYPE": "Base",
    "CLASS": "Barbarian",
    "LEVEL": "7",
    "SHORTDESC": "Your instincts grant you advantage on initiative rolls and you cannot be surprised at the beginning of combat, acting normally.",
    "LONGDESC": "By 7th level, your instincts are so honed that you have advantage on initiative rolls.\n     Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Feral Senses",
    "ARCHETYPE": "Base",
    "CLASS": "Ranger",
    "LEVEL": "18",
    "SHORTDESC": "You gain preternatural senses that help you fight creatures you can’t see, granting you no disadvantage on your attack rolls against it and awareness of invisible creatures within 30 ft.",
    "LONGDESC": "At 18th level, you gain preternatural senses that help you fight creatures you can’t see. When you attack a creature you can’t see, your inability to see it doesn’t impose disadvantage on your attack rolls against it.\n     You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn’t hidden from you and you aren’t blinded or deafened.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Fey Presence",
    "ARCHETYPE": "The Archfey",
    "CLASS": "Warlock",
    "LEVEL": "1",
    "SHORTDESC": "Your patron bestows upon you the ability to project (10\u0027 cube) the beguiling and fearsome presence of the fey, charming or frightening them until the end of your next turn.",
    "LONGDESC": "Starting at 1st level, your patron bestows upon you the ability to project the beguiling and fearsome presence of the fey. As an action, you can cause each creature in a 10-foot cube originating from you to make a Wisdom saving throw against your warlock spell save DC. The\ncreatures that fail their saving throws are all charmed or frightened by you (your choice) until the end of your next turn.\n     Once you use this feature, you can’t use it again until you finish a short or long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Fiendish Resilience",
    "ARCHETYPE": "The Fiend",
    "CLASS": "Warlock",
    "LEVEL": "10",
    "SHORTDESC": "After a rest, you gain resistance to a chosen damage type until you choose a different one after another rest. Magical and silver weapons pass through this resistance.",
    "LONGDESC": "Starting at 10th level, you can choose one damage type when you finish a short or long rest. You gain resistance to that damage type until you choose a different one with this feature. Damage from magical weapons or silver weapons ignores this resistance.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Fighting Style",
    "ARCHETYPE": "Base",
    "CLASS": "Ranger",
    "LEVEL": "2",
    "SHORTDESC": "You adopt a particular style of fighting as your specialty, selecting one of the following: Archery, Defense, Dueling, or Two-Weapon Fighting.",
    "LONGDESC": "At 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again.\nArchery\nYou gain a +2 bonus to attack rolls you make with\nranged w eapons.\nDefense\nWhile you are wearing armor, you gain a +1 bonus to AC.\nDueling\nWhen you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\nTwo-Weapon Fighting\nWhen you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Fighting Style: Fighter",
    "ARCHETYPE": "Base",
    "CLASS": "Fighter",
    "LEVEL": "1",
    "SHORTDESC": "You adopt a particular style of fighting as your specialty: Archery, Defense, Dueling, Great Weapon Fighting, Protection, or Two-Weapon Fighting.",
    "LONGDESC": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again.\nArchery\nYou gain a +2 bonus to attack rolls you make with ranged weapons.\nDefense\nWhile you are wearing armor, you gain a +1 bonus to AC.\nDueling\nWhen you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\nGreat Weapon Fighting\nWhen you roll a 1 or 2 on a damage die for an attack you make with a melee w eapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.\nProtection\nWhen a creature you can see attacks a target other\nthan you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.\nTwo-Weapon Fighting\nWhen you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Fighting Style: Paladin",
    "ARCHETYPE": "Base",
    "CLASS": "Paladin",
    "LEVEL": "2",
    "SHORTDESC": "You adopt a style of fighting as your specialty, choosing one of the following options: Defense, Dueling, Great Weapon Fighting, or Protection.",
    "LONGDESC": "At 2nd level, you adopt a style of fighting as your\nspecialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again.\nDefense\nWhile you are wearing armor, you gain a +1 bonus to AC.\nDueling\nWhen you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\nGreat Weapon Fighting\nWhen you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll. The weapon must have the two-handed or versatile property for you to gain this benefit.\nProtection\nWhen a creature you can see attacks a target other\nthan you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Flurry of Blows",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "2",
    "SHORTDESC": "Immediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action.",
    "LONGDESC": "Immediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Focused Conjuration",
    "ARCHETYPE": "School of Conjuration",
    "CLASS": "Wizard",
    "LEVEL": "10",
    "SHORTDESC": "While you are concentrating on a conjuration spell, your concentration can’t be broken as a result of taking damage.",
    "LONGDESC": "Beginning at 10th level, while you are concentrating on a conjuration spell, your concentration can’t be broken as a result of taking damage.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Foe Slayer",
    "ARCHETYPE": "Base",
    "CLASS": "Ranger",
    "LEVEL": "20",
    "SHORTDESC": "You become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies.",
    "LONGDESC": "At 20th level, you become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Font of Inspiration",
    "ARCHETYPE": "Base",
    "CLASS": "Bard",
    "LEVEL": "5",
    "SHORTDESC": "Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest.",
    "LONGDESC": "Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Font of Magic",
    "ARCHETYPE": "Base",
    "CLASS": "Sorcerer",
    "LEVEL": "2",
    "SHORTDESC": "You tap into a deep wellspring of magic within yourself, represented by sorcery points, which allow you to create a variety of magical effects.",
    "LONGDESC": "At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects.\n     You have 2 sorcery points, and you gain more as you reach higher levels, as shown in the Sorcery Points column of the Sorcerer table. You can never have more sorcery points than shown on the table for your level. You regain all spent sorcery points when you finish a long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Frenzy",
    "ARCHETYPE": "Path of the Berserker",
    "CLASS": "Barbarian",
    "LEVEL": "3",
    "SHORTDESC": "You can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one.",
    "LONGDESC": "Starting when you choose this path at 3rd level, you can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Greater Portent",
    "ARCHETYPE": "School of Divination",
    "CLASS": "Wizard",
    "LEVEL": "14",
    "SHORTDESC": "The visions in your dreams intensify and paint a more accurate picture in your mind of what is to come. You roll three d20s for your Portent feature, rather than two.",
    "LONGDESC": "Starting at 14th level, the visions in your dreams\nintensify and paint a more accurate picture in your mind of what is to come. You roll three d20s for your Portent feature, rather than two.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Grim Harvest",
    "ARCHETYPE": "School of Necromancy",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "When you kill one or more creatures with a spell of 1st level or higher, you regain hit points equal to twice the spell’s level, or three times its level if a Necromancy spell.",
    "LONGDESC": "At 2nd level, you gain the ability to reap life energy from creatures you kill with your spells. Once per turn when you kill one or more creatures with a spell of 1st level or higher, you regain hit points equal to twice the spell’s level, or three times its level if the spell belongs to the School of Necromancy. You don’t gain this benefit for killing constructs or undead.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Hide in Plain Sight",
    "ARCHETYPE": "Base",
    "CLASS": "Ranger",
    "LEVEL": "10",
    "SHORTDESC": "You can spend 1 minute creating camouflage using fresh mud, dirt, plants, soot, and other naturally occurring materials, adding a +10 bonus to Stealth checks.",
    "LONGDESC": "Starting at 10th level, you can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage.\n     Once you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you move or take an action or a reaction, you must camouflage yourself again to gain this benefit.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Holy Nimbus",
    "ARCHETYPE": "Oath of Devotion",
    "CLASS": "Paladin",
    "LEVEL": "20",
    "SHORTDESC": "You can emanate an aura of sunlight for 1 minute (30 ft-r), dealing 10 radiant damage to creatures that start their turn in it. You also gain advantage on saves vs spells from undead and fiends.",
    "LONGDESC": "At 20th level, as an action, you can emanate an aura of sunlight. For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that.\n     Whenever an enemy creature starts its turn in the bright light, the creature takes 10 radiant damage.\n     In addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead.\n     Once you use this feature, you can’t use it again until you finish a long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Hunter\u0027s Prey",
    "ARCHETYPE": "Hunter",
    "CLASS": "Ranger",
    "LEVEL": "3",
    "SHORTDESC": "You gain one of the following features of your choice: Colossus Slayer, Giant Killer, or Horde Breaker.",
    "LONGDESC": "At 3rd level, you gain one of the following features of your choice.\n     Colossus Slayer. Your tenacity can w ear down\nthe most potent foes. When you hit a creature with a weapon attack, the creature takes an extra 1d8 damage if it’s below its hit point maximum. You can deal this extra damage only once per turn.\n     Giant Killer. When a Large or larger creature within 5 feet of you hits or misses you with an attack, you can use your reaction to attack that creature immediately after its attack, provided that you can see the creature.\n     Horde Breaker. Once on each of your turns when you make a w eapon attack, you can make another attack with the same weapon against a different creature that is within 5 feet of the original target and within range of your weapon.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Hurl Through Hell",
    "ARCHETYPE": "The Fiend",
    "CLASS": "Warlock",
    "LEVEL": "14",
    "SHORTDESC": "When you strike a creature, you can instantly transport the target through Hell, hurtling through a nightmare landscape, and taking 10d10 psychic damage when it returns next turn.",
    "LONGDESC": "Starting at 14th level, when you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. The creature disappears and hurtles through a nightmare landscape.\n     At the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. If the target is not a fiend, it takes 10d10 psychic damage as it reels from its horrific experience.\n     Once you use this feature, you can’t use it again until you finish a long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Hypnotic Gaze",
    "ARCHETYPE": "School of Enchantment",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "Your soft words and enchanting gaze can magically enthrall another creature within 5 feet of you, causing the creature to be dazed, incapacitated, and speed 0.",
    "LONGDESC": "Starting at 2nd level when you choose this school, your soft words and enchanting gaze can magically enthrall another creature. As an action, choose one creature that you can see within 5 feet of you. If the target can see or hear you, it must succeed on a Wisdom saving throw against your wizard spell save DC or be charmed by you until the end of your next turn. The charmed creature’s speed drops to 0, and the creature is incapacitated and visibly dazed.\n     On subsequent turns, you can use your action to maintain this effect, extending its duration until the end of your next turn. However, the effect ends if you move more than 5 feet away from the creature, if the creature can neither see nor hear you, or if the creature takes damage.\n     Once the effect ends, or if the creature succeeds on its initial saving throw against this effect, you can’t use this feature on that creature again until you finish a long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Illusion Savant",
    "ARCHETYPE": "School of Illusion",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "The gold and time you must spend to copy an illusion spell into your spellbook is halved.",
    "LONGDESC": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy an illusion spell into your spellbook is halved.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Illusory Reality",
    "ARCHETYPE": "School of Illusion",
    "CLASS": "Wizard",
    "LEVEL": "14",
    "SHORTDESC": "When you cast an illusion spell of 1st level or higher, you can choose one inanimate object that is part of the illusion and make that object real for 1 minute (bonus action).",
    "LONGDESC": "By 14th level, you have learned the secret of weaving shadow magic into your illusions to give them a semireality. When you cast an illusion spell of 1st level or higher, you can choose one inanimate, nonmagical object that is part of the illusion and make that object real. You can do this on your turn as a bonus action while the spell is ongoing. The object remains real for 1 minute. For example, you can create an illusion of a bridge over a chasm and then make it real long enough for your allies to cross.\n     The object can’t deal damage or otherwise\ndirectly harm anyone.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Illusory Self",
    "ARCHETYPE": "School of Illusion",
    "CLASS": "Wizard",
    "LEVEL": "10",
    "SHORTDESC": "You can create an illusory duplicate of yourself as an instant reaction to danger, using your reaction to interpose the illusory duplicate between the attacker and yourself.",
    "LONGDESC": "Beginning at 10th level, you can create an illusory duplicate of yourself as an instant, almost instinctual reaction to danger. When a creature makes an attack roll against you, you can use your reaction to interpose the illusory duplicate between the attacker and yourself. The attack automatically misses you, then the illusion dissipates.\n     Once you use this feature, you can’t use it again until you finish a short or long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Impostor",
    "ARCHETYPE": "Assassin",
    "CLASS": "Rogue",
    "LEVEL": "13",
    "SHORTDESC": "You gain the ability to unerringly, and indiscernibly, mimic another person, spending at least 3 hours studying the person’s behavior - speech, handwriting, and mannerisms.",
    "LONGDESC": "At 13th level, you gain the ability to unerringly mimic another person’s speech, writing, and behavior. You must spend at least three hours studying these three components of the person’s behavior, listening to speech, examining handwriting, and observing mannerisms.\n     Your ruse is indiscernible to the casual observer. If a wary creature suspects something is amiss, you have advantage on any Charisma (Deception) check you make to avoid detection.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Improved Abjuration",
    "ARCHETYPE": "School of Abjuration",
    "CLASS": "Wizard",
    "LEVEL": "10",
    "SHORTDESC": "When you cast an abjuration spell requiring an ability check as a part of casting that spell (as in counterspell and dispel magic), you add your proficiency bonus to that ability check.",
    "LONGDESC": "Beginning at 10th level, when you cast an abjuration spell that requires you to make an ability check as a part of casting that spell (as in counterspell and dispel magic), you add your proficiency bonus to that ability check.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Improved Combat Superiority I",
    "ARCHETYPE": "Battle Master",
    "CLASS": "Fighter",
    "LEVEL": "10",
    "SHORTDESC": "Your now use d10s as your superiority dice.",
    "LONGDESC": "At 10th level, your superiority dice turn into d10s. At 18th level, they turn into d12s .",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Improved Combat Superiority II",
    "ARCHETYPE": "Battle Master",
    "CLASS": "Fighter",
    "LEVEL": "18",
    "SHORTDESC": "Your now use d12s as your superiority dice.",
    "LONGDESC": "At 10th level, your superiority dice turn into d10s. At 18th level, they turn into d12s .",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Improved Critical",
    "ARCHETYPE": "Champion",
    "CLASS": "Fighter",
    "LEVEL": "3",
    "SHORTDESC": "Your weapon attacks score a critical hit on a roll of 19 or 20.",
    "LONGDESC": "Beginning when you choose this archetype at 3rd level, your weapon attacks score a critical hit on a roll of 19 or 20.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Improved Divine Smite",
    "ARCHETYPE": "Base",
    "CLASS": "Paladin",
    "LEVEL": "11",
    "SHORTDESC": "Your melee weapon strikes are suffused with righteous might carrying divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage.",
    "LONGDESC": "By 11th level, you are so suffused with righteous\nmight that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage. If you also use your Divine Smite with an attack, you add this damage to the extra damage of your Divine Smite.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Improved Duplicity",
    "ARCHETYPE": "Trickery Domain",
    "CLASS": "Cleric",
    "LEVEL": "17",
    "SHORTDESC": "You gain the ability to infuse your weapon strikes with poison, dealing an extra 2d8 poison damage.",
    "LONGDESC": "At 17th level, you can create up to four duplicates\nof yourself, instead of one, when you use Invoke\nDuplicity. As a bonus action on your turn, you can\nmove any number of them up to 30 feet, to a maximum range of 120 feet.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Improved Flare",
    "ARCHETYPE": "Light Domain",
    "CLASS": "Cleric",
    "LEVEL": "6",
    "SHORTDESC": "You can also use your Warding Flare feature to assist an ally.",
    "LONGDESC": "Starting at 6th level, you can also use your Warding Flare feature when a creature that you can see within 30 feet of you attacks a creature other than you.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Improved Minor Illusion",
    "ARCHETYPE": "School of Illusion",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "You learn the minor illusion cantrip, enhancing it with both a sound and an image in a single casting. If you already know this cantrip, you learn a different wizard cantrip of your choice.",
    "LONGDESC": "When you choose this school at 2nd level, you learn the minor illusion cantrip. If you already know this cantrip, you learn a different wizard cantrip of your choice. The cantrip doesn’t count against your number of cantrips known.\n     When you cast minor illusion, you can create both a sound and an image with a single casting of the spell.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Improved War Magic",
    "ARCHETYPE": "Eldritch Knight",
    "CLASS": "Fighter",
    "LEVEL": "18",
    "SHORTDESC": "When you use your action to cast a spell, you can make one weapon attack as a bonus action.",
    "LONGDESC": "Starting at 18th level, when you use your action to cast a spell, you can make one weapon attack as a bonus action.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Indomitable",
    "ARCHETYPE": "Base",
    "CLASS": "Fighter",
    "LEVEL": "9",
    "SHORTDESC": "Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can’t use this feature again until you finish a long rest.",
    "LONGDESC": "Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can’t use this feature again until you finish a long rest.\n     You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Indomitable Might",
    "ARCHETYPE": "Base",
    "CLASS": "Barbarian",
    "LEVEL": "18",
    "SHORTDESC": "At 18th level you can use your Strength score or your Strength check roll, whichever result is higher.",
    "LONGDESC": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Infiltration Expertise",
    "ARCHETYPE": "Assassin",
    "CLASS": "Rogue",
    "LEVEL": "9",
    "SHORTDESC": "You can unfailingly create false identities for yourself, but you must spend 7 days and 25 gp to establish the history, profession, and affiliations for an identity.",
    "LONGDESC": "Starting at 9th level, you can unfailingly create false identities for yourself. You must spend seven days and 25 gp to establish the history, profession, and affiliations for an identity. You can’t establish an identity that belongs to someone else. For example, you might acquire appropriate clothing, letters of introduction, and officiallooking certification to establish yourself as a member of a trading house from a remote city so you can insinuate yourself into the company of other wealthy merchants.\n     Thereafter, if you adopt the new identity as a disguise, other creatures believe you to be that person until given an obvious reason not to.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Instinctive Charm",
    "ARCHETYPE": "School of Enchantment",
    "CLASS": "Wizard",
    "LEVEL": "6",
    "SHORTDESC": "When a creature you can see within 30 feet of you makes an attack roll against you, you can use your reaction to divert the attack to another creature within the attack’s range.",
    "LONGDESC": "Beginning at 6th level, when a creature you can see within 30 feet of you makes an attack roll against you, you can use your reaction to divert the attack, provided that another creature is within the attack’s range. The attacker must make a Wisdom saving throw against your wizard spell save DC. On a failed save, the attacker must target the creature that is closest to it, not including you or itself. If multiple creatures\nare closest, the attacker chooses which one to target.\n     On a successful save, you can’t use this feature on the attacker again until you finish a long rest.\nYou must choose to use this feature before knowing whether the attack hits or misses. Creatures that can’t be charmed are immune to this effect.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Intimidating Presence",
    "ARCHETYPE": "Path of the Berserker",
    "CLASS": "Barbarian",
    "LEVEL": "10",
    "SHORTDESC": "You can use your action to frighten someone within 30 feet with your menacing presence.",
    "LONGDESC": "Beginning at 10th level, you can use your action to\nfrighten someone with your menacing presence.\nWhen you do so, choose one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you.\n     If the creature succeeds on its saving throw, you can\u0027t use this feature on that creature again for 24 hours.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Inured to Undeath",
    "ARCHETYPE": "School of Necromancy",
    "CLASS": "Wizard",
    "LEVEL": "10",
    "SHORTDESC": "You have resistance to necrotic damage, and your hit point maximum can\u0027t be reduced.",
    "LONGDESC": "Beginning at 10th level, you have resistance to necrotic damage, and your hit point maximum can\u0027t be reduced. You have spent so much time dealing with undead and the forces that animate them that you have become inured to some of their worst effects.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Jack of All Trades",
    "ARCHETYPE": "Base",
    "CLASS": "Bard",
    "LEVEL": "2",
    "SHORTDESC": "At 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn’t already include your proficiency bonus.",
    "LONGDESC": "Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn’t already include your proficiency bonus.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Ki Energy",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "2",
    "SHORTDESC": "Monks make careful study of a magical energy that most monastic traditions call ki. Monks harness this power within themselves to create magical effects and exceed their bodies\u0027 physical capabilities.",
    "LONGDESC": "Monks make careful study of a magical energy that most monastic traditions call ki. This energy is an element of the magic that suffuses the multiverse—specifically, the element that flows through living bodies. Monks harness this power within themselves to create magical effects and exceed their bodies\u0027 physical capabilities, and some o f their special attacks can hinder the flow of ki in their opponents. Using this energy, monks channel uncanny speed and strength into their unarmed strikes. As they gain experience, their martial training and their mastery of ki gives them more power over their bodies and the bodies of their foes.\n     Starting at 2nd level, your training allows you to\nharness the mystic energy of ki. Your access to this\nenergy is represented by a number of ki points. Your monk level determines the number o f points you have, as shown in the Ki Points column o f the Monk table.\n     You can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step o f the Wind. You learn more ki features as you gain levels in this class.\n     When you spend a ki point, it is unavailable until you finish a short or long rest, at the end o f which you draw all of your expended ki back into yourself. You must spend at least 30 minutes o f the rest meditating to regain your ki points.\n     Some of your ki features require your target to make a saving throw to resist the feature’s effects. The saving throw DC is calculated as follows: Ki Save DC \u003d 8 + your proficiency bonus + your Wis mod.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Ki-Empowered Strikes",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "6",
    "SHORTDESC": "Your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.",
    "LONGDESC": "Starting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Know Your Enemy",
    "ARCHETYPE": "Battle Master",
    "CLASS": "Fighter",
    "LEVEL": "7",
    "SHORTDESC": "When you spend at least 1 minute observing or interacting with another creature outside combat, you can learn certain information about its capabilities compared to your own.",
    "LONGDESC": "Starting at 7th level, if you spend at least 1 minute\nobserving or interacting with another creature outside combat, you can learn certain information about its capabilities compared to your own. The DM tells you if the creature is your equal, superior, or inferior in regard to two of the following characteristics of your choice:\n• Strength score\n• Dexterity score\n• Constitution score\n• Armor Class\n• Current hit points\n• Total class levels (if any)\n• Fighter class levels (if any)",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Land\u0027s Stride: Druid",
    "ARCHETYPE": "Circle of the Land",
    "CLASS": "Druid",
    "LEVEL": "6",
    "SHORTDESC": "Moving through nonmagical difficult terrain costs you no extra movement and you can pass through nonmagical plants without being slowed or taking damage from them: thorns, spines, and such.",
    "LONGDESC": "Starting at 6th level, moving through nonmagical\ndifficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.\n     In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Land\u0027s Stride: Ranger",
    "ARCHETYPE": "Base",
    "CLASS": "Ranger",
    "LEVEL": "8",
    "SHORTDESC": "Moving through nonmagical difficult terrain costs you no extra movement, passing through nonmagical plants without being slowed and without taking damage from thorns, spines, or a similar hazard.",
    "LONGDESC": "Starting at 8th level, moving through nonmagical\ndifficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.\n     In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Lay on Hands",
    "ARCHETYPE": "Base",
    "CLASS": "Paladin",
    "LEVEL": "1",
    "SHORTDESC": "Your blessed touch can heal wounds. You can restore a total number of hit points equal to your paladin level x 5.",
    "LONGDESC": "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level x 5.\n     As an action, you can touch a creature and draw\npower from the pool to restore a number o f hit points to that creature, up to the maximum amount remaining in your pool.\n     Alternatively, you can expend 5 hit points from your pool of healing to cure the target o f one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one.\n     This feature has no effect on undead and constructs.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Mage Hand Legerdemain",
    "ARCHETYPE": "Arcane Trickster",
    "CLASS": "Rogue",
    "LEVEL": "3",
    "SHORTDESC": "When you cast mage hand, you can make the spectral hand invisible, and you can perform additional tasks with it: stow an object, retrieve an object, or use thieves\u0027 tools at range.",
    "LONGDESC": "Starting at 3rd level, when you cast mage hand, you can make the spectral hand invisible, and you can perform the following additional tasks with it:\n• You can stow one object the hand is holding in a\ncontainer worn or carried by another creature.\n• You can retrieve an object in a container worn or\ncarried by another creature.\n• You can use thieves’ tools to pick locks and disarm traps at range.\nYou can perform one of these tasks without being noticed by a creature if you succeed on a Dexterity (Sleight o f Hand) check contested by the creature’s Wisdom (Perception) check.\n     In addition, you can use the bonus action granted by your Cunning Action to control the hand.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Magical Ambush",
    "ARCHETYPE": "Arcane Trickster",
    "CLASS": "Rogue",
    "LEVEL": "9",
    "SHORTDESC": "If you are hidden from a creature when you cast a spell on it, the creature has disadvantage on any saving throw it makes against the spell this turn.",
    "LONGDESC": "Starting at 9th level, if you are hidden from a creature when you cast a spell on it, the creature has disadvantage on any saving throw it makes against the spell this turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Magical Secrets",
    "ARCHETYPE": "Base",
    "CLASS": "Bard",
    "LEVEL": "10",
    "SHORTDESC": "At 10th level, choose two spells from any class to count as your bard spells. You gain two more spells at 14th level and again at 18th level.",
    "LONGDESC": "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip.\n     The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table.\n     You learn two additional spells from any class at 14th level and again at 18th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Malleable Illusions",
    "ARCHETYPE": "School of Illusion",
    "CLASS": "Wizard",
    "LEVEL": "6",
    "SHORTDESC": "When you cast an illusion spell that has a duration of 1 minute or longer, you can use your action to change the nature of that illusion, provided you can see the illusion.",
    "LONGDESC": "Starting at 6th level, when you cast an illusion spell that has a duration of 1 minute or longer, you can use your action to change the nature of that illusion (using the spell’s normal parameters for the illusion), provided that you can see the illusion.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Martial Archetype",
    "ARCHETYPE": "Base",
    "CLASS": "Fighter",
    "LEVEL": "3",
    "SHORTDESC": "At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques, such as Champion, Battle Master, or Eldritch Knight.",
    "LONGDESC": "At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques, such as Champion, Battle Master, or Eldritch Knight. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Martial Arts",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "1",
    "SHORTDESC": "At 1st level, your practice of martial arts gives you\nmastery of combat styles that use unarmed strikes and monk weapons.",
    "LONGDESC": "At 1st level, your practice of martial arts gives you\nmastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don’t have the two-handed or heavy property.\n     You gain the following benefits while you are unarmed or wielding only monk weapons and you aren’t wearing armor or wielding a shield:\n• You can use Dexterity instead of Strength for the\nattack and damage rolls of your unarmed strikes and monk weapons.\n• You can roll a d4 in place of the normal damage\nof your unarmed strike or monk weapon. This die\nchanges as you gain monk levels, as shown in the\nMartial Arts column of the Monk table.\n• When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven\u0027t already taken a bonus action this turn.\n     Certain monasteries use specialized forms of the monk weapons. For example, you might use a club that is two lengths of wood connected by a short chain (called a nunchaku) or a sickle with a shorter, straighter blade (called a kama).",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Master of Nature",
    "ARCHETYPE": "Nature Domain",
    "CLASS": "Cleric",
    "LEVEL": "17",
    "SHORTDESC": "You gain the ability to command animals and plant creatures as a bonus action to your Charm Animals and Plants feature.",
    "LONGDESC": "At 17th level, you gain the ability to command animals and plant creatures. While creatures are charmed by your Charm Animals and Plants feature, you can take a bonus action on your turn to verbally command what each of those creatures will do on its next turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Master Transmuter",
    "ARCHETYPE": "School of Transmutation",
    "CLASS": "Wizard",
    "LEVEL": "14",
    "SHORTDESC": "You can consume the reserve of transmutation magic stored within your transmuter’s stone in a single burst choosing: Major Transformation, Panacea, Restore Life, or Restore Youth.",
    "LONGDESC": "Starting at 14th level, you can use your action to\nconsume the reserve of transmutation magic stored within your transmuter’s stone in a single burst. When you do so, choose one of the following effects. Your transmuter’s stone is destroyed and can’t be remade until you finish a long rest.\n     Major Transformation. You can transmute one\nnonmagical object—no larger than a 5-foot cube—into another nonmagical object o f similar size and mass and of equal or lesser value. You must spend 10 minutes handling the object to transform it.\n     Panacea. You remove all curses, diseases, and poisons affecting a creature that you touch with the transmuter’s stone. The creature also regains all its hit points.\n     Restore Life. You cast the raise dead spell on a\ncreature you touch with the transmuter’s stone, without expending a spell slot or needing to have the spell in your spellbook.\n     Restore Youth. You touch the transmuter’s stone to a willing creature, and that creature’s apparent age is reduced by 3d10 years, to a minimum of 13 years. This effect doesn’t extend the creature’s lifespan.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Mindless Rage",
    "ARCHETYPE": "Path of the Berserker",
    "CLASS": "Barbarian",
    "LEVEL": "6",
    "SHORTDESC": "You can’t be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage.",
    "LONGDESC": "Beginning at 6th level, you can’t be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Minor Alchemy",
    "ARCHETYPE": "School of Transmutation",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "You can temporarily alter the physical properties of one nonmagical object, changing it from one substance into another.",
    "LONGDESC": "Starting at 2nd level when you select this school, you can temporarily alter the physical properties of one nonmagical object, changing it from one substance into another. You perform a special alchemical procedure on one object composed entirely of wood, stone (but not a gemstone), iron, copper, or silver, transforming it into a different one of those materials. For each 10 minutes you spend performing the procedure, you can transform up to 1 cubic foot of material. After 1 hour, or until you lose your concentration (as if you were concentrating on a spell), the material reverts to its original substance.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Minor Conjuration",
    "ARCHETYPE": "School of Conjuration",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "You can use your action to conjure up an inanimate object in your hand or on the ground in an unoccupied space that you can see within 10 feet of you.",
    "LONGDESC": "Starting at 2nd level when you select this school, you can use your action to conjure up an inanimate object in your hand or on the ground in an unoccupied space that you can see within 10 feet of you. This object can be no larger than 3 feet on a side and weigh no more than 10 pounds, and its form must be that of a nonmagical object that you have seen. The object is visibly magical,\nradiating dim light out to 5 feet.\n     The object disappears after 1 hour, when you use this feature again, or if it takes any damage.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Misty Escape",
    "ARCHETYPE": "The Archfey",
    "CLASS": "Warlock",
    "LEVEL": "6",
    "SHORTDESC": "You can vanish in a puff of mist in response to damage, using your reaction to turn invisible and teleport up to 60 feet to an unoccupied space you can see.",
    "LONGDESC": "Starting at 6th level, you can vanish in a puff of mist in response to harm. When you take damage, you can use your reaction to turn invisible and teleport up to 60 feet to an unoccupied space you can see. You remain invisible until the start o f your next turn or until you attack or cast a spell.\n     Once you use this feature, you can\u0027t use it again until you finish a short or long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Monastic Tradition",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "3",
    "SHORTDESC": "When you reach 3rd level, you commit yourself to a monastic tradition, such as: the Way of the Open Hand, the Way of Shadow, or the Way of the Four Elements.",
    "LONGDESC": "When you reach 3rd level, you commit yourself to a monastic tradition: the Way o f the Open Hand, the Way of Shadow, or the Way of the Four Elements, all detailed at the end o f the class description. Your tradition grants you features at 3rd level and again at 6th, 11th, and 17th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Monk Unarmored Defense",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "1",
    "SHORTDESC": "While not wearing armor or wielding a shield, your AC equals 10 + Dex mod + Wis mod.",
    "LONGDESC": "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Multiattack",
    "ARCHETYPE": "Hunter",
    "CLASS": "Ranger",
    "LEVEL": "11",
    "SHORTDESC": "You gain one of the following features of your choice: Volley or Whirlwind Attack.",
    "LONGDESC": "At 11th level, you gain one of the following features of your choice.\n     Volley. You can use your action to make a ranged attack against any number of creatures within 10 feet of a point you can see within your w eapon’s range. You must have ammunition for each target, as normal, and you make a separate attack roll for each target.\n     Whirlwind Attack. You can use your action to make a melee attack against any number of creatures within 5 feet of you, with a separate attack roll for each target.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Mystic Arcanum",
    "ARCHETYPE": "Base",
    "CLASS": "Warlock",
    "LEVEL": "11",
    "SHORTDESC": "Your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list as this arcanum.\n     You can cast your arcanum spell once without expending a spell slot.",
    "LONGDESC": "At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list as this arcanum.\n     You can cast your arcanum spell once without\nexpending a spell slot. You must finish a long rest before you can do so again.\n     At higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th-level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic Arcanum when you finish a long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Natural Explorer",
    "ARCHETYPE": "Base",
    "CLASS": "Ranger",
    "LEVEL": "1",
    "SHORTDESC": "You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions, selecting one favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark.",
    "LONGDESC": "You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that\nyou’re proficient in.\n     While traveling for an hour or m ore in your favored terrain, you gain the following benefits:\n• Difficult terrain doesn’t slow your group’s travel.\n• Your group can’t become lost except by magical\nmeans.\n• Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.\n• If you are traveling alone, you can move stealthily at a normal pace.\n• When you forage, you find twice as much food as you normally would.\n• While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area.\n     You choose additional favored terrain types at 6th and 10th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Natural Recovery",
    "ARCHETYPE": "Circle of the Land",
    "CLASS": "Druid",
    "LEVEL": "2",
    "SHORTDESC": "During a short rest, you can regain some of your magical energy by sitting in meditation and communing with nature - up to half your druid level in spell slot levels.",
    "LONGDESC": "Starting at 2nd level, you can regain some of your magical energy by sitting in meditation and communing with nature. During a short rest, you choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can’t use this feature again until you finish a long rest.\n     For example, when you are a 4th-level druid, you can recover up to two levels w orth of spell slots. You can recover either a 2nd-level slot or two 1st-level slots.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Nature\u0027s Sanctuary",
    "ARCHETYPE": "Circle of the Land",
    "CLASS": "Druid",
    "LEVEL": "14",
    "SHORTDESC": "Creatures of the natural world sense your connection to nature and become hesitant to attack you for 24 hours.",
    "LONGDESC": "When you reach 14th level, creatures of the natural world sense your connection to nature and become hesitant to attack you. When a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours.\n     The creature is aware o f this effect before it makes its attack against you.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Nature\u0027s Ward",
    "ARCHETYPE": "Circle of the Land",
    "CLASS": "Druid",
    "LEVEL": "10",
    "SHORTDESC": "You can’t be charmed or frightened by elementals or fey, and you are immune to poison and disease.",
    "LONGDESC": "When you reach 10th level, you can’t be charmed or frightened by elementals or fey, and you are immune to poison and disease.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Necromancy Savant",
    "ARCHETYPE": "School of Necromancy",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "The gold and time you must spend to copy an necromancy spell into your spellbook is halved.",
    "LONGDESC": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy an necromancy spell into your spellbook is halved.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells I: Ancients",
    "ARCHETYPE": "Oath of the Ancients",
    "CLASS": "Paladin",
    "LEVEL": "3",
    "SHORTDESC": "You gain 3rd level oath spells: Ensnaring Strike and Speak with Animals",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - ensnaring strike and speak with animals,\n5th - moonbeam and misty step, 9th - plant growth and protection from energy, 13th - ice storm and stoneskin, 17th - commune with nature and tree stride",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells I: Devotion",
    "ARCHETYPE": "Oath of Devotion",
    "CLASS": "Paladin",
    "LEVEL": "3",
    "SHORTDESC": "You gain 3rd level oath spells: Protection from Evil and Good, and Sanctuary.",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - protection from evil and good, sanctuary, 5th - lesser restoration, zone of truth, 9th - beacon of hope, dispel magic, 13th - freedom of movement, guardian of faith, 17th - commune, flame strike",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells I: Vengeance",
    "ARCHETYPE": "Oath of Vengeance",
    "CLASS": "Paladin",
    "LEVEL": "3",
    "SHORTDESC": "You gain 3rd level oath spells: Bane and Hunter’s Mark",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - bane and hunter’s mark, 5th - hold person and misty step, 9th - haste and protection from energy, 13th - banishment and dimension door, 17th - hold monster and scrying",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells II: Ancients",
    "ARCHETYPE": "Oath of the Ancients",
    "CLASS": "Paladin",
    "LEVEL": "5",
    "SHORTDESC": "You gain 5th level oath spells: Moonbeam and Misty Step",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - ensnaring strike and speak with animals,\n5th - moonbeam and misty step, 9th - plant growth and protection from energy, 13th - ice storm and stoneskin, 17th - commune with nature and tree stride",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells II: Devotion",
    "ARCHETYPE": "Oath of Devotion",
    "CLASS": "Paladin",
    "LEVEL": "5",
    "SHORTDESC": "You gain 5th level oath spells: Lesser Restoration and Zone of Truth",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - protection from evil and good, sanctuary, 5th - lesser restoration, zone of truth, 9th - beacon of hope, dispel magic, 13th - freedom of movement, guardian of faith, 17th - commune, flame strike",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells II: Vengeance",
    "ARCHETYPE": "Oath of Vengeance",
    "CLASS": "Paladin",
    "LEVEL": "5",
    "SHORTDESC": "You gain 5th level oath spells: Hold Person and Misty Step",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - bane and hunter’s mark, 5th - hold person and misty step, 9th - haste and protection from energy, 13th - banishment and dimension door, 17th - hold monster and scrying",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells III: Ancients",
    "ARCHETYPE": "Oath of the Ancients",
    "CLASS": "Paladin",
    "LEVEL": "9",
    "SHORTDESC": "You gain 9th level oath spells: Plant Growth and Protection from Energy",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - ensnaring strike and speak with animals,\n5th - moonbeam and misty step, 9th - plant growth and protection from energy, 13th - ice storm and stoneskin, 17th - commune with nature and tree stride",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells III: Devotion",
    "ARCHETYPE": "Oath of Devotion",
    "CLASS": "Paladin",
    "LEVEL": "9",
    "SHORTDESC": "You gain 9th level oath spells: Beacon of Hope and Dispel Magic",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - protection from evil and good, sanctuary, 5th - lesser restoration, zone of truth, 9th - beacon of hope, dispel magic, 13th - freedom of movement, guardian of faith, 17th - commune, flame strike",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells III: Vengeance",
    "ARCHETYPE": "Oath of Vengeance",
    "CLASS": "Paladin",
    "LEVEL": "9",
    "SHORTDESC": "You gain 9th level oath spells: Haste and Protection from Energy",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - bane and hunter’s mark, 5th - hold person and misty step, 9th - haste and protection from energy, 13th - banishment and dimension door, 17th - hold monster and scrying",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells IV: Ancients",
    "ARCHETYPE": "Oath of the Ancients",
    "CLASS": "Paladin",
    "LEVEL": "13",
    "SHORTDESC": "You gain 13th level oath spells: Ice Storm and Stoneskin",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - ensnaring strike and speak with animals,\n5th - moonbeam and misty step, 9th - plant growth and protection from energy, 13th - ice storm and stoneskin, 17th - commune with nature and tree stride",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells IV: Devotion",
    "ARCHETYPE": "Oath of Devotion",
    "CLASS": "Paladin",
    "LEVEL": "13",
    "SHORTDESC": "You gain 13th level oath spells: Freedom of Movement and Guardian of Faith",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - protection from evil and good, sanctuary, 5th - lesser restoration, zone of truth, 9th - beacon of hope, dispel magic, 13th - freedom of movement, guardian of faith, 17th - commune, flame strike",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells IV: Vengeance",
    "ARCHETYPE": "Oath of Vengeance",
    "CLASS": "Paladin",
    "LEVEL": "13",
    "SHORTDESC": "You gain 13th level oath spells: Banishment and Dimension Door",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - bane and hunter’s mark, 5th - hold person and misty step, 9th - haste and protection from energy, 13th - banishment and dimension door, 17th - hold monster and scrying",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells V: Ancients",
    "ARCHETYPE": "Oath of the Ancients",
    "CLASS": "Paladin",
    "LEVEL": "17",
    "SHORTDESC": "You gain 17th level oath spells: Commune with Nature and Tree Stride",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - ensnaring strike and speak with animals,\n5th - moonbeam and misty step, 9th - plant growth and protection from energy, 13th - ice storm and stoneskin, 17th - commune with nature and tree stride",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells V: Devotion",
    "ARCHETYPE": "Oath of Devotion",
    "CLASS": "Paladin",
    "LEVEL": "17",
    "SHORTDESC": "You gain 17th level oath spells: Commune and Flame Strike",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - protection from evil and good, sanctuary, 5th - lesser restoration, zone of truth, 9th - beacon of hope, dispel magic, 13th - freedom of movement, guardian of faith, 17th - commune, flame strike",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Oath Spells V: Vengeance",
    "ARCHETYPE": "Oath of Vengeance",
    "CLASS": "Paladin",
    "LEVEL": "17",
    "SHORTDESC": "You gain 17th level oath spells: Hold Monster and Scrying",
    "LONGDESC": "You gain oath spells at the paladin levels listed: 3rd - bane and hunter’s mark, 5th - hold person and misty step, 9th - haste and protection from energy, 13th - banishment and dimension door, 17th - hold monster and scrying",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Open Hand Technique",
    "ARCHETYPE": "Way of the Open Hand",
    "CLASS": "Monk",
    "LEVEL": "3",
    "SHORTDESC": "When you hit a creature with one of the attacks granted by your Flurry of Blows, you can elect to: knock it prone, push it 15 feet away, or stunt its reaction until the end of your next turn.",
    "LONGDESC": "Starting when you choose this tradition at 3rd level, you can manipulate your enemy’s ki when you harness your own. Whenever you hit a creature with one of the attacks granted by your Flurry of Blows, you can impose one of the following effects on that target:\n• It must succeed on a Dexterity saving throw or be knocked prone.\n• It must make a Strength saving throw. If it fails, you can push it up to 15 feet away from you.\n• It can’t take reactions until the end of your next turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Opportunist",
    "ARCHETYPE": "Way of Shadow",
    "CLASS": "Monk",
    "LEVEL": "17",
    "SHORTDESC": "You can exploit a creature\u0027s momentary distraction when it is hit by another\u0027s attack (within 5\u0027), you can use your reaction to make a melee attack against that creature.",
    "LONGDESC": "At 17th level, you can exploit a creature\u0027s momentary distraction when it is hit by an attack. Whenever a creature within 5 feet of you is hit by an attack made by a creature other than you, you can use your reaction to make a melee attack against that creature.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Otherworldly Patron",
    "ARCHETYPE": "Base",
    "CLASS": "Warlock",
    "LEVEL": "1",
    "SHORTDESC": "You have struck a bargain with an otherworldly being of your choice, such as: the Archfey, the Fiend, or the Great Old One.",
    "LONGDESC": "At 1st level, you have struck a bargain with an\notherworldly being of your choice: the Archfey, the Fiend, or the Great Old One, each of which is detailed at the end of the class description. Your choice grants you features at 1st level and again at 6th, 10th, and 14th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Overchannel",
    "ARCHETYPE": "School of Enchantment",
    "CLASS": "Wizard",
    "LEVEL": "14",
    "SHORTDESC": "You can increase the power of your simpler spells. When you cast a wizard spell of 5th level or lower that deals damage, you can deal maximum damage with that spell.",
    "LONGDESC": "Starting at 14th level, you can increase the power of your simpler spells. When you cast a wizard spell of 5th level or lower that deals damage, you can deal maximum damage with that spell.\n     The first time you do so, you suffer no adverse effect. If you use this feature again before you finish a long rest, you take 2d12 necrotic damage for each level of the spell, immediately after you cast it. Each time you use this feature again before finishing a long rest, the necrotic damage per spell level increases by 1d12. This damage ignores resistance and immunity.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Pact Boon",
    "ARCHETYPE": "Base",
    "CLASS": "Warlock",
    "LEVEL": "3",
    "SHORTDESC": "Your otherworldly patron bestows a upon you for your loyal service. You gain one of the following features of your choice: Pact of the Chain, Blade, or the Tome.",
    "LONGDESC": "At 3rd level, your otherworldly patron bestows a  \nupon you for your loyal service. You gain one of the following features of your choice: Pact of the Chain, Blade, or the Tome.\nPact of the Chain\nYou learn the find familiar spell and can cast it as a\nritual. The spell doesn’t count against your number of spells known.\n     When you cast the spell, you can choose one of the normal forms for your familiar or one o f the following special forms: imp, pseudodragon, quasit, or sprite.\n     Additionally, when you take the Attack action, you can forgo one of your own attacks to allow your familiar to make one attack of its own.\nPact of the Blade\nYou can use your action to create a pact weapon in your empty hand. You can choose the form that this melee weapon takes each time you create it (see chapter 5 for weapon options). You are proficient with it while you wield it. This w eapon counts as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\n     Your pact weapon disappears if it is more than 5 feet away from you for 1 minute or more. It also disappears if you use this feature again, if you dismiss the w eapon (no action required), or if you die.\n     You can transform one magic w eapon into your pact weapon by performing a special ritual while you hold the weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest. You can then dismiss the weapon, shunting it into an extradimensional space, and it appears whenever you create your pact weapon thereafter. You can’t affect an artifact or a sentient weapon in this way. The weapon ceases being your pact weapon if you die, if you perform\nthe 1-hour ritual on a different w eapon, or if you use a 1-hour ritual to break your bond to it. The weapon appears at your feet if it is in the extradimensional space when the bond breaks.\nPact of the Tome\nYour patron gives you a grimoire called a Book of\nShadows. When you gain this feature, choose three cantrips from any class’s spell list. While the book is on your person, you can cast those cantrips at will. They don’t count against your number of cantrips known.\n     If you lose your Book o f Shadows, you can perform a 1-hour ceremony to receive a replacement from your patron. This ceremony can be performed during a short or long rest, and it destroys the previous book. The book turns to ash when you die.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Pact Magic",
    "ARCHETYPE": "Base",
    "CLASS": "Warlock",
    "LEVEL": "1",
    "SHORTDESC": "Your arcane research and the magic bestowed on you by your patron have given you facility with spells.",
    "LONGDESC": "Your arcane research and the magic bestowed on you by your patron have given you facility with spells.\n     You know two cantrips of your choice from the warlock spell list. You learn additional warlock cantrips of your choice at higher levels",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Paladin Spells",
    "ARCHETYPE": "Base",
    "CLASS": "Paladin",
    "LEVEL": "2",
    "SHORTDESC": "You have learned to draw on divine magic through meditation and prayer to cast spells. You must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest.",
    "LONGDESC": "By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does.\n     To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest.\n     You prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum o f one spell). The spells must be of a level for which you have spell slots.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Patient Defense",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "2",
    "SHORTDESC": "You can spend 1 ki point to take the Dodge action as a bonus action on your turn.",
    "LONGDESC": "You can spend 1 ki point to take the Dodge action as a bonus action on your turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Peerless Skill",
    "ARCHETYPE": "College of Lore",
    "CLASS": "Bard",
    "LEVEL": "14",
    "SHORTDESC": "When you make an ability check you can expend one use of Bardic Inspiration to add to your ability check.",
    "LONGDESC": "Starting at 14th level, when you make an ability check, you can expend one use of Bardic Inspiration. Roll a Bardic Inspiration die and add the number rolled to your ability check. You can choose to do so after you roil the die for the ability check, but before the DM tells you whether you succeed or fail.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Perfect Self",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "20",
    "SHORTDESC": "When you roll for initiative and have no ki points remaining, you regain 4 ki points.",
    "LONGDESC": "At 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Persistent Rage",
    "ARCHETYPE": "Base",
    "CLASS": "Barbarian",
    "LEVEL": "15",
    "SHORTDESC": "At 15th level your rage will not end unless you choose to end it or you fall unconscious.",
    "LONGDESC": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Portent",
    "ARCHETYPE": "School of Divination",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "Glimpses of the future begin to press into your awareness, allowing you to roll two d20s to replace any future attack roll, saving throw, or ability check of a creature within sight.",
    "LONGDESC": "Starting at 2nd level when you choose this school,\nglimpses of the future begin to press in on your awareness. When you finish a long rest, roll two d20s and record the numbers rolled. You can replace any attack roll, saving throw, or ability check made by you or a creature that you can see with one of these foretelling rolls. You must choose to do so before the roll, and you can replace a roll in this way only once per turn.\n     Each foretelling roll can be used only once. When you finish a long rest, you lose any unused foretelling rolls.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Potent Cantrip",
    "ARCHETYPE": "School of Enchantment",
    "CLASS": "Wizard",
    "LEVEL": "6",
    "SHORTDESC": "Your damaging cantrips affect even creatures that avoid the brunt of the effect, damaging them for half the cantrip\u0027s damage even on a successful save, but suffering no other effects.",
    "LONGDESC": "Starting at 6th level, your damaging cantrips affect even creatures that avoid the brunt of the effect. When a creature succeeds on a saving throw against your cantrip, the creature takes half the cantrip’s damage (if any) but suffers no additional effect from the cantrip.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Potent Spellcasting: Knowledge",
    "ARCHETYPE": "Knowledge Domain",
    "CLASS": "Cleric",
    "LEVEL": "8",
    "SHORTDESC": "You add your Wisdom modifier to the damage you deal with any cleric cantrip.",
    "LONGDESC": "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Potent Spellcasting: Light",
    "ARCHETYPE": "Light Domain",
    "CLASS": "Cleric",
    "LEVEL": "8",
    "SHORTDESC": "You add your Wisdom modifier to the damage you deal with any cleric cantrip.",
    "LONGDESC": "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Primal Champion",
    "ARCHETYPE": "Base",
    "CLASS": "Barbarian",
    "LEVEL": "20",
    "SHORTDESC": "At 20th level, you embody the power of the wilds, increasing your Strength and Constitution scores increase by 4 (max 24).",
    "LONGDESC": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Primal Path",
    "ARCHETYPE": "Base",
    "CLASS": "Barbarian",
    "LEVEL": "3",
    "SHORTDESC": "At 3rd level select the path of your barbarian, such as Berserker or Path of the Totem Warrior.",
    "LONGDESC": "At 3rd level, you choose a path that shapes the nature of your rage. Choose the Path of the Berserker or the Path of the Totem Warrior, both detailed at the end of theclass description. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Primal Strike",
    "ARCHETYPE": "Circle of the Moon",
    "CLASS": "Druid",
    "LEVEL": "6",
    "SHORTDESC": "Your attacks in beast form count as magical to overcome resistance and immunity to nonmagical attacks and damage.",
    "LONGDESC": "Starting at 6th level, your attacks in beast form count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Primeval Awareness",
    "ARCHETYPE": "Base",
    "CLASS": "Ranger",
    "LEVEL": "3",
    "SHORTDESC": "You can use your action and expend one ranger spell slot to focus your awareness on the region around you. You can sense magical creature types within a 6 mile radius.",
    "LONGDESC": "Beginning at 3rd level, you can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn’t reveal the creatures’ location or number.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Projected Ward",
    "ARCHETYPE": "School of Abjuration",
    "CLASS": "Wizard",
    "LEVEL": "6",
    "SHORTDESC": "When a creature that you can see within 30 feet of you takes damage, you can use your reaction to cause your Arcane Ward to absorb that damage.",
    "LONGDESC": "Starting at 6th level, when a creature that you can see within 30 feet of you takes damage, you can use your reaction to cause your Arcane Ward to absorb that damage. If this damage reduces the w ard to 0 hit points, the warded creature takes any remaining damage.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Purity of Body",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "10",
    "SHORTDESC": "At 10th level, your mastery of the ki flowing through you makes you immune to disease and poison.",
    "LONGDESC": "At 10th level, your mastery of the ki flowing through you makes you immune to disease and poison.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Purity of Spirit",
    "ARCHETYPE": "Oath of Devotion",
    "CLASS": "Paladin",
    "LEVEL": "15",
    "SHORTDESC": "You are always under the effects of a protection from evil and good spell.",
    "LONGDESC": "Beginning at 15th level, you are always under the effects of a protection from evil and good spell.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Quivering Palm",
    "ARCHETYPE": "Way of the Open Hand",
    "CLASS": "Monk",
    "LEVEL": "17",
    "SHORTDESC": "You can set up lethal vibrations in someone’s body, spending 3 ki points to start these imperceptible vibrations. When you end them the creature suffers 10d10 necrotic damage.",
    "LONGDESC": "At 17th level, you gain the ability to set up lethal\nvibrations in someone’s body. When you hit a creature with an unarmed strike, you can spend 3 ki points to start these imperceptible vibrations, which last for a number of days equal to your monk level. The vibrations are harmless unless you use your action to end them. To do so, you and the target must be on the same plane of existence. When you use this action, the creature must make a Constitution saving throw. If it fails, it is reduced to 0 hit points. If it succeeds, it takes 10d10 necrotic damage.\n     You can have only one creature under the effect of this feature at a time. You can choose to end the vibrations harmlessly without using an action.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Rage",
    "ARCHETYPE": "Base",
    "CLASS": "Barbarian",
    "LEVEL": "1",
    "SHORTDESC": "You fight with primal ferocity. On your turn, you can enter a rage as a bonus action, granting you advantage on Strength checks, increased damage, and resistance to physical damage.",
    "LONGDESC": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.\n     While raging, you gain the following benefits if you aren’t wearing heavy armor:\n• \tYou have advantage on Strength checks and Strength saving throws.\n• \tWhen you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table.\n• \tYou have resistance to bludgeoning, piercing, and slashing damage.\nIf you are able to cast spells, you can’t cast them or concentrate on them while raging.\n     Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.\n     Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Ranger Archetype",
    "ARCHETYPE": "Base",
    "CLASS": "Ranger",
    "LEVEL": "3",
    "SHORTDESC": "At 3rd level, you choose an archetype that you strive to emulate, such as: Hunter or Beast Master.",
    "LONGDESC": "At 3rd level, you choose an archetype that you strive to emulate, such as: Hunter or Beast Master. Your choice grants you features at 3rd level and again at 7th, 11th, and 15th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Ranger Spellcasting",
    "ARCHETYPE": "Base",
    "CLASS": "Ranger",
    "LEVEL": "2",
    "SHORTDESC": "You have learned to use the magical essence of nature to cast spells. You know two 1st-level spells of your choice from the ranger spell list.",
    "LONGDESC": "By the time you reach 2nd level, you have learned to use the magical essence of nature to cast spells, much as a druid does. To cast one of these spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest. You know two 1st-level spells of your choice from the ranger spell list.\n     Wisdom is your spellcasting ability for your ranger spells, since your magic draws on your attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a ranger spell you cast and when making an attack roll with one. Spell Save DC \u003d 8 + your proficiency bonus + your Wisdom modifier",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Ranger\u0027s Companion",
    "ARCHETYPE": "Beast Master",
    "CLASS": "Ranger",
    "LEVEL": "3",
    "SHORTDESC": "You gain a beast companion that accompanies you on your adventures and is trained to fight alongside you.",
    "LONGDESC": "At 3rd level, you gain a beast companion that accompanies you on your adventures and is trained to fight alongside you. Choose a beast that is no larger than Medium and that has a challenge rating of 1/4 or lower (appendix D presents statistics for the hawk, mastiff, and panther as examples). Add your proficiency bonus to the beast’s AC, attack rolls, and damage rolls, as well as to any saving throws and skills it is proficient in. Its hit point maximum equals its normal maximum or four times your ranger level, whichever is higher.\n     The beast obeys your commands as best as it can. It takes its turn on your initiative, though it doesn’t take an action unless you command it to. On your turn, you can verbally command the beast where to move (no action required by you). You can use your action to verbally command it to take the Attack, Dash, Disengage, Dodge, or Help action. Once you have the Extra Attack feature, you can make one w eapon attack yourself when you command the beast to take the Attack action.\n     While traveling through your favored terrain with only the beast, you can move stealthily at a normal pace.\n     If the beast dies, you can obtain another one by\nspending 8 hours magically bonding with another beast that isn’t hostile to you, either the same type of beast as before or a different one.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Reckless Attack",
    "ARCHETYPE": "Base",
    "CLASS": "Barbarian",
    "LEVEL": "2",
    "SHORTDESC": "Throw aside caution during battle, granting Advantage on melee (Str) weapon attack rolls, but also granting Advantage to your enemies.",
    "LONGDESC": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Relentless Avenger",
    "ARCHETYPE": "Oath of Vengeance",
    "CLASS": "Paladin",
    "LEVEL": "7",
    "SHORTDESC": "When you hit a creature with an opportunity attack, you can move up to half your speed immediately after the attack and as part of the same reaction, without provoking Opp Attacks.",
    "LONGDESC": "By 7th level, your supernatural focus helps you close off a foe’s retreat. When you hit a creature with an opportunity attack, you can move up to half your speed immediately after the attack and as part of the same reaction. This movement doesn’t provoke opportunity attacks.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Relentless Fighter",
    "ARCHETYPE": "Battle Master",
    "CLASS": "Fighter",
    "LEVEL": "15",
    "SHORTDESC": "When you roll initiative and have no superiority dice remaining, you regain 1 superiority die.",
    "LONGDESC": "Starting at 15th level, when you roll initiative and\nhave no superiority dice remaining, you regain 1\nsuperiority die.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Relentless Rage",
    "ARCHETYPE": "Base",
    "CLASS": "Barbarian",
    "LEVEL": "11",
    "SHORTDESC": "At 11th level your rage prevents you from dying from grievous wounds, allowing you a Con save and recovering to 1 hit point if you succeed.",
    "LONGDESC": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you’re raging and don’t die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.\n     Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Reliable Talent",
    "ARCHETYPE": "Base",
    "CLASS": "Rogue",
    "LEVEL": "11",
    "SHORTDESC": "You have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10.",
    "LONGDESC": "By 11th level, you have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Remarkable Athlete",
    "ARCHETYPE": "Champion",
    "CLASS": "Fighter",
    "LEVEL": "7",
    "SHORTDESC": "You can add half your proficiency bonus (round up) to any Str, Dex, or Con check you are not proficient in, and increase your running long jump by your Str mod in feet.",
    "LONGDESC": "Starting at 7th level, you can add half your proficiency bonus (round up) to any Strength, Dexterity, or Constitution check you make that doesn’t already use your proficiency bonus.\n     In addition, when you make a running long jump, the distance you can cover increases by a number of feet equal to your Strength modifier.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Reserved Feature",
    "ARCHETYPE": "Base",
    "CLASS": "Warlock",
    "LEVEL": "0",
    "SHORTDESC": "Reserved short description.",
    "LONGDESC": "Reserved long description.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Retaliation",
    "ARCHETYPE": "Path of the Berserker",
    "CLASS": "Barbarian",
    "LEVEL": "14",
    "SHORTDESC": "When you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature.",
    "LONGDESC": "Starting at 14th level, when you take damage from\na creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Roguish Archetype",
    "ARCHETYPE": "Base",
    "CLASS": "Rogue",
    "LEVEL": "3",
    "SHORTDESC": "You choose an archetype that you emulate in the exercise of your rogue abilities such as: Thief, Assassin, or Arcane Trickster.",
    "LONGDESC": "At 3rd level, you choose an archetype that you emulate in the exercise of your rogue abilities: Thief, Assassin, or Arcane Trickster, all detailed at the end of the class description. Your archetype choice grants you features at 3rd level and then again at 9th, 13th, and 17th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Sacred Oath",
    "ARCHETYPE": "Base",
    "CLASS": "Paladin",
    "LEVEL": "3",
    "SHORTDESC": "When you reach 3rd level, you swear the oath that binds you as a paladin forever, selecting a path such as: Oath of Devotion, Oath of the Ancients, or Oath of Vengeance.",
    "LONGDESC": "When you reach 3rd level, you swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Select a path such as the Oath of Devotion, the Oath of the Ancients, or the Oath of Vengeance.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Sculpt Spells",
    "ARCHETYPE": "School of Enchantment",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "You can create pockets of relative safety within the effects of your evocation spells, selecting a number of creatures to resist all damage if caught within the spell\u0027s effect.",
    "LONGDESC": "Beginning at 2nd level, you can create pockets of relative safety within the effects of your evocation spells. When you cast an evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 + the spell’s level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage if they would normally take half damage on a successful save.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Second Wind",
    "ARCHETYPE": "Base",
    "CLASS": "Fighter",
    "LEVEL": "1",
    "SHORTDESC": "You can draw upon your stamina as a bonus action to regain hit points equal to 1d10 + your fighter level.",
    "LONGDESC": "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d 10 + your fighter level.\n     Once you use this feature, you must finish a short or long rest before you can use it again.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Second-Story Work",
    "ARCHETYPE": "Thief",
    "CLASS": "Rogue",
    "LEVEL": "3",
    "SHORTDESC": "Your climbing no longer costs you extra movement, and your running long jump increases by a number of feet equal to your Dexterity modifier.",
    "LONGDESC": "When you choose this archetype at 3rd level, you gain the ability to climb faster than normal; climbing no longer costs you extra movement.\n     In addition, when you make a running jump, the distance you cover increases by a number of feet equal to your Dexterity modifier.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Shadow Arts",
    "ARCHETYPE": "Way of Shadow",
    "CLASS": "Monk",
    "LEVEL": "3",
    "SHORTDESC": "You can use your ki to duplicate the effects of certain spells, spending 2 ki points to cast darkness, darkvision, pass without trace, silence, or illusion cantrip without material components.",
    "LONGDESC": "Starting when you choose this tradition at 3rd level, you can use your ki to duplicate the effects of certain spells. As an action, you can spend 2 ki points to cast darkness, darkvision, pass without trace, or silence, without providing material components. Additionally, you gain the minor illusion cantrip if you don’t already know it.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Shadow Step",
    "ARCHETYPE": "Way of Shadow",
    "CLASS": "Monk",
    "LEVEL": "6",
    "SHORTDESC": "You can step from one shadow into another, teleporting up to 60 feet (as a bonus action) to an unoccupied space you can see that is also in dim light or darkness. You then have Advantage.",
    "LONGDESC": "At 6th level, you gain the ability to step from one shadow into another. When you are in dim light or darkness, as a bonus action you can teleport up to 60 feet to an unoccupied space you can see that is also in dim light or darkness. You then have advantage on the first melee attack you make before the end o f the turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Shapechanger",
    "ARCHETYPE": "School of Transmutation",
    "CLASS": "Wizard",
    "LEVEL": "10",
    "SHORTDESC": "You add the polymorph spell to your spellbook, and you can cast it without expending a spell slot. You can transform into a beast no greater than challenge rating 1.",
    "LONGDESC": "At 10th level, you add the polymorph spell to your spellbook, if it is not there already. You can cast polymorph without expending a spell slot. When you do so, you can target only yourself and transform into a beast whose challenge rating is 1 or lower.\n     Once you cast polymorph in this way, you can’t do so again until you finish a short or long rest, though you can still cast it normally using an available spell slot.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Share Spells",
    "ARCHETYPE": "Beast Master",
    "CLASS": "Ranger",
    "LEVEL": "15",
    "SHORTDESC": "When you cast a spell targeting yourself, you can also affect your beast companion with the spell if the beast is within 30 feet of you.",
    "LONGDESC": "Beginning at 15th level, when you cast a spell targeting yourself, you can also affect your beast companion with the spell if the beast is within 30 feet of you.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Signature Spells",
    "ARCHETYPE": "Base",
    "CLASS": "Wizard",
    "LEVEL": "20",
    "SHORTDESC": "You gain mastery over two 3rd-level wizard spells in your spellbook as your signature spells and always have them prepared between rests.",
    "LONGDESC": "When you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don’t count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. W hen you do so, you can’t do so again until you finish a short or long rest.\n     If you want to cast either spell at a higher level, you must expend a spell slot as normal.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Slippery Mind",
    "ARCHETYPE": "Base",
    "CLASS": "Rogue",
    "LEVEL": "15",
    "SHORTDESC": "You have acquired greater mental strength. You gain proficiency in Wisdom saving throws.",
    "LONGDESC": "By 15th level, you have acquired greater mental strength. You gain proficiency in Wisdom saving throws.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Slow Fall",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "4",
    "SHORTDESC": "You can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level.",
    "LONGDESC": "Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Sneak Attack",
    "ARCHETYPE": "Base",
    "CLASS": "Rogue",
    "LEVEL": "1",
    "SHORTDESC": "With a finesse or a ranged weapon, you know how to strike subtly and exploit a foe’s distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll.",
    "LONGDESC": "Beginning at 1st level, you know how to strike subtly and exploit a foe’s distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon.\n     You don’t need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn’t incapacitated, and you don’t have disadvantage on the attack roll.\n     The amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Song of Rest",
    "ARCHETYPE": "Base",
    "CLASS": "Bard",
    "LEVEL": "2",
    "SHORTDESC": "Revitalize your wounded allies with charmed music or oration during a short rest, gaining an extra 1d6 hit points.",
    "LONGDESC": "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest, each of those creatures regains an extra 1d6 hit points.\n     The extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Sorcerous Origin",
    "ARCHETYPE": "Base",
    "CLASS": "Sorcerer",
    "LEVEL": "1",
    "SHORTDESC": "Choose a sorcerous origin, which describes the source of your innate magical power such as: Draconic Bloodline or Wild Magic.",
    "LONGDESC": "Choose a sorcerous origin, which describes the\nsource of your innate magical power such as: Draconic Bloodline or Wild Magic, both detailed at the end of the class description.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Sorcerous Restoration",
    "ARCHETYPE": "Base",
    "CLASS": "Sorcerer",
    "LEVEL": "20",
    "SHORTDESC": "At 20th level, you regain 4 expended sorcery points whenever you finish a short rest.",
    "LONGDESC": "At 20th level, you regain 4 expended sorcery points whenever you finish a short rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Sorcery",
    "ARCHETYPE": "Base",
    "CLASS": "Sorcerer",
    "LEVEL": "1",
    "SHORTDESC": "An event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells.\n     At 1st level, you know four cantrips of your choice from the sorcerer spell list.",
    "LONGDESC": "An event in your past, or in the life of a parent or\nancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells.\n     At 1st level, you know four cantrips of your choice from the sorcerer spell list. You learn additional sorcerer cantrips of your choice at higher levels.\n     The Sorcerer table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these sorcerer spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Soul of Vengeance",
    "ARCHETYPE": "Oath of Vengeance",
    "CLASS": "Paladin",
    "LEVEL": "15",
    "SHORTDESC": "When a creature under the effect of your Vow of Enmity makes an attack, you can use your reaction to make a melee weapon attack against that creature if it is within range.",
    "LONGDESC": "Starting at 15th level, the authority with which you speak your Vow of Enmity gives you greater power over your foe. When a creature under the effect of your Vow of Enmity makes an attack, you can use your reaction to make a melee weapon attack against that creature if it is within range.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Spell Bombardment",
    "ARCHETYPE": "Wild Magic",
    "CLASS": "Sorcerer",
    "LEVEL": "18",
    "SHORTDESC": "Once per turn, when you roll damage for a spell and roll the highest number possible on any of the dice, choose one of those dice, roll it again and add that roll to the damage.",
    "LONGDESC": "Beginning at 18th level, the harmful energy of your spells intensifies. When you roll damage for a spell and roll the highest number possible on any of the dice, choose one of those dice, roll it again and add that roll to the damage. You can use the feature only once per turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Spell Mastery",
    "ARCHETYPE": "Base",
    "CLASS": "Wizard",
    "LEVEL": "18",
    "SHORTDESC": "You have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared.",
    "LONGDESC": "At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a\nhigher level, you must expend a spell slot as normal.\n     By spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Spell Resistance",
    "ARCHETYPE": "School of Abjuration",
    "CLASS": "Wizard",
    "LEVEL": "14",
    "SHORTDESC": "You have advantage on saving throws against spells, and you have resistance against the damage of spells.",
    "LONGDESC": "Starting at 14th level, you have advantage on saving throws against spells.\n     Furthermore, you have resistance against the\ndamage of spells.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Spell Thief",
    "ARCHETYPE": "Arcane Trickster",
    "CLASS": "Rogue",
    "LEVEL": "17",
    "SHORTDESC": "You gain the ability to magically steal a spell from another spellcaster, allowing you to cast it and preventing the original caster from casting it within 8 hours.",
    "LONGDESC": "At 17th level, you gain the ability to magically steal the knowledge of how to cast a spell from another spellcaster.\n     Immediately after a creature casts a spell that targets you or includes you in its area of effect, you can use your reaction to force the creature to make a saving throw with its spellcasting ability modifier. The DC equals your spell save DC. On a failed save, you negate the spell’s effect against you, and you steal the knowledge of the spell if it is at least 1st level and of a level you can cast (it doesn’t need to be a wizard spell). For the next 8 hours, you know the spell and can cast it using your spell slots. The creature can’t cast that spell until the 8 hours have passed.\n     Once you use this feature, you can’t use it again until you finish a long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Spirit Seeker",
    "ARCHETYPE": "Path of the Totem Warrior",
    "CLASS": "Barbarian",
    "LEVEL": "3",
    "SHORTDESC": "You gain the ability to cast the beast sense and speak with animals spells, but only as rituals.",
    "LONGDESC": "Yours is a path that seeks attunement with the natural world, giving you a kinship with beasts. At 3rd level when you adopt this path, you gain the ability to cast the beast sense and speak with animals spells, but only as rituals.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Spirit Walker",
    "ARCHETYPE": "Path of the Totem Warrior",
    "CLASS": "Barbarian",
    "LEVEL": "10",
    "SHORTDESC": "You can cast Commune with Nature spell as a ritual and a spirit animal will appear to you with the answers you seek.",
    "LONGDESC": "At 10th level, you can cast the Commune with Nature spell, but only as a ritual. When you do so, a spiritual version of one of the animals you chose for Totem Spirit or Aspect of the Beast appears to you to convey the information you seek.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Split Enchantment",
    "ARCHETYPE": "School of Enchantment",
    "CLASS": "Wizard",
    "LEVEL": "10",
    "SHORTDESC": "When you cast an enchantment spell of 1st level or higher that targets only one creature, you can have it target a second creature.",
    "LONGDESC": "Starting at 10th level, when you cast an enchantment spell of 1st level or higher that targets only one creature, you can have it target a second creature.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Step of the Wind",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "2",
    "SHORTDESC": "You can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn.",
    "LONGDESC": "You can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Stillness of Mind",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "7",
    "SHORTDESC": "You can use your action to end one effect on yourself that is causing you to be charmed or frightened.",
    "LONGDESC": "Starting at 7th level, you can use your action to end one effect on yourself that is causing you to be charmed or frightened.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Stormborn",
    "ARCHETYPE": "Tempest Domain",
    "CLASS": "Cleric",
    "LEVEL": "17",
    "SHORTDESC": "You have a flying speed equal to your current walking speed whenever you are not underground or indoors.",
    "LONGDESC": "At 17th level, you have a flying speed equal to your current walking speed whenever you are not underground or indoors.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Stroke of Luck",
    "ARCHETYPE": "Base",
    "CLASS": "Rogue",
    "LEVEL": "20",
    "SHORTDESC": "You have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit, or a save into a 20.",
    "LONGDESC": "At 20th level, you have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20.\n     Once you use this feature, you can’t use it again until you finish a short or long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Student of War",
    "ARCHETYPE": "Battle Master",
    "CLASS": "Fighter",
    "LEVEL": "3",
    "SHORTDESC": "You gain proficiency with one type of artisan’s tools of your choice.",
    "LONGDESC": "At 3rd level, you gain proficiency with one type of artisan’s tools of your choice.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Stunning Strike",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "5",
    "SHORTDESC": "You can interfere with the flow of ki in an opponent’s body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike.",
    "LONGDESC": "Starting at 5th level, you can interfere with the flow of ki in an opponent’s body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of\nyour next turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Superior Critical",
    "ARCHETYPE": "Champion",
    "CLASS": "Fighter",
    "LEVEL": "15",
    "SHORTDESC": "Your weapon attacks score a critical hit on a roll of 18-20.",
    "LONGDESC": "Starting at 15th level, your weapon attacks score a critical hit on a roll of 18-20.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Superior Hunter\u0027s Defense",
    "ARCHETYPE": "Hunter",
    "CLASS": "Ranger",
    "LEVEL": "15",
    "SHORTDESC": "You gain one o f the following features of your choice: Evasion, Stand Against the Tide, or Uncanny Dodge.",
    "LONGDESC": "At 15th level, you gain one o f the following features of your choice.\n     Evasion. You can nimbly dodge out of the way of certain area effects, such as a red dragon’s fiery breath or a lightning bolt spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.\n     Stand Against the Tide. When a hostile creature\nmisses you with a melee attack, you can use your reaction to force that creature to repeat the same attack against another creature (other than itself) of your choice.\n     Uncanny Dodge. When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack’s damage against you.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Superior Inspiration",
    "ARCHETYPE": "Base",
    "CLASS": "Bard",
    "LEVEL": "20",
    "SHORTDESC": "At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use.",
    "LONGDESC": "At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Supreme Healing",
    "ARCHETYPE": "Life Domain",
    "CLASS": "Cleric",
    "LEVEL": "17",
    "SHORTDESC": "Your healing spells dice rolls are maximized for each die.",
    "LONGDESC": "Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Supreme Sneak",
    "ARCHETYPE": "Thief",
    "CLASS": "Rogue",
    "LEVEL": "9",
    "SHORTDESC": "You have advantage on a Dexterity (Stealth) check if you move no more than half your speed on the same turn.",
    "LONGDESC": "Starting at 9th level, you have advantage on a Dexterity (Stealth) check if you move no more than half your speed on the same turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Survivor",
    "ARCHETYPE": "Champion",
    "CLASS": "Fighter",
    "LEVEL": "18",
    "SHORTDESC": "You attain the pinnacle of resilience in battle, restoring hit points at the start of every turn (5+Con mod) when your hit points are less than half - but not at zero.",
    "LONGDESC": "At 18th level, you attain the pinnacle of resilience in battle. At the start of each of your turns, you regain hit points equal to 5 + your Constitution modifier if you have no more than half of your hit points left. You don’t gain this benefit if you have 0 hit points.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Tenets of Devotion",
    "ARCHETYPE": "Oath of Devotion",
    "CLASS": "Paladin",
    "LEVEL": "3",
    "SHORTDESC": "In your holy quest, you are committed to the tenets of honesty, courage, compassion, honor, and duty.",
    "LONGDESC": "Though the exact words and strictures of the Oath of Devotion vary, paladins of this oath share these tenets.\nHonesty. Don’t lie or cheat. Let your word be your promise.\n     Courage. Never fear to act, though caution is wise.\n     Compassion. Aid others, protect the weak, and\npunish those who threaten them. Show mercy to your foes, but temper it with wisdom.\n     Honor. Treat others with fairness, and let your honorable deeds be an example to them. Do as much good as possible while causing the least\namount of harm.\n     Duty. Be responsible for your actions and their consequences, protect those entrusted to your care, and obey those who have just authority over you.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Tenets of the Ancients",
    "ARCHETYPE": "Oath of the Ancients",
    "CLASS": "Paladin",
    "LEVEL": "3",
    "SHORTDESC": "In your holy quest, you are committed to the tenets of the ancients: Kindle the Light, Shelter the Light, Preserve Your Own Light, and Be the Light.",
    "LONGDESC": "The tenets of the Oath of the Ancients have been\npreserved for uncounted centuries. This oath emphasizes the principles of good above any concerns of law or chaos. Its four central principles are simple.\n     Kindle the Light. Through your acts o f mercy,\nkindness, and forgiveness, kindle the light of hope in the world, beating back despair.\n     Shelter the Light. Where there is good, beauty, love, and laughter in the world, stand against the wickedness that would swallow it. Where life flourishes, stand against the forces that would render it barren.\n     Preserve Your Own Light. Delight in song and\nlaughter, in beauty and art. If you allow the light to die in your own heart, you can’t preserve it in the world.\n     Be the Light. Be a glorious beacon for all who live in despair. Let the light of your joy and courage shine forth in all your deeds.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Tenets of Vengeance",
    "ARCHETYPE": "Oath of Vengeance",
    "CLASS": "Paladin",
    "LEVEL": "3",
    "SHORTDESC": "In your holy quest, you are committed to the tenets of vengeance: Fight the Greater Evil, No Mercy for the Wicked, By Any Means Necessary, and Restitution.",
    "LONGDESC": "The tenets of the Oath of Vengeance vary by paladin, but all the tenets revolve around punishing wrongdoers by any means necessary. Paladins who uphold these tenets are willing to sacrifice even their own righteousness to mete out justice upon those who do evil, so the paladins are often neutral or lawful neutral in alignment. The core principles of the tenets are brutally simple.\n     Fight the Greater Evil. Faced with a choice of fighting my sworn foes or combating a lesser evil. I choose the greater evil.\n     No Mercy for the Wicked. Ordinary foes might win my mercy, but my sworn enemies do not.\n     By Any Means Necessary. My qualms can’t get in the way o f exterminating my foes.\n     Restitution. If my foes wreak ruin on the world, it is because I failed to stop them. I must help those harmed by their misdeeds.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "The Third Eye",
    "ARCHETYPE": "School of Divination",
    "CLASS": "Wizard",
    "LEVEL": "10",
    "SHORTDESC": "You can use your action to increase your powers of perception allowing you one of the following benefits: Darkvision, Ethereal Sight, Greater Comprehension, or See Invisibility.",
    "LONGDESC": "Starting at 10th level, you can use your action to increase your powers of perception. When you do so, choose one of the following benefits, which lasts until you are incapacitated or you take a short or long rest. You can’t use the feature again until you finish a rest.\n     Darkvision. You gain darkvision out to a range of 60 feet, as described in chapter 8.\n     Ethereal Sight. You can see into the Ethereal Plane within 60 feet of you.\n     Greater Comprehension. You can read any language.\n     See Invisibility. You can see invisible creatures and objects within 10 feet of you that are within line of sight.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Thief\u0027s Reflexes",
    "ARCHETYPE": "Thief",
    "CLASS": "Rogue",
    "LEVEL": "17",
    "SHORTDESC": "You have become adept at laying ambushes and quickly escaping danger, taking two turns at the beginning of combat - the second with a -10 initiative.",
    "LONGDESC": "When you reach 17th level, you have become adept at laying ambushes and quickly escaping danger. You can take two turns during the first round of any combat. You take your first turn at your normal initiative and your second turn at your initiative minus 10. You can’t use this feature when you are surprised.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Thieves\u0027 Cant",
    "ARCHETYPE": "Base",
    "CLASS": "Rogue",
    "LEVEL": "1",
    "SHORTDESC": "you learned thieves’ cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves’ cant understands such messages.",
    "LONGDESC": "During your rogue training you learned thieves’ cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves’ cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly.\n     In addition, you understand a set o f secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves’ guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Thought Shield",
    "ARCHETYPE": "The Great Old One",
    "CLASS": "Warlock",
    "LEVEL": "10",
    "SHORTDESC": "Your thoughts are shielded from others unless you allow it and you have resistance to psychic damage; whenever a creature deals psychic damage to you, that creature takes the same.",
    "LONGDESC": "Starting at 10th level, your thoughts can’t be read by telepathy or other means unless you allow it. You also have resistance to psychic damage, and whenever a creature deals psychic damage to you, that creature takes the same amount of damage that you do.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Thousand Forms",
    "ARCHETYPE": "Circle of the Moon",
    "CLASS": "Druid",
    "LEVEL": "14",
    "SHORTDESC": "You have learned to use magic to alter your physical form in more subtle ways. You can cast the alter self spell at will.",
    "LONGDESC": "By 14th level, you have learned to use magic to alter your physical form in more subtle ways. You can cast the alter self spell at will.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Thunderbolt Strike",
    "ARCHETYPE": "Tempest Domain",
    "CLASS": "Cleric",
    "LEVEL": "6",
    "SHORTDESC": "When you deal lightning damage to a Large or smaller creature, you can also push it up to 10 feet away from you.",
    "LONGDESC": "At 6th level, when you deal lightning damage to a Large or smaller creature, you can also push it up to 10 feet away from you.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Tides of Chaos",
    "ARCHETYPE": "Wild Magic",
    "CLASS": "Sorcerer",
    "LEVEL": "1",
    "SHORTDESC": "Once per day, you can manipulate the forces of chance and chaos to gain advantage on one attack roll, ability check, or saving throw.",
    "LONGDESC": "Starting at 1st level, you can manipulate the forces of chance and chaos to gain advantage on one attack roll, ability check, or saving throw. Once you do so, you must finish a long rest before you can use this feature again.\n     Any time before you regain the use of this feature, the DM can have you roll on the Wild Magic Surge table immediately after you cast a sorcerer spell of 1st level or higher. You then regain the use of this feature.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Timeless Body I",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "15",
    "SHORTDESC": "Your ki sustains you so that you suffer none of the frailty of old age, and you can\u0027t be aged magically. You can still die of old age, however. In addition, you no longer need food or water.",
    "LONGDESC": "At 15th level, your ki sustains you so that you suffer none of the frailty of old age, and you can\u0027t be aged magically. You can still die of old age, however. In addition, you no longer need food or water.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Timeless Body II",
    "ARCHETYPE": "Base",
    "CLASS": "Druid",
    "LEVEL": "18",
    "SHORTDESC": "Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year.",
    "LONGDESC": "Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Tongue of the Sun and Moon",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "13",
    "SHORTDESC": "You learn to touch the ki of other minds so that you understand all spoken languages, and creatures understand you regardless of language.",
    "LONGDESC": "Starting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Totem Spirit",
    "ARCHETYPE": "Path of the Totem Warrior",
    "CLASS": "Barbarian",
    "LEVEL": "3",
    "SHORTDESC": "You choose a totem spirit and must make or acquire a physical totem object - an amulet or similar adornment - that incorporates fur or feathers, claws, teeth, or bones of the totem animal.",
    "LONGDESC": "At 3rd level, when you adopt this path, you choose a totem spirit and gain its feature. You must make or acquire a physical totem object - an amulet or similar adornment - that incorporates fur or feathers, claws, teeth, or bones of the totem animal. At your option, you also gain minor physical attributes that are reminiscent of your totem spirit. For example, if you have a bear totem spirit, you might be unusually hairy and thickskinned, or if your totem is the eagle, your eyes turn bright yellow.\n     Your totem animal might be an animal related to those listed here but more appropriate to your homeland. For example, you could choose a hawk or vulture in place of an eagle.\n     Bear. While raging, you have resistance to all damage except psychic damage. The spirit of the bear makes you tough enough to stand up to any punishment.\n     Eagle. While you\u0027re raging and aren’t wearing\nheavy armor, other creatures have disadvantage on opportunity attack rolls against you, and you can use the Dash action as a bonus action on your turn. The spirit of the eagle makes you into a predator who can weave through the fray with ease.\n     Wolf. While you\u0027re raging, your friends have\nadvantage on melee attack rolls against any creature within 5 feet of you that is hostile to you. The spirit of the wolf makes you a leader of hunters.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Totemic Attunement",
    "ARCHETYPE": "Path of the Totem Warrior",
    "CLASS": "Barbarian",
    "LEVEL": "14",
    "SHORTDESC": "You gain another magical benefit of a totem animal of choice, which can be the same as one previously selected or a different one.",
    "LONGDESC": "At 14th level, you gain a magical benefit based on a totem animal of your choice. You can choose the same animal you selected previously or a different one.\n     Bear. While you’re raging, any creature within 5 feet of you that’s hostile to you has disadvantage on attack rolls against targets other than you or another character with this feature. An enemy is immune to this effect if it can’t see or hear you or if it can’t be frightened.\n     Eagle. While raging, you have a flying speed equal to your current walking speed. This benefit works only in short bursts; you fall if you end your turn in the air and nothing else is holding you aloft.\n     Wolf. While you’re raging, you can use a bonus action on your turn to knock a Large or smaller creature prone when you hit it with melee weapon attack.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Tranquility",
    "ARCHETYPE": "Way of the Open Hand",
    "CLASS": "Monk",
    "LEVEL": "11",
    "SHORTDESC": "You gain the ability to heal yourself. As an action, you can regain hit points equal to three times your monk level.",
    "LONGDESC": "Beginning at 11th level, you can enter a special\nmeditation that surrounds you with an aura of peace. At the end of a long rest, you gain the effect of a sanctuary spell that lasts until the start of your next long rest (the spell can end early as normal). The saving throw DC for the spell equals 8 + your Wisdom modifier + your proficiency bonus.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Transmutation Savant",
    "ARCHETYPE": "School of Transmutation",
    "CLASS": "Wizard",
    "LEVEL": "2",
    "SHORTDESC": "The gold and time you must spend to copy an transmutation spell into your spellbook is halved.",
    "LONGDESC": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy an transmutation spell into your spellbook is halved.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Transmuter\u0027s Stone",
    "ARCHETYPE": "School of Transmutation",
    "CLASS": "Wizard",
    "LEVEL": "6",
    "SHORTDESC": "You can create a transmuter’s stone, which grants you or a benefactor one of the following: Darkvision, Speed +10 ft, Constitution proficiency, or Resistance to a damage type.",
    "LONGDESC": "Starting at 6th level, you can spend 8 hours creating a transmuter’s stone that stores transmutation magic. You can benefit from the stone yourself or give it to another creature. A creature gains a benefit of your choice as long as the stone is in the creature’s possession. When you create the stone, choose the benefit from the following options:\n• Darkvision out to a range of 60 feet, as described in chapter 8\n• An increase to speed of 10 feet while the creature is unencumbered\n• Proficiency in Constitution saving throws\n• Resistance to acid, cold, fire, lightning, or thunder damage (your choice whenever you choose this benefit)\nEach time you cast a transmutation spell of 1st level or higher, you can change the effect of your stone if the stone is on your person.\n     If you create a new transmuter’s stone, the previous one ceases to function.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Turn Undead",
    "ARCHETYPE": "Base",
    "CLASS": "Cleric",
    "LEVEL": "2",
    "SHORTDESC": "As an action, you present your holy symbol and speak a prayer turning back any undead within 30 feet. If turned, it flees from you and cannot make reactions.",
    "LONGDESC": "As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.\n     A turned creature must spend its turns trying to move as far away from you as it can, and it can’t willingly move to a space within 30 feet of you. It also can’t take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there’s nowhere to move, the creature can use the Dodge action.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Unarmored Defense",
    "ARCHETYPE": "Base",
    "CLASS": "Barbarian",
    "LEVEL": "1",
    "SHORTDESC": "When not wearing armor your AC \u003d 10 + Dex mod + Con mod, but you can still use a shield.",
    "LONGDESC": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Unarmored Movement",
    "ARCHETYPE": "Base",
    "CLASS": "Monk",
    "LEVEL": "2",
    "SHORTDESC": "Your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels",
    "LONGDESC": "Starting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases by +5 ft at levels 6, 10, 14, and 18.\n     At 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Uncanny Dodge",
    "ARCHETYPE": "Base",
    "CLASS": "Rogue",
    "LEVEL": "5",
    "SHORTDESC": "When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack’s damage against you.",
    "LONGDESC": "Starting at 5th level, when an attacker that you can see hits you with an attack, you can use your reaction to halve the attack’s damage against you.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Undead Thralls",
    "ARCHETYPE": "School of Necromancy",
    "CLASS": "Wizard",
    "LEVEL": "6",
    "SHORTDESC": "You add the animate dead spell to your spellbook; casting it allows you plus one zombie or skeleton, bonus hit points and your proficiency bonus for an attack damage bonus.",
    "LONGDESC": "At 6th level, you add the animate dead spell to your spellbook if it is not there already. When you cast animate dead, you can target one additional corpse or pile of bones, creating another zombie or skeleton, as appropriate.\nWhenever you create an undead using a necromancy spell, it has additional benefits:\n• The creature’s hit point maximum is increased by an amount equal to your wizard level.\n• The creature adds your proficiency bonus to its weapon damage rolls.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Use Magic Device",
    "ARCHETYPE": "Thief",
    "CLASS": "Rogue",
    "LEVEL": "13",
    "SHORTDESC": "You have learned enough about magic that you can improvise the use of items even when they are not intended for you, ignoring all class, race, and level requirements of magic items.",
    "LONGDESC": "By 13th level, you have learned enough about the\nworkings of magic that you can improvise the use of items even when they are not intended for you. You ignore all class, race, and level requirements on the use of magic items.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Vanish",
    "ARCHETYPE": "Base",
    "CLASS": "Ranger",
    "LEVEL": "14",
    "SHORTDESC": "You can use the Hide action as a bonus action on your turn and you cannot be tracked, unless you choose to leave a trail.",
    "LONGDESC": "Starting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can’t be tracked by nonmagical means, unless you choose to leave a trail.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Versatile Trickster",
    "ARCHETYPE": "Arcane Trickster",
    "CLASS": "Rogue",
    "LEVEL": "13",
    "SHORTDESC": "With your mage hand, as a bonus action, you can distract a creature within 5 feet of the spectral hand, granting you advantage on attack rolls against that creature until the end of the turn.",
    "LONGDESC": "At 13th level, you gain the ability to distract targets with your mage hand. As a bonus action on your turn, you can designate a creature within 5 feet of the spectral hand created by the spell. Doing so gives you advantage on attack rolls against that creature until the end of the turn.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Visions of the Past",
    "ARCHETYPE": "Knowledge Domain",
    "CLASS": "Cleric",
    "LEVEL": "17",
    "SHORTDESC": "Spending at least 1 minute in meditation, you can call up visions of the past that relate to an object you hold or your immediate surroundings",
    "LONGDESC": "Starting at 17th level, you can call up visions of the past that relate to an object you hold or your immediate surroundings. You spend at least 1 minute in meditation and prayer, then receive dreamlike, shadowy glimpses of recent events. You can meditate in this way for a number of minutes equal to your Wisdom score and must maintain concentration during that time, as if you\nwere casting a spell.\n     Once you use this feature, you can’t use it again until you finish a short or long rest.\n     Object Reading. Holding an object as you meditate, you can see visions of the object’s previous owner. After meditating for 1 minute, you learn how the owner acquired and lost the object, as w ell as the most recent significant event involving the object and that owner. If the object was owned by another creature in the recent past (within a number of days equal to your Wisdom score), you can spend 1 additional minute for each owner to learn the same information about that creature.\n     Area Reading. As you meditate, you see visions\nof recent events in your immediate vicinity (a room, street, tunnel, clearing, or the like, up to a 50-foot cube), going back a number of days equal to your Wisdom score. For each minute you meditate, you learn about one significant event, beginning with the most recent. Significant events typically involve powerful emotions, such as battles and betrayals, marriages and murders,\nbirths and funerals. However, they might also include more mundane events that are nevertheless important in your current situation.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "War Magic",
    "ARCHETYPE": "Eldritch Knight",
    "CLASS": "Fighter",
    "LEVEL": "7",
    "SHORTDESC": "When you use your action to cast a cantrip, you can make one weapon attack as a bonus action.",
    "LONGDESC": "Beginning at 7th level, when you use your action to cast a cantrip, you can make one weapon attack as a bonus action.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "War Priest",
    "ARCHETYPE": "War Domain",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "Your god delivers bolts of inspiration to you while you are engaged in battle, grantin you a bonus attack action when you use a standard attack.",
    "LONGDESC": "From 1st level, your god delivers bolts of inspiration to you while you are engaged in battle. When you use the Attack action, you can make one weapon attack as a bonus action.\n     You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Warding Flare",
    "ARCHETYPE": "Light Domain",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "You can interpose divine light between yourself and an attacking enemy, imposing disadvantage on an enemy\u0027s attack roll within 30 feet.",
    "LONGDESC": "Also at 1st level, you can interpose divine light between yourself and an attacking enemy. When you are attacked by a creature within 30 feet of you that you can see, you can use your reaction to impose disadvantage on the attack roll, causing light to flare before the attacker before it hits or misses. An attacker that can’t be blinded is immune to this feature.\n     You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Weapon Bond",
    "ARCHETYPE": "Eldritch Knight",
    "CLASS": "Fighter",
    "LEVEL": "3",
    "SHORTDESC": "You learn a 1 hour ritual that creates a magical bond between yourself and one weapon. While bonded the weapon cannot be disarmed from you unless you become incapacitated.",
    "LONGDESC": "At 3rd level, you learn a ritual that creates a magical bond between yourself and one weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest. The weapon must be within your reach throughout the ritual, at the conclusion of which you touch the weapon and forge the bond.\n     Once you have bonded a weapon to yourself, you can’t be disarmed of that weapon unless you are incapacitated. If it is on the same plane of existence, you can summon that weapon as a bonus action on your turn, causing it to teleport instantly to your hand.\n     You can have up to two bonded weapons, but can summon only one at a time with your bonus action. If you attempt to bond with a third weapon, you must break the bond with one of the other two.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Well-rounded Specialist",
    "ARCHETYPE": "Base",
    "CLASS": "Fighter",
    "LEVEL": "1",
    "SHORTDESC": "Fighters learn the basics of all combat styles. Every fighter can swing an axe, fence with a rapier, wield a longsword or a greatsword, use a bow, and even trap foes in a net with some degree of skill. Likewise, a fighter is adept with shields and every form of armor.",
    "LONGDESC": "Fighters learn the basics of all combat styles. Every fighter can swing an axe, fence with a rapier, wield a longsword or a greatsword, use a bow, and even trap foes in a net with some degree of skill. Likewise, a fighter is adept with shields and every form of armor. Beyond that basic degree of familiarity, each fighter specializes in a certain style of combat. Some concentrate on archery, some on fighting with two weapons at once, and some on augmenting their martial skills with magic. This combination of broad general ability and extensive specialization makes fighters superior combatants\non battlefields and in dungeons alike.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Wholeness of Body",
    "ARCHETYPE": "Way of the Open Hand",
    "CLASS": "Monk",
    "LEVEL": "6",
    "SHORTDESC": "You gain the ability to heal yourself. As an action, you can regain hit points equal to three times your monk level.",
    "LONGDESC": "At 6th level, you gain the ability to heal yourself. As an action, you can regain hit points equal to three times your monk level. You must finish a long rest before you can use this feature again.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Wild Magic Surge",
    "ARCHETYPE": "Wild Magic",
    "CLASS": "Sorcerer",
    "LEVEL": "1",
    "SHORTDESC": "Your spellcasting can unleash surges of untamed magic, the DM can have you roll a d20 after you cast a spell: a 1, creates a random magical effect on the Wild Magic Surge table.",
    "LONGDESC": "Starting when you choose this origin at 1st level, your spellcasting can unleash surges of untamed magic. Immediately after you cast a sorcerer spell of 1st level or higher, the DM can have you roll a d20. If you roll a 1, roll on the Wild Magic Surge table to create a random magical effect.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Wild Shape",
    "ARCHETYPE": "Base",
    "CLASS": "Druid",
    "LEVEL": "2",
    "SHORTDESC": "Starting at 2nd level, you can use your action to\nmagically assume the shape o f a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.",
    "LONGDESC": "Starting at 2nd level, you can use your action to\nmagically assume the shape o f a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.\n     Your druid level determines the beasts you can\ntransform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn’t have a flying or swimming speed.\n     You can stay in a beast shape for a number o f hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.\n     While you are transformed, the following rules apply:\nYour game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those o f the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature’s bonus instead of yours. If the creature has any legendary or lair actions, you can\u0027t use them.\n• When you transform, you assume the beast’s hit\npoints and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn’t reduce your normal form to 0 hit points, you aren’t knocked unconscious.\n• You can’t cast spells, and your ability to speak or\ntake any action that requires hands is limited to the capabilities o f your beast form. Transforming doesn’t break your concentration on a spell you’ve already cast, however, or prevent you from taking actions that are part of a spell, such as call lightning, that you’ve already cast.\n• You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can’t use any o f your special senses, such as darkvision, unless your new form also has that sense.\n• You choose whether your equipment falls to the\nground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature’s shape and size. Your equipment doesn’t change size or shape to match the new form, and any equipment that the new form can’t wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form.",
    "SOURCE": "PLHBK"
  },
  {
    "FEATURE": "Wrath of the Storm",
    "ARCHETYPE": "Tempest Domain",
    "CLASS": "Cleric",
    "LEVEL": "1",
    "SHORTDESC": "You can thunderously rebuke an attacker within 5 feet, inflicting 2d8 lightning or thunder damage. You can use this a number of times equal to your Wisdom modifier (minimum once).",
    "LONGDESC": "Also at 1st level, you can thunderously rebuke attackers. When a creature within 5 feet of you that you can see hits you with an attack, you can use your reaction to cause the creature to make a Dexterity saving throw. The creature takes 2d8 lightning or thunder damage (your choice) on a failed saving throw, and half as much damage on a successful one.\n     You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
    "SOURCE": "PLHBK"
  }
]